{
  "newsItems": [
    {
      "title": "ScienceDaily: Your source for the latest research news",
      "url": "https://www.sciencedaily.com/?utm_source=valyu.ai&utm_medium=referral",
      "image_url": {
        "0": "https://www.sciencedaily.com/images/scidaily-icon.png"
      },
      "content": "Top Science News\n\n# Top Science News\n\nOctober 9, 2025\n\nJWST Spots a Hidden Red Supergiant Just Before It Exploded Oct. 9, 2025 — The James Webb Space Telescope has uncovered a massive red supergiant star just before it exploded, finally solving a cosmic mystery. Hidden beneath layers of dust, the doomed star revealed itself through Webb’s infrared eyes. The finding shows ... Tiny Asteroid Flew Right over Antarctica, and No One Saw It Coming Oct. 9, 2025 — Asteroid 2025 TF zipped past Earth above Antarctica, coming within 428 km of the surface. Roughly the size of a small car, it was detected hours after the flyby and posed no danger. ESA astronomers later confirmed its trajectory with extraordinary ... Common Medications May Secretly Rewire Your Gut for Years Oct. 9, 2025 — Drugs taken years—even decades—ago can leave lasting imprints on the gut microbiome, reshaping the community of microbes long after treatment stops. Scientists analyzing over 2,500 Estonian Biobank samples discovered that antibiotics aren’t ... Glowing Shark and Hidden Crab Found Deep Off Australia Oct. 9, 2025 — In a stunning glimpse into the mysteries of the deep, scientists have uncovered two new marine species off Western Australia—a glowing lanternshark and a tiny porcelain crab. The discoveries, made from specimens collected during a 2022 CSIRO ... Scientists Shocked as Birds Soaked in “Forever Chemicals” Still Thrive Oct. 9, 2025 — Tree swallows in polluted U.S. regions are accumulating high levels of “forever chemicals.” These durable pollutants, used in firefighting foams and consumer products, are found everywhere from soil to human blood. Surprisingly, researchers ... Scientists Suggest the Brain May Work Best with 7 Senses, Not Just 5 Oct. 8, 2025 — Scientists at Skoltech developed a new mathematical model of memory that explores how information is encoded and stored. Their analysis suggests that memory works best in a seven-dimensional conceptual space — equivalent to having seven senses. ... Scientists Just Found a Molecule That Could Stop Parkinson’s in Its Tracks Oct. 8, 2025 — Researchers have designed a peptide that prevents the deadly misfolding of alpha-synuclein, the protein behind Parkinson’s and some dementias. In lab and animal tests, it stabilized the protein and ... New Pill Could Finally Control Stubborn High Blood Pressure Oct. 8, 2025 — A new pill called baxdrostat may offer hope for people whose blood pressure stays high even after taking standard medications. In a recent study, the drug lowered blood pressure and also seemed to protect the kidneys by reducing signs of damage. ... Scientists Reveal Green Tea’s Fat-burning Secret Oct. 8, 2025 — New research shows green tea may help the body burn fat and balance blood sugar. In a study with obese mice, it improved metabolism and muscle health without harming lean animals. Scientists say its powerful plant compounds work together to regulate ... Scientists Just Proved the Moai Could Walk, Solving a 500-year Mystery Oct. 8, 2025 — Researchers confirmed that Rapa Nui’s moai statues could “walk” upright using a rocking motion, aided by rope and just a few people. Experiments with replicas and 3D models revealed design features like a forward lean and curved bases that ... Scientists Discover Orchids Sprouting from Decaying Wood Oct. 8, 2025 — Kobe University researchers found that orchids rely on wood-decaying fungi to germinate, feeding on the carbon from rotting logs. Their seedlings only grow near deadwood, forming precise fungal partnerships that mirror those seen in adult orchids ... Record Amazon Fires Release More Carbon Than an Entire Country Oct. 8, 2025 — The Amazon has suffered its most destructive fire season in more than two decades, releasing a staggering 791 million tons of carbon dioxide—on par with Germany’s annual emissions. Scientists found that for the first time, fire-driven ...\n\n## Latest Top Headlines\n\nupdated 7:56am EDT\n\n[The Hidden Denisovan Gene That Helped Humans Conquer a New World](https://www.sciencedaily.com/releases/2025/08/250824031540.htm)\n\nOct. 7, 2025 — Ancient humans crossing the Bering Strait into the Americas carried more than tools and determination—they also carried a genetic legacy from Denisovans, an extinct human relative. A new study reveals that a mysterious gene called MUC19, inherited through interbreeding between Denisovans, Neanderthals, and humans, may have played a vital role in helping early Americans survive new diseases, ...\n\nRELATED TOPICS\n\n- [Immune System](https://www.sciencedaily.com/news/health_medicine/immune_system/) - [Early Humans](https://www.sciencedaily.com/news/fossils_ruins/early_humans/) - [Personalized Medicine](https://www.sciencedaily.com/news/health_medicine/personalized_medicine/)\n\n[Bacteria Hidden Inside Tumors Could Help Beat Cancer](https://www.sciencedaily.com/releases/2025/10/251007081835.htm)\n\nOct. 7, 2025 — Scientists have discovered that bacteria living inside tumors can produce a molecule that fights cancer and enhances chemotherapy. The molecule, called 2-methylisocitrate (2-MiCit), was found to make colorectal cancer cells more vulnerable to chemotherapy by damaging their DNA and disrupting their metabolism. Experiments using worms, flies, and human cancer cells confirmed its potent anti-cancer ...\n\nRELATED TOPICS\n\n- [Personalized Medicine](https://www.sciencedaily.com/news/health_medicine/personalized_medicine/) - [Skin Care](https://www.sciencedaily.com/news/health_medicine/skin_care/) - [Pharmacology](https://www.sciencedaily.com/news/health_medicine/pharmacology/)\n\n[Scientists Finally Reveal What’s Behind Long COVID’s Mysterious Brain Fog](https://www.sciencedaily.com/releases/2025/10/251006051127.htm)\n\nOct. 7, 2025 — Researchers in Japan have pinpointed a biological cause of Long COVID brain fog using advanced PET brain imaging. They discovered widespread increases in AMPA receptor density linked to cognitive impairment and inflammation. The findings confirm brain fog as a measurable, biological condition and reveal new targets for treatment. This could open ...\n\nRELATED TOPICS\n\n- [Today's Healthcare](https://www.sciencedaily.com/news/health_medicine/today's_healthcare/) - [Mental Health](https://www.sciencedaily.com/news/mind_brain/mental_health/) - [Mental Health Research](https://www.sciencedaily.com/news/health_medicine/mental_health/)\n\n[Scientists Find Brain Circuit That Traps Alcohol Users in the Vicious Cycle of Addiction](https://www.sciencedaily.com/releases/2025/10/251006051124.htm)\n\nOct. 7, 2025 — Addiction often isn’t about chasing pleasure—it’s about escaping pain. Researchers at Scripps Research have discovered that a tiny brain region called the paraventricular nucleus of the thalamus (PVT) becomes hyperactive when animals learn that alcohol eases the agony of withdrawal. This circuit helps explain why people relapse: their brains ...\n\nRELATED TOPICS\n\n- [Nervous System](https://www.sciencedaily.com/news/health_medicine/nervous_system/) - [Neuroscience](https://www.sciencedaily.com/news/mind_brain/neuroscience/) - [Pharmacology](https://www.sciencedaily.com/news/health_medicine/pharmacology/)\n\n[Physicists Just Built a Quantum Lie Detector. It Works](https://www.sciencedaily.com/releases/2025/10/251007081840.htm)\n\nOct. 7, 2025 — An international team has confirmed that large quantum systems really do obey quantum mechanics. Using Bell’s test across 73 qubits, they proved the presence of genuine quantum correlations that can’t be explained classically. Their results show quantum computers are not just bigger, but more authentically quantum. This opens the door to more secure communication and stronger quantum ...\n\nRELATED TOPICS\n\n- [Physics](https://www.sciencedaily.com/news/matter_energy/physics/) - [Detectors](https://www.sciencedaily.com/news/matter_energy/detectors/) - [Computers and Internet](https://www.sciencedaily.com/news/computers_math/computers_and_internet/)\n\n[Scientists Finally Found the “dark Matter” of Electronics](https://www.sciencedaily.com/releases/2025/10/251003033928.htm)\n\nOct. 4, 2025 — Scientists at OIST have, for the first time, directly tracked the elusive “dark excitons” inside atomically thin materials. These quantum particles could revolutionize information technology, as they are more stable and resistant to environmental interference than current ...\n\nRELATED TOPICS\n\n- [Physics](https://www.sciencedaily.com/news/matter_energy/physics/) - [Spintronics Research](https://www.sciencedaily.com/news/computers_math/spintronics/) - [Telecommunications](https://www.sciencedaily.com/news/matter_energy/telecommunications/)\n\n[A Tiny Detector Could Unveil Gravitational Waves We’ve Never Seen Before](https://www.sciencedaily.com/releases/2025/10/251003033920.htm)\n\nOct. 3, 2025 — Researchers have designed a new type of gravitational wave detector that operates in the milli-Hertz range, a region untouched by current observatories. Built with optical resonators and atomic clocks, the compact detectors can fit on a lab table yet probe signals from exotic binaries and ancient cosmic events. Unlike LIGO, they’re relatively immune to seismic noise and could start working long ...\n\nRELATED TOPICS\n\n- [Black Holes](https://www.sciencedaily.com/news/space_time/black_holes/) - [Detectors](https://www.sciencedaily.com/news/matter_energy/detectors/) - [Physics](https://www.sciencedaily.com/news/matter_energy/physics/)\n\n[This Ultra-Thin Solar Tech Could Power Everything from Phones to Skyscrapers](https://www.sciencedaily.com/releases/2025/10/251001092218.htm)\n\nOct. 2, 2025 — A team in Sweden has unraveled the hidden structure of a promising solar material using machine learning and advanced simulations. Their findings could unlock durable, ultra-efficient solar cells for a rapidly electrifying ...\n\nRELATED TOPICS\n\n- [Chemistry](https://www.sciencedaily.com/news/matter_energy/chemistry/) - [Nanotechnology](https://www.sciencedaily.com/news/matter_energy/nanotechnology/) - [Energy and Resources](https://www.sciencedaily.com/news/matter_energy/energy_and_resources/)\n\n[The Red Sea That Vanished and the Catastrophic Flood That Brought It Back](https://www.sciencedaily.com/releases/2025/10/251007081831.htm)\n\nOct. 8, 2025 — Researchers at KAUST have confirmed that the Red Sea once vanished entirely, turning into a barren salt desert before being suddenly flooded by waters from the Indian Ocean. The flood carved deep channels and restored marine life in less than 100,000 years. This finding redefines the Red Sea’s role as a key site for studying how oceans form and evolve through extreme geological ...\n\nRELATED TOPICS\n\n- [Ecology](https://www.sciencedaily.com/news/earth_climate/ecology/) - [Ecology Research](https://www.sciencedaily.com/news/plants_animals/ecology/) - [Global Warming](https://www.sciencedaily.com/news/earth_climate/global_warming/)\n\n[From Gentle Giants to Ghostly Hunters, Sharks Face an Unseen Peril](https://www.sciencedaily.com/releases/2025/10/251004092909.htm)\n\nOct. 5, 2025 — New research reveals that deep-sea mining could dramatically threaten 30 species of sharks, rays, and ghost sharks whose habitats overlap with proposed mining zones. Many of these species, already at risk of extinction, could face increased dangers from seafloor disruptions and sediment plumes caused by mining ...\n\nRELATED TOPICS\n\n- [Ecology](https://www.sciencedaily.com/news/earth_climate/ecology/) - [Ecosystems](https://www.sciencedaily.com/news/earth_climate/ecosystems/) - [Ecology Research](https://www.sciencedaily.com/news/plants_animals/ecology/)\n\n[Japan’s Hot Springs Hold Clues to the Origins of Life on Earth](https://www.sciencedaily.com/releases/2025/10/251002074009.htm)\n\nOct. 3, 2025 — Billions of years ago, Earth’s atmosphere was hostile, with barely any oxygen and toxic conditions for life. Researchers from the Earth-Life Science Institute studied Japan’s iron-rich hot springs, which mimic the ancient oceans, to uncover how early microbes survived. They discovered communities of bacteria that thrived on iron and tiny amounts of oxygen, forming ecosystems that recycled ...\n\nRELATED TOPICS\n\n- [Ecology](https://www.sciencedaily.com/news/earth_climate/ecology/) - [Environmental Science](https://www.sciencedaily.com/news/earth_climate/environmental_science/) - [Ecosystems](https://www.sciencedaily.com/news/earth_climate/ecosystems/)\n\n[Scientists Just Recreated a Wildfire That Made Its Own Weather](https://www.sciencedaily.com/releases/2025/10/251002074001.htm)\n\nOct. 2, 2025 — In 2020, California’s Creek Fire became so intense that it generated its own thunderstorm, a phenomenon called a pyrocumulonimbus cloud. For years, scientists struggled to replicate these explosive fire-born storms in climate models, leaving major gaps in understanding their global effects. Now, a new study has finally simulated them successfully, reproducing the Creek Fire’s storm and others ...\n\nRELATED TOPICS\n\n- [Severe Weather](https://www.sciencedaily.com/news/earth_climate/severe_weather/) - [Air Quality](https://www.sciencedaily.com/news/earth_climate/air_quality/) - [Natural Disasters](https://www.sciencedaily.com/news/earth_climate/natural_disasters/)\n\n- Top Health - [Ancient DNA Secret That Shaped Human Survival](https://www.sciencedaily.com/releases/2025/08/250824031540.htm) - [Bacteria Hidden in Tumors Help Kill Cancer](https://www.sciencedaily.com/releases/2025/10/251007081835.htm) - [Long COVID Brain Fog May Finally Be Explained](https://www.sciencedaily.com/releases/2025/10/251006051127.htm) - [Brain Circuit Fuels Vicious Cycle of Addiction](https://www.sciencedaily.com/releases/2025/10/251006051124.htm) - Top Physical/Tech - [Physicists Built a Quantum Lie Detector](https://www.sciencedaily.com/releases/2025/10/251007081840.htm) - [The “Dark Matter” of Electronics](https://www.sciencedaily.com/releases/2025/10/251003033928.htm) - [Tiny Detector Unlocks Hidden Gravitational Waves](https://www.sciencedaily.com/releases/2025/10/251003033920.htm) - [Ultra-Thin Solar Tech Could Power Everything](https://www.sciencedaily.com/releases/2025/10/251001092218.htm) - Top Environment - [When the Red Sea Became a Desert](https://www.sciencedaily.com/releases/2025/10/251007081831.htm) - [Ghost Sharks Face a Hidden Deep-Sea Threat](https://www.sciencedaily.com/releases/2025/10/251004092909.htm) - [Hot Springs Hold Clues to the Origins of Life](https://www.sciencedaily.com/releases/2025/10/251002074009.htm) - [Recreating a Wildfire That Made Its Own Weather](https://www.sciencedaily.com/releases/2025/10/251002074001.htm)\n\nmore top science stories\n\n/Top Science News\n\nHealth News\n\n## Health News\n\nOctober 9, 2025\n\nNew Research Reveals What’s Really Hiding in Bottled Water Oct. 6, 2025 — A chance encounter with plastic waste on a tropical beach sparked a deep investigation into what those fragments mean for human health. The research reveals that bottled water isn’t as pure as it seems—each sip may contain invisible ... It’s Not Just Genes — Parents Can Pass Down Longevity Another Way Oct. 6, 2025 — Scientists studying tiny roundworms have uncovered how the secrets of a long life can be passed from parents to their offspring — without changing DNA. The discovery shows that when certain cellular structures called lysosomes change in ways that ... Nearly Half of Drivers Killed in Crashes Had THC in Their Blood Oct. 5, 2025 — Over 40% of fatal crash victims had THC levels far above legal limits, showing cannabis use before driving remains widespread. The rate didn’t drop after legalization, suggesting policy changes haven’t altered risky habits. Experts warn that the ... Why the Brain’s GPS Fails with Age, and How Some Minds Defy It Oct. 5, 2025 — Stanford scientists found that aging disrupts the brain’s internal navigation system in mice, mirroring spatial memory decline in humans. Older mice struggled to recall familiar locations, while a few “super-agers” retained youthful brain ... Why Ultra-processed Foods Aren’t the Real Villain Behind Overeating Oct. 5, 2025 — Researchers from Leeds found that overeating is driven more by what people believe about food than by its actual ingredients or level of processing. Foods perceived as fatty, sweet, or highly processed were more likely to trigger indulgence. ... Scientists Discover Hidden Protein That Switches Off Hunger Oct. 5, 2025 — Researchers have uncovered how a protein called MRAP2 acts as a key regulator of hunger. It helps move the appetite receptor MC4R to the cell’s surface, allowing it to send stronger “stop eating” signals. The discovery offers new hope for ... Think Light Drinking Protects Your Brain? Think Again Oct. 4, 2025 — A massive new study combining observational and genetic data overturns the long-held belief that light drinking protects the brain. Researchers found that dementia risk rises in direct proportion to alcohol consumption, with no safe level ... This New Semaglutide Dose Helped Nearly Half of Patients Lose 20% Body Weight Oct. 4, 2025 — The STEP UP trials revealed that a 7.2 mg dose of semaglutide led to greater weight loss than the currently approved 2.4 mg dose. Nearly half of participants lost 20% or more of their body weight, ... Hidden Cellular “Power Switch” Could Transform Parkinson’s Treatment Oct. 4, 2025 — Researchers uncovered a key cellular regulator, PP2A-B55alpha, that controls both the cleanup of damaged mitochondria and the creation of new ones. In Parkinson’s disease models, reducing this regulator improved symptoms and mitochondrial health. ... Doctors Stunned by a Cheap Drug’s Power Against Colon Cancer Oct. 4, 2025 — A Scandinavian clinical trial has revealed that low-dose aspirin can halve the risk of colon and rectal cancer recurrence in patients with specific genetic mutations. The research, involving over 3,500 patients, is the first randomized study to ... Fat May Secretly Fuel Alzheimer’s, New Research Finds Oct. 3, 2025 — New research from Houston Methodist reveals how obesity may directly drive Alzheimer’s disease. Scientists discovered that tiny messengers released by fat tissue, called extracellular vesicles, can carry harmful signals that accelerate the buildup ... Scientists Just Cracked the Mystery of Why Cancer Immunotherapy Fails Oct. 3, 2025 — Ohio State researchers have discovered that exhausted T cells collapse under the weight of misfolded proteins, activating a destructive stress response called TexPSR. Unlike normal stress systems, TexPSR accelerates protein production, flooding the ...\n\n## Latest Health Headlines\n\nupdated 7:56am EDT\n\n[A Psychedelic Surprise: DMT Helps the Brain Heal After Stroke](https://www.sciencedaily.com/releases/2025/10/251006051129.htm)\n\nOct. 7, 2025 — Scientists have discovered that DMT, a natural compound found in plants and even the human brain, can dramatically reduce brain damage caused by stroke. The psychoactive molecule, long known for its hallucinogenic effects, restored the blood-brain barrier and reduced inflammation in animal and cell studies. These findings suggest that DMT could complement existing stroke treatments, potentially ...\n\nRELATED TOPICS\n\n- [Heart Disease](https://www.sciencedaily.com/news/health_medicine/heart_disease/) - [Immune System](https://www.sciencedaily.com/news/health_medicine/immune_system/) - [Diseases and Conditions](https://www.sciencedaily.com/news/health_medicine/diseases_and_conditions/)\n\n[Nanotech Transforms Vinegar Into a Lifesaving Superbug Killer](https://www.sciencedaily.com/releases/2025/10/251006051122.htm)\n\nOct. 6, 2025 — Researchers have enhanced vinegar’s antibacterial properties by infusing it with cobalt-based carbon nanoparticles. This nano-boosted solution kills harmful bacteria from both inside and outside their cells while remaining safe for humans. Tests on mice showed it healed infected wounds effectively. The discovery could be a breakthrough against antibiotic-resistant infections ...\n\nRELATED TOPICS\n\n- [Diabetes](https://www.sciencedaily.com/news/health_medicine/diabetes/) - [Pharmacology](https://www.sciencedaily.com/news/health_medicine/pharmacology/) - [Pharmaceuticals](https://www.sciencedaily.com/news/health_medicine/pharmaceuticals/)\n\n[You Don’t Have to Lose Weight to Lower Your Diabetes Risk, Scientists Say](https://www.sciencedaily.com/releases/2025/10/251006051117.htm)\n\nOct. 6, 2025 — A major study from Tübingen found that prediabetic individuals who normalized their blood sugar through healthy habits — even without shedding pounds — cut their risk of type 2 diabetes by 71%. Researchers discovered that improved fat distribution, particularly less abdominal fat, was key. The findings suggest that focusing solely on weight loss may overlook the true drivers of diabetes ...\n\nRELATED TOPICS\n\n- [Diet and Weight Loss](https://www.sciencedaily.com/news/health_medicine/diet_and_weight_loss/) - [Diabetes](https://www.sciencedaily.com/news/health_medicine/diabetes/) - [Skin Care](https://www.sciencedaily.com/news/health_medicine/skin_care/)\n\n[Scientists Find Hidden Brain Damage Behind Dementia](https://www.sciencedaily.com/releases/2025/10/251005085637.htm)\n\nOct. 6, 2025 — A University of New Mexico scientist is revealing what might be one of the most overlooked causes of dementia — damage in the brain’s tiny blood vessels. Dr. Elaine Bearer has created a new way to classify these changes, showing that many people diagnosed with Alzheimer’s also suffer from vascular damage that quietly destroys brain tissue. Even more surprising, she’s finding microplastics ...\n\nRELATED TOPICS\n\n- [Diabetes](https://www.sciencedaily.com/news/health_medicine/diabetes/) - [Hypertension](https://www.sciencedaily.com/news/health_medicine/hypertension/) - [Dementia](https://www.sciencedaily.com/news/mind_brain/dementia/)\n\n[Brain Cancer That Eats the Skull Stuns Scientists](https://www.sciencedaily.com/releases/2025/10/251005085618.htm)\n\nOct. 5, 2025 — A new study shows glioblastoma isn’t confined to the brain—it erodes the skull and hijacks the immune system within skull marrow. The cancer opens channels that let inflammatory cells enter the brain, fueling its deadly progression. Even drugs meant to protect bones can make things worse, highlighting the need for therapies that target both brain and bone. The discovery reframes glioblastoma ...\n\nRELATED TOPICS\n\n- [Medical Imaging](https://www.sciencedaily.com/news/health_medicine/medical_imaging/) - [Today's Healthcare](https://www.sciencedaily.com/news/health_medicine/today's_healthcare/) - [Medical Devices](https://www.sciencedaily.com/news/health_medicine/medical_devices/)\n\n[Strong Friendships May Literally Slow Aging at the Cellular Level](https://www.sciencedaily.com/releases/2025/10/251004092917.htm)\n\nOct. 5, 2025 — Scientists discovered that lifelong social support can slow biological aging. Using DNA-based “epigenetic clocks,” they found that people with richer, more sustained relationships showed younger biological profiles and lower inflammation. The effect wasn’t about single friendships but about consistent connections across ...\n\nRELATED TOPICS\n\n- [Diabetes](https://www.sciencedaily.com/news/health_medicine/diabetes/) - [Diet and Weight Loss](https://www.sciencedaily.com/news/health_medicine/diet_and_weight_loss/) - [Heart Disease](https://www.sciencedaily.com/news/health_medicine/heart_disease/)\n\n[The Invisible Chemical in the Air That Could Be Raising Parkinson’s Risk](https://www.sciencedaily.com/releases/2025/10/251003033913.htm)\n\nOct. 3, 2025 — A massive nationwide study has linked long-term exposure to the industrial chemical trichloroethylene (TCE) with a higher risk of Parkinson’s disease in older adults. Researchers examined over 1.1 million people, finding that those living in areas with the highest outdoor TCE levels faced a 10% greater risk of developing ...\n\nRELATED TOPICS\n\n- [Health Policy](https://www.sciencedaily.com/news/health_medicine/health_policy/) - [Diseases and Conditions](https://www.sciencedaily.com/news/health_medicine/diseases_and_conditions/) - [Healthy Aging](https://www.sciencedaily.com/news/health_medicine/healthy_aging/)\n\n[Poor Sleep Speeds Brain Aging and May Raise Dementia Risk](https://www.sciencedaily.com/releases/2025/10/251002074014.htm)\n\nOct. 2, 2025 — New research shows that poor sleep could make the brain appear years older than it really is. Using MRI scans and machine learning, scientists found a clear link between unhealthy sleep patterns and accelerated brain ...\n\nRELATED TOPICS\n\n- [Sleep Disorder Research](https://www.sciencedaily.com/news/health_medicine/sleep_disorders/) - [Alzheimer's](https://www.sciencedaily.com/news/mind_brain/alzheimer's/) - [Alzheimer's Research](https://www.sciencedaily.com/news/health_medicine/alzheimer's/)\n\n[The Vitamin D Mistake Weakening Your Immunity](https://www.sciencedaily.com/releases/2025/10/251004092911.htm)\n\nOct.",
      "source": "News Source",
      "date": "2025-10-09T14:29:58.210Z"
    },
    {
      "title": "Biomedical Research Career Programme to bridge regional disparities, promote women scientists: Govt",
      "url": "https://www.prokerala.com/news/articles/a1684018.html?utm_source=valyu.ai&utm_medium=referral",
      "image_url": {
        "0": "https://files.prokerala.com/images/150x125/athens-greece.jpg",
        "1": "https://files.prokerala.com/images/150x125/tuscany-italy.jpg",
        "2": "https://files.prokerala.com/news/photos/imgs/150x125/a-tourist-enjoys-landscape-at-the-scenic-area-of-329676.jpg",
        "3": "https://files.prokerala.com/images/150x125/tallest-woman.jpg",
        "4": "https://files.prokerala.com/images/150x125/paris.jpg"
      },
      "content": "New Delhi, Oct 9 : The recently launched phase-III of the Biomedical Research Career Programme (BRCP) will help bridge regional disparities and promote women scientists in the country, the government said on Thursday.\n\nEarlier this month, Phase III of the BRCP, to be implemented during 2025-26 to 2030-31, with an extended service phase up to 2037-38, was approved by the Union Cabinet.\n\n\"BRCP Phase-III aims to bridge regional disparities and promote inclusivity -- especially for women scientists,\" according to an official statement.\n\nThe programme supports scientists at different stages of their careers through fellowships and collaborative grants, encouraging high-quality, ethical research to tackle key public health challenges in India.\n\nThe Phase-III will be implemented with a total outlay of Rs 1,500 crore. Of this, the Department of Biotechnology under the Ministry of Science and Technology will contribute Rs 1,000 crore, while the Wellcome Trust (UK) will contribute Rs 500 crore.\n\n\"Phase-III is expected to set new benchmarks for biomedical excellence in India,\" according to an official statement.\n\nThe Phase III of BRCP will train over 2,000 students and post-doctoral students fellows, enable high-impact publications, generate patentable discoveries, and push 25-30 per cent of collaborative programmes to Technology Readiness Level (TRL-4).\n\nIn addition, \"the programme will also provide a 10-15 per cent increase in support to women scientists, encouraging greater inclusivity in India's research ecosystem,\" the statement said.\n\n\"The initiative is directly aligned with the national vision of Viksit Bharat 2047, positioning India as a global hub for biomedical innovation and translational research,\" it added.\n\nThe BRCP will nurture top scientific talent, advance interdisciplinary and translational research, and strengthen research ecosystems.\n\nBiomedical research in India has previously contributed to the development of low-cost diagnostics like CRISPR-based kits and dengue rapid tests, indigenous vaccines for pneumonia, measles-rubella, and Covid-19.\n\n\"These efforts are making healthcare more accessible, equitable, and self-reliant, and positioning India as a global leader in biomedical innovation,\" the statement said.\n\n### You May Like\n\n### Entertainment News\n\n### Latest News",
      "source": "News Source",
      "date": "2025-10-09T14:29:58.210Z"
    },
    {
      "title": "Health & Medicine News -- ScienceDaily",
      "url": "https://www.sciencedaily.com/news/health_medicine/?utm_source=valyu.ai&utm_medium=referral",
      "image_url": {
        "0": "https://www.sciencedaily.com/images/scidaily-icon.png"
      },
      "content": "Top Science News\n\n# Health & Medicine News\n\nOctober 8, 2025\n\n## Top Headlines\n\nThe Hidden Denisovan Gene That Helped Humans Conquer a New World Oct. 7, 2025 — Ancient humans crossing the Bering Strait into the Americas carried more than tools and determination—they also carried a genetic legacy from Denisovans, an extinct human relative. A new study reveals that a mysterious gene called MUC19, inherited ... Bacteria Hidden Inside Tumors Could Help Beat Cancer Oct. 7, 2025 — Scientists have discovered that bacteria living inside tumors can produce a molecule that fights cancer and enhances chemotherapy. The molecule, called 2-methylisocitrate (2-MiCit), was found to make colorectal cancer cells more vulnerable to ... A Psychedelic Surprise: DMT Helps the Brain Heal After Stroke Oct. 7, 2025 — Scientists have discovered that DMT, a natural compound found in plants and even the human brain, can dramatically reduce brain damage caused by stroke. The psychoactive molecule, long known for its hallucinogenic effects, restored the blood-brain ... Scientists Finally Reveal What’s Behind Long COVID’s Mysterious Brain Fog Oct. 7, 2025 — Researchers in Japan have pinpointed a biological cause of Long COVID brain fog using advanced PET brain imaging. They discovered widespread increases in AMPA receptor density linked to cognitive ... Scientists Find Brain Circuit That Traps Alcohol Users in the Vicious Cycle of Addiction Oct. 7, 2025 — Addiction often isn’t about chasing pleasure—it’s about escaping pain. Researchers at Scripps Research have discovered that a tiny brain region called the paraventricular nucleus of the ... Nanotech Transforms Vinegar Into a Lifesaving Superbug Killer Oct. 6, 2025 — Researchers have enhanced vinegar’s antibacterial properties by infusing it with cobalt-based carbon nanoparticles. This nano-boosted solution kills harmful bacteria from both inside and outside their cells while remaining safe for humans. Tests ... You Don’t Have to Lose Weight to Lower Your Diabetes Risk, Scientists Say Oct. 6, 2025 — A major study from Tübingen found that prediabetic individuals who normalized their blood sugar through healthy habits — even without shedding pounds — cut their risk of type 2 diabetes by 71%. Researchers discovered that improved fat ... New Research Reveals What’s Really Hiding in Bottled Water Oct. 6, 2025 — A chance encounter with plastic waste on a tropical beach sparked a deep investigation into what those fragments mean for human health. The research reveals that bottled water isn’t as pure as it seems—each sip may contain invisible ... Scientists Find Hidden Brain Damage Behind Dementia Oct. 6, 2025 — A University of New Mexico scientist is revealing what might be one of the most overlooked causes of dementia — damage in the brain’s tiny blood vessels. Dr. Elaine Bearer has created a new way to classify these changes, showing that many people ... It’s Not Just Genes — Parents Can Pass Down Longevity Another Way Oct. 6, 2025 — Scientists studying tiny roundworms have uncovered how the secrets of a long life can be passed from parents to their offspring — without changing DNA. The discovery shows that when certain cellular structures called lysosomes change in ways that ... Nearly Half of Drivers Killed in Crashes Had THC in Their Blood Oct. 5, 2025 — Over 40% of fatal crash victims had THC levels far above legal limits, showing cannabis use before driving remains widespread. The rate didn’t drop after legalization, suggesting policy changes haven’t altered risky habits. Experts warn that the ... Brain Cancer That Eats the Skull Stuns Scientists Oct. 5, 2025 — A new study shows glioblastoma isn’t confined to the brain—it erodes the skull and hijacks the immune system within skull marrow. The cancer opens channels that let inflammatory cells enter the brain, fueling its deadly progression. Even drugs ...\n\n## Latest Headlines\n\nupdated 9:46am EDT\n\nWould You Eat Yogurt Made With Ants? Scientists Did Oct. 6, 2025 — In a remarkable blend of science and tradition, researchers have revived an old Balkan and Turkish yogurt-making technique that uses ants as natural fermenters. The ants’ bacteria, acids, and ... Why the Brain’s GPS Fails With Age, and How Some Minds Defy It Oct. 5, 2025 — Stanford scientists found that aging disrupts the brain’s internal navigation system in mice, mirroring spatial memory decline in humans. Older mice struggled to recall familiar locations, while a ... Why Ultra-Processed Foods Aren’t the Real Villain Behind Overeating Oct. 5, 2025 — Researchers from Leeds found that overeating is driven more by what people believe about food than by its actual ingredients or level of processing. Foods perceived as fatty, sweet, or highly ... Strong Friendships May Literally Slow Aging at the Cellular Level Oct. 5, 2025 — Scientists discovered that lifelong social support can slow biological aging. Using DNA-based “epigenetic clocks,” they found that people with richer, more sustained relationships showed younger ... Scientists Just Found Cancer Cells’ Hidden Power Source Oct. 5, 2025 — When cancer cells are physically squeezed, they mount an instant, high-energy defense by rushing mitochondria to the cell nucleus, unleashing a surge of ATP that fuels DNA repair and survival. This ... Scientists Discover Hidden Protein That Switches Off Hunger Oct. 5, 2025 — Researchers have uncovered how a protein called MRAP2 acts as a key regulator of hunger. It helps move the appetite receptor MC4R to the cell’s surface, allowing it to send stronger “stop ... Think Light Drinking Protects Your Brain? Think Again Oct. 4, 2025 — A massive new study combining observational and genetic data overturns the long-held belief that light drinking protects the brain. Researchers found that dementia risk rises in direct proportion to ... This New Semaglutide Dose Helped Nearly Half of Patients Lose 20% Body Weight Oct. 4, 2025 — The STEP UP trials revealed that a 7.2 mg dose of semaglutide led to greater weight loss than the currently approved 2.4 mg dose. Nearly half of ... Hidden Cellular “power Switch” Could Transform Parkinson’s Treatment Oct. 4, 2025 — Researchers uncovered a key cellular regulator, PP2A-B55alpha, that controls both the cleanup of damaged mitochondria and the creation of new ones. In Parkinson’s disease models, reducing this ... The Vitamin D Mistake Weakening Your Immunity Oct. 4, 2025 — Scientists discovered that vitamin D2 supplements can lower levels of vitamin D3, the form the body uses most effectively. Unlike D2, vitamin D3 enhances the immune system’s first line of defense ...\n\n- [Making Yogurt With Ants](https://www.sciencedaily.com/releases/2025/10/251005085623.htm) - [Why the Brain’s GPS Fails With Age](https://www.sciencedaily.com/releases/2025/10/251005085616.htm) - [The Real Reason You Can’t Stop Eating](https://www.sciencedaily.com/releases/2025/10/251005085625.htm) - [Stronger Friendships, Slower Aging](https://www.sciencedaily.com/releases/2025/10/251004092917.htm) - [Cancer Cells Spark to Life Under Pressure](https://www.sciencedaily.com/releases/2025/10/251004092915.htm) - [Hidden Protein That Switches Off Hunger](https://www.sciencedaily.com/releases/2025/10/251004092905.htm) - [Even a Little Alcohol May Raise Dementia Risk](https://www.sciencedaily.com/releases/2025/10/251004092919.htm) - [High-Dose Semaglutide Redefines Weight Loss](https://www.sciencedaily.com/releases/2025/10/251004092913.htm) - [Cellular Switch Found That May Halt ...](https://www.sciencedaily.com/releases/2025/10/251004092903.htm) - [The Vitamin D Mistake Weakening Your Immunity](https://www.sciencedaily.com/releases/2025/10/251004092911.htm)\n\n/Top Science News\n\n## Earlier Headlines\n\n- [Summaries](#summaries) - [Headlines](#headlines)\n\nThis “chaos Enzyme” May Hold the Key to Stopping Cancer Spread Oct. 4, 2025 — A Weill Cornell Medicine team has found that triple-negative breast cancer depends on the enzyme EZH2 to spread. By silencing key genes, EZH2 drives chaotic cell divisions and fuels metastasis. ... Fat May Secretly Fuel Alzheimer’s, New Research Finds Oct. 3, 2025 — New research from Houston Methodist reveals how obesity may directly drive Alzheimer’s disease. Scientists discovered that tiny messengers released by fat tissue, called extracellular vesicles, can ... A Single Dose of Psilocybin May Rewire the Brain for Lasting Relief Oct. 2, 2025 — Penn researchers found that psilocybin can calm brain circuits tied to pain and mood, easing both physical suffering and emotional distress in animal studies. The compound works in the anterior ... The Invisible Chemical in the Air That Could Be Raising Parkinson’s Risk Oct. 3, 2025 — A massive nationwide study has linked long-term exposure to the industrial chemical trichloroethylene (TCE) with a higher risk of Parkinson’s disease in older adults. Researchers examined over 1.1 ... Scientists Just Cracked the Mystery of Why Cancer Immunotherapy Fails Oct. 3, 2025 — Ohio State researchers have discovered that exhausted T cells collapse under the weight of misfolded proteins, activating a destructive stress response called TexPSR. Unlike normal stress systems, ... A Flu Test You Can Chew Oct. 3, 2025 — Flu detection could soon be as simple as chewing gum. Scientists have created a molecular sensor that releases a thyme-like flavor when it encounters influenza, offering a low-tech, taste-based ... DOLPHIN AI Uncovers Hundreds of Invisible Cancer Markers Oct. 1, 2025 — A new AI tool called DOLPHIN exposes hidden genetic markers inside single cells, enabling earlier detection and more precise treatment choices. It also sets the stage for building virtual models of ... Poor Sleep Speeds Brain Aging and May Raise Dementia Risk Oct. 2, 2025 — New research shows that poor sleep could make the brain appear years older than it really is. Using MRI scans and machine learning, scientists found a clear link between unhealthy sleep patterns and ... Black Mamba Venom Has a Deadly Hidden Second Strike Sep. 30, 2025 — Scientists have uncovered a dangerous hidden feature in Black Mamba venom that explains why antivenoms sometimes fail. The study revealed that several mamba species launch a dual neurological attack, ... Long Commutes and Small Homes Are Wrecking Sleep Sep. 30, 2025 — Tokyo residents face a trade-off between home size and commute time when it comes to sleep health. A new study shows longer commutes increase both insomnia and daytime sleepiness, while smaller ... Why Gen X Women Can’t Stop Eating Ultra-Processed Foods Sep. 29, 2025 — Researchers found that middle-aged adults, especially women, are far more likely to be addicted to ultra-processed foods than older generations. Marketing of diet-focused processed foods in the 1980s ... Simple Blood Test Predicts Liver Disease Years Before Symptoms Sep. 29, 2025 — Researchers in Sweden and Finland have created the CORE model, a simple blood test that predicts liver disease risk with striking accuracy. Unlike current methods, it works for the general population ... Stunning Images Reveal How Antibiotics Shatter Bacterial Defenses Sep. 29, 2025 — Researchers have revealed how polymyxins, crucial last-resort antibiotics, break down bacterial armor by forcing cells to overproduce and shed it. Astonishingly, the drugs only kill bacteria when ... New Inhaler Halves Childhood Asthma Attacks Sep. 28, 2025 — A groundbreaking international study has shown that a 2-in-1 budesonide-formoterol inhaler is far more effective than the standard salbutamol inhaler in children with mild asthma, cutting attacks by ... Fruit Might Be the Surprising Key to Healthier Lungs Sep. 28, 2025 — Eating more fruit could help protect lungs from air pollution damage, particularly in women. Researchers point to antioxidants and anti-inflammatory compounds in fruit as possible defenses against ... Doctors Tested a Common Drug on COVID. The Results Are Stunning Sep. 28, 2025 — Inhaled heparin significantly lowers the risk of death and ventilation in COVID-19 patients while also showing potential against other respiratory infections. With its unique triple-action benefits, ... Millions Could Be Living With Hidden Smell Loss After COVID Without Knowing Oct. 3, 2025 — A massive NIH-backed study reveals that COVID-19’s toll on smell may be more widespread and lasting than most realize. Even patients without noticeable symptoms often performed poorly on scent ... Scientists Uncover How to Block Pain Without Side Effects Sep. 26, 2025 — Scientists have discovered a way to block pain while still allowing the body’s natural healing to take place. Current painkillers like ibuprofen and aspirin often come with harmful side effects ... Scientists Finally Explain the Real Reason Pregnant Women Get Morning Sickness Sep. 29, 2025 — Morning sickness isn’t just random misery—it’s a biological defense system shaped by evolution to protect the fetus. By linking immune responses to nausea and food aversions, UCLA researchers ... The Hidden Iron Switch That Makes Cancer Cells Self-Destruct Sep. 29, 2025 — Scientists discovered that inhibiting the enzyme STK17B forces multiple myeloma cells into iron-driven death and makes therapies more effective. Early mouse studies show strong potential for a new ...\n\nend summaries tab\n\n### Saturday, October 4, 2025\n\n- [This “chaos Enzyme” May Hold the Key to Stopping Cancer Spread](https://www.sciencedaily.com/releases/2025/10/251004092858.htm)\n\n### Friday, October 3, 2025\n\n- [Fat May Secretly Fuel Alzheimer’s, New Research Finds](https://www.sciencedaily.com/releases/2025/10/251003033915.htm)\n\n### Thursday, October 2, 2025\n\n- [A Single Dose of Psilocybin May Rewire the Brain for Lasting Relief](https://www.sciencedaily.com/releases/2025/10/251002073959.htm)\n\n### Friday, October 3, 2025\n\n- [The Invisible Chemical in the Air That Could Be Raising Parkinson’s Risk](https://www.sciencedaily.com/releases/2025/10/251003033913.htm) - [Scientists Just Cracked the Mystery of Why Cancer Immunotherapy Fails](https://www.sciencedaily.com/releases/2025/10/251003033909.htm) - [A Flu Test You Can Chew](https://www.sciencedaily.com/releases/2025/10/251002074011.htm)\n\n### Wednesday, October 1, 2025\n\n- [DOLPHIN AI Uncovers Hundreds of Invisible Cancer Markers](https://www.sciencedaily.com/releases/2025/10/251001092206.htm)\n\n### Thursday, October 2, 2025\n\n- [Poor Sleep Speeds Brain Aging and May Raise Dementia Risk](https://www.sciencedaily.com/releases/2025/10/251002074014.htm)\n\n### Tuesday, September 30, 2025\n\n- [Black Mamba Venom Has a Deadly Hidden Second Strike](https://www.sciencedaily.com/releases/2025/09/250930034202.htm) - [Long Commutes and Small Homes Are Wrecking Sleep](https://www.sciencedaily.com/releases/2025/09/250930034158.htm)\n\n### Monday, September 29, 2025\n\n- [Why Gen X Women Can’t Stop Eating Ultra-Processed Foods](https://www.sciencedaily.com/releases/2025/09/250929054915.htm) - [Simple Blood Test Predicts Liver Disease Years Before Symptoms](https://www.sciencedaily.com/releases/2025/09/250929054911.htm) - [Stunning Images Reveal How Antibiotics Shatter Bacterial Defenses](https://www.sciencedaily.com/releases/2025/09/250929054907.htm)\n\n### Sunday, September 28, 2025\n\n- [New Inhaler Halves Childhood Asthma Attacks](https://www.sciencedaily.com/releases/2025/09/250928095611.htm) - [Fruit Might Be the Surprising Key to Healthier Lungs](https://www.sciencedaily.com/releases/2025/09/250928095620.htm) - [Doctors Tested a Common Drug on COVID. The Results Are Stunning](https://www.sciencedaily.com/releases/2025/09/250928095616.htm)\n\n### Friday, October 3, 2025\n\n- [Millions Could Be Living With Hidden Smell Loss After COVID Without Knowing](https://www.sciencedaily.com/releases/2025/10/251002074007.htm)\n\n### Friday, September 26, 2025\n\n- [Scientists Uncover How to Block Pain Without Side Effects](https://www.sciencedaily.com/releases/2025/09/250926035030.htm)\n\n### Monday, September 29, 2025\n\n- [Scientists Finally Explain the Real Reason Pregnant Women Get Morning Sickness](https://www.sciencedaily.com/releases/2025/09/250929054923.htm) - [The Hidden Iron Switch That Makes Cancer Cells Self-Destruct](https://www.sciencedaily.com/releases/2025/09/250929054920.htm)\n\n### Sunday, September 28, 2025\n\n- [Miscarriages, Down Syndrome, and Infertility All Linked to This Hidden DNA Process](https://www.sciencedaily.com/releases/2025/09/250928095627.htm)\n\n### Thursday, September 25, 2025\n\n- [This High-Sugar Fruit May Actually Lower Diabetes Risk](https://www.sciencedaily.com/releases/2025/09/250925025359.htm) - [Hidden Bacterial Molecules in the Brain Reveal New Secrets of Sleep](https://www.sciencedaily.com/releases/2025/09/250925025336.htm)\n\n### Wednesday, September 24, 2025\n\n- [Mushrooms Evolved Psychedelics Twice, Baffling Scientists](https://www.sciencedaily.com/releases/2025/09/250924012226.htm)\n\n### Wednesday, October 1, 2025\n\n- [Viral Apple Cider Vinegar Weight Loss Study Retracted for Flawed Science](https://www.sciencedaily.com/releases/2025/10/251001092216.htm)\n\n### Wednesday, September 24, 2025\n\n- [AI-Powered Smart Bandage Heals Wounds 25% Faster](https://www.sciencedaily.com/releases/2025/09/250924012232.htm) - [A Tiny Mineral May Hold the Secret to Feeding Billions Sustainably](https://www.sciencedaily.com/releases/2025/09/250924012230.htm)\n\n### Tuesday, September 23, 2025\n\n- [AI Breakthrough Finds Life-Saving Insights in Everyday Bloodwork](https://www.sciencedaily.com/releases/2025/09/250923021156.htm)\n\n### Monday, September 22, 2025\n\n- [Sneezing from Cats or Dust? Safe UV Light May Neutralize Allergens in Minutes](https://www.sciencedaily.com/releases/2025/09/250922074945.htm) - [Childhood Plastic Exposure Could Be Fueling Obesity, Infertility, and Asthma](https://www.sciencedaily.com/releases/2025/09/250922074947.htm)\n\n### Sunday, September 21, 2025\n\n- [Your Pancreas May Be Making Its Own Version of Ozempic](https://www.sciencedaily.com/releases/2025/09/250920214455.htm)\n\n### Saturday, September 20, 2025\n\n- [This Stunning X-Ray Advance Could Help Detect Cancer Earlier](https://www.sciencedaily.com/releases/2025/09/250920214314.htm)\n\n### Saturday, October 4, 2025\n\n- [Surprising Study Reveals What Really Kills Fatty Liver Disease Patients](https://www.sciencedaily.com/releases/2025/10/251003033924.htm)\n\n### Sunday, September 28, 2025\n\n- [Four Strange Secrets Scientists Just Found in Beer and Wine](https://www.sciencedaily.com/releases/2025/09/250927031219.htm)\n\n### Friday, September 19, 2025\n\n- [Wildfire Smoke Could Kill 70,000 Americans a Year by 2050](https://www.sciencedaily.com/releases/2025/09/250918225016.htm) - [Scientists Discover Microplastics Deep Inside Human Bones](https://www.sciencedaily.com/releases/2025/09/250918225014.htm)\n\n### Thursday, September 18, 2025\n\n- [Scientists Build Micromotors Smaller Than a Human Hair](https://www.sciencedaily.com/releases/2025/09/250918025025.htm)\n\n### Saturday, October 4, 2025\n\n- [Doctors Stunned by a Cheap Drug’s Power Against Colon Cancer](https://www.sciencedaily.com/releases/2025/10/251003033921.htm)\n\n### Tuesday, September 30, 2025\n\n- [A Plant Compound Might Be the Secret Weapon Against Gum Disease](https://www.sciencedaily.com/releases/2025/09/250930034211.htm)\n\n### Saturday, September 27, 2025\n\n- [Cocoa Supplements Show Surprising Anti-Aging Potential](https://www.sciencedaily.com/releases/2025/09/250927031221.htm)\n\n### Thursday, September 18, 2025\n\n- [The Hidden Group That Loses COVID Protection Fast](https://www.sciencedaily.com/releases/2025/09/250917221001.htm)\n\n### Sunday, September 28, 2025\n\n- [Hidden Alzheimer’s Warning Signs Found in Parkinson’s Patients Without Dementia](https://www.sciencedaily.com/releases/2025/09/250927031217.htm)\n\n### Wednesday, September 24, 2025\n\n- [Brain Fat, Not Just Plaques, May Be the Hidden Driver of Alzheimer’s](https://www.sciencedaily.com/releases/2025/09/250924012257.htm) - [Scientists Reveal Pill That Helps Shed 20% of Body Weight](https://www.sciencedaily.com/releases/2025/09/250924012248.htm)\n\n### Sunday, September 21, 2025\n\n- [Breakthrough Method Could Dramatically Cut Prescription Drug Prices](https://www.sciencedaily.com/releases/2025/09/250921090838.htm) - [Scientists Reveal the Everyday Habits That May Shield You from Dementia](https://www.sciencedaily.com/releases/2025/09/250920214459.htm)\n\n### Saturday, September 20, 2025\n\n- [Scientists Uncover Exercise’s Secret Hunger-Busting Molecule](https://www.sciencedaily.com/releases/2025/09/250919085244.htm)\n\n### Thursday, September 18, 2025\n\n- [Doctors Warn of a Stealth Opioid 20x More Potent Than Fentanyl](https://www.sciencedaily.com/releases/2025/09/250917221004.htm)\n\n### Tuesday, September 16, 2025\n\n- [Scientists Reverse Stroke Damage With Stem Cells](https://www.sciencedaily.com/releases/2025/09/250916221821.htm) - [Stanford Scientists Reveal Simple Shift That Could Prevent Strokes and Obesity Nationwide](https://www.sciencedaily.com/releases/2025/09/250915202850.htm) - [Ozempic, Wegovy and Mounjaro Makes Food Taste Sweeter and Saltier, and That May Quiet Cravings](https://www.sciencedaily.com/releases/2025/09/250915202848.htm) - [Semaglutide May Silence the Food Noise in Your Head](https://www.sciencedaily.com/releases/2025/09/250915202846.htm)\n\n### Monday, September 15, 2025\n\n- [Eating Mediterranean Could Be the Secret to Healthy Gums](https://www.sciencedaily.com/releases/2025/09/250915202841.htm)\n\n### Tuesday, September 16, 2025\n\n- [Stress Measured in Hair Could Predict Depression and Anxiety in Children](https://www.sciencedaily.com/releases/2025/09/250915202834.htm)\n\n### Monday, September 15, 2025\n\n- [Daily Eye Drops Could Make Reading Glasses Obsolete](https://www.sciencedaily.com/releases/2025/09/250914205832.htm) - [Half of Adults Suffer from Dry Eyes, but Most Never Get Help](https://www.sciencedaily.com/releases/2025/09/250914205829.htm)\n\n### Sunday, September 14, 2025\n\n- [Cannabis Use May Quadruple Diabetes Risk](https://www.sciencedaily.com/releases/2025/09/250914205803.htm) - [Being Too Thin Can Be Deadlier Than Being Overweight, Danish Study Reveals](https://www.sciencedaily.com/releases/2025/09/250914205759.htm) - [AI Can Now Predict Who Will Go Blind, Years Before Doctors Can](https://www.sciencedaily.com/releases/2025/09/250913232921.htm) - [Most Quit Breakthrough Weight-Loss Drug Within a Year](https://www.sciencedaily.com/releases/2025/09/250913232157.htm)\n\n### Friday, September 12, 2025\n\n- [Fatty Liver Breakthrough: A Safe, Cheap Vitamin Shows Promise](https://www.sciencedaily.com/releases/2025/09/250912195101.htm)\n\n### Monday, September 29, 2025\n\n- [Junk Food Can Scramble Memory in Just 4 Days](https://www.sciencedaily.com/releases/2025/09/250927031249.htm)\n\n### Monday, September 22, 2025\n\n- [Hidden Brain Signal Reveals Alzheimer’s Years Before Symptoms](https://www.sciencedaily.com/releases/2025/09/250922074952.htm) - [A Hormone That Silences the Immune System May Unlock New Cancer Treatments](https://www.sciencedaily.com/releases/2025/09/250921091002.htm) - [Want a Younger Brain? Harvard Researchers Say Eat Like This](https://www.sciencedaily.com/releases/2025/09/250921090902.htm)\n\n### Tuesday, September 30, 2025\n\n- [First Living Cochlea Outside the Body Shows How Hearing Really Works](https://www.sciencedaily.com/releases/2025/09/250929055003.htm)\n\n### Monday, September 22, 2025\n\n- [Why Alcohol Blocks the Liver from Healing, Even After You Quit](https://www.sciencedaily.com/releases/2025/09/250921090859.htm)\n\n### Thursday, September 18, 2025\n\n- [Could Plastic in Your Food Be Fueling Azheimer’s?](https://www.sciencedaily.com/releases/2025/09/250917221010.htm)\n\n### Sunday, September 14, 2025\n\n- [Sleepless Nights May Raise Dementia Risk by 40%, Mayo Clinic Reveals](https://www.sciencedaily.com/releases/2025/09/250913232924.htm)\n\n### Sunday, September 28, 2025\n\n- [Autism May Be the Price of Human Intelligence](https://www.sciencedaily.com/releases/2025/09/250927031224.htm)\n\n### Saturday, September 27, 2025\n\n- [What Happens to Your Body When You Eat Too Many Ultra-Processed Foods](https://www.sciencedaily.com/releases/2025/09/250927031211.htm)\n\n### Saturday, September 13, 2025\n\n- [Surprising Giant DNA Discovery May Be Linked to Gum Disease and Cancer](https://www.sciencedaily.com/releases/2025/09/250912195128.htm)\n\n### Wednesday, September 10, 2025\n\n- [Mapping the Secret Escape Routes of Deadly Brain Tumors](https://www.sciencedaily.com/releases/2025/09/250910000307.htm)\n\n### Tuesday, September 30, 2025\n\n- [Yoga Isn’t as Heart-Healthy as You Think, New Study Reveals](https://www.sciencedaily.com/releases/2025/09/250930034240.htm)\n\n### Thursday, September 25, 2025\n\n- [Cambridge Scientists Created a Gel That Could End Arthritis Pain](https://www.sciencedaily.com/releases/2025/09/250925025401.htm)\n\n### Wednesday, September 17, 2025\n\n- [Rogue DNA Rings May Be the Secret Spark Driving Deadly Brain Cancer](https://www.sciencedaily.",
      "source": "News Source",
      "date": "2025-10-09T14:29:58.210Z"
    },
    {
      "title": "Mouse resources at the RIKEN BioResource Research Center and the National BioResource Project core facility in Japan",
      "url": "https://pubmed.ncbi.nlm.nih.gov/PMC8445257?utm_source=valyu.ai&utm_medium=referral",
      "image_url": {},
      "content": "## Dissemination of information\nDissemination of information associated with mouse strains has a vital role in facilitating active use of large-scale mouse resources by the biomedical community. We have recently renewed the RIKEN BRC home page and developed a revised version of the searchable online catalog of mouse strains that functions as a part of the BRC-integrated database (Masuya et al. [16]).\nMonthly email newsletters are sent to announce newly deposited mouse strains, users’ publications, relevant news, and coming events in both Japanese and English. To complement the functions of the integrated database and email news, we have launched proactive outreach corners focusing on specific strains, such as “*Today’s Tool for Functional Analysis,” “Today’s Model for Human Disease” and* ([https://mus.brc.riken.jp/en/todays_tool_and_model]()), and *“Mouse of the Month”* ([https://mus.brc.riken.jp/en/mouse_of_month]()) to provide researchers with information about advanced strains and facilitate the use of such strains for cutting-edge research. For the Mouse of the Month, strains are selected based on the potential impact of relevant publications as well as access log data for strains from the web catalog. The articles are designed in a mini-review format that includes representative images or figures and a summary of the strain including gene details, use applications, the latest research results, and references. The strain name with its repository unique identifier (RBRC number) is linked to each strain data sheet page of the online catalog supported by the BRC-integrated database. The Today's Tool and Model series are presented in a list format to disseminate more genetic tools and disease models; the list provides the title of the strain, its strain ID with a link to its strain data sheet, brief descriptions, and references with PubMed links.\n\n## Cryopreservation and secure back-up storage\nMice with high demand are maintained as live stocks for faster distribution, while mice with lower demand are preserved as frozen sperm or embryos in liquid nitrogen tanks for cost-effective management. Two-cell stage embryos of various strains have been successfully cryopreserved by using ethylene glycol-based vitrification (Mochida et al. [20]). Sperm samples were cryopreserved by the method reported by Nakagata and Takeshima ([22]). Recent advances in assisted reproductive technologies have facilitated efficient preservation and recovery of various inbred strains and dozens of unique wild-derived strains belonging to different species and subspecies of *Mus* (Hasegawa et al. [8], [9], [10]; Mochida et al. [21]). Cryopreservation also plays a key role in protecting the deposited mouse strains by minimizing genetic drift, which may occur during continuous breeding periods (Wiles & Taft [37]). We cryopreserve embryos or sperm at the earliest stages after deposition and whenever possible with genomic DNA samples and breeding records in order to recover a live colony from earlier generations after extensive breeding periods or whenever undesired mutations are detected.\nWe have preserved approximately 95% of collected strains as frozen embryos and sperm. A rapidly increasing number of genetically modified strains developed by genome editing have efficiently been cryopreserved by sperm freezing. To protect the archived strains from disasters, the RIKEN BRC has built a back-up facility in the RIKEN Harima branch 700 km away, and every frozen strain has regularly been transferred there since 2007. Moreover, after the Great Eastern Japan Earthquake of 2011, we have installed an in-house water supply system, liquid nitrogen suppliers, and large fuel tanks for an emergency power supply to sufficiently handle a one-week outage to strengthen the security of the main collection in Tsukuba.\n",
      "source": "News Source",
      "date": "2025-10-09T14:29:58.210Z"
    },
    {
      "title": "Linking Health News to Research Literature",
      "url": "https://arxiv.org/abs/2107.06472?utm_source=valyu.ai&utm_medium=referral",
      "image_url": {},
      "content": "> Our study also poses some challenges and opportunities for future work. (1) Currently, we focused on the news articles that report on a single research work, usually the latest research findings; however, some news articles report on multiple studies, especially when introducing a new research area rather than an individual study. In the future we will extend and evaluate our approach to such one-to-many matching cases. (2) In this study we focused on health news and biomedical literature. In the future we will adapt our approach to domains beyond biomedical and health. This is now feasible since from April 2021 anyone can freely download the 120 million DOI registration data provided by CrossRef (CrossRef, 2021) and the similiar amount of abstract or summary data provided by SemanticScholar.\n[]",
      "source": "News Source",
      "date": "2025-10-09T14:29:58.210Z"
    },
    {
      "title": "Stein Institute for Research on Aging",
      "url": "https://en.wikipedia.org/wiki/Stein%20Institute%20for%20Research%20on%20Aging?utm_source=valyu.ai&utm_medium=referral",
      "image_url": {},
      "content": "Sam and Rose Stein Institute for Research on Aging (Stein Institute for Research on Aging) is a  non-profit, multidisciplinary research institute at the University of California, San Diego School of Medicine located in La Jolla, California. Established in 1983, it researches healthy aging through the development and application of the latest advances in biomedical and behavioral sciences.\n\nAlthough understanding of aging has improved enormously during the last decades, most of the prior research focused on the negative sides of aging such as age-related disability, dementia, or depression (see: ageism). The more than 150 scientists at the Stein Institute are investigating predictors and associations of successful cognitive and emotional aging. Understanding these processes requires contributions from basic sciences like neurobiology and genetics, along with the input from clinical medicine and social sciences, such as medical anthropology.\n\nHistory \nThe specific focus of the Stein Institute's research has shifted over the years since its inception in 1983. In the beginning, the primary emphasis was on Alzheimer's disease. Later, this scope was broadened to include various age-related disorders such as cancer and arthritis. Dilip V. Jeste, on assuming directorship of the Stein Institute in 2004, set the Institute's main focus on successful aging.\n\nActivities \nOver the past 25 years, the Stein Institute has brought together many scientists, encouraged and funded research published in top scientific journals (such as JAMA), supported the education of students, including medical students participating in the National Institute on Aging funded MSTAR program  and presented and broadcast about 300 public lectures on aging as part of its community outreach. The number of views and downloads of the Stein lectures from UCSD-TV and UCTV, as well as YouTube and iTunes has exceeded 1.2 million views in the last couple of years. The Institute's work has been cited in the media, including the BBC, New York Times, NPR, U.S. News & World Report, Huffington Post, USA Today, London Times, and Scientific American, among others.\n\nSuccessful Aging Evaluation (SAGE) Study \nStein Institute has developed the UCSD Successful Aging Evaluation (SAGE) Study - a unique cohort of 1,300 randomly selected people in the San Diego country, ranging in age from 50 to 99, with an oversampling of those over age 80. This longitudinal study focuses on the cognitive and emotional aspects of successful aging, including genetic information about various aspects of aging.\n\nDirectors \n 2004–present - Dilip V. Jeste\n 1990-2004 - Dennis Carson\n 1982-1990 - Jay Seegmiller\n\nReferences\n\nExternal links\n The Stein Institute for Research on Aging\n\nMedical research institutes in the United States\nSan Diego, California, University of\nGerontology organizations",
      "source": "News Source",
      "date": "2025-10-09T14:29:58.210Z"
    },
    {
      "title": "Current Health News & Updates For the Mind & Body | Fox News",
      "url": "https://www.foxnews.com/health?utm_source=valyu.ai&utm_medium=referral",
      "image_url": {
        "0": "https://static.foxnews.com/static/orion/styles/img/fox-news/og/og-fox-news.png",
        "1": "https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2025/10/920/518/woman-water-bottle-plastic.jpg?ve=1&tl=1",
        "2": "https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2025/10/454/256/mmr-vaccine-in-arm.jpg?ve=1&tl=1",
        "3": "https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2025/10/454/256/senior-woman-helping-husband.jpg?ve=1&tl=1",
        "4": "https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2025/10/348/196/kimchi-korean-food-blood-pressure-superfood-health-benefits-3.jpg?ve=1&tl=1"
      },
      "content": "TINY TOXINS\n\nTHROWING JABS\n\nTARGETED HEALING\n\n0:02:26\n\nNew research reveals that bottled water drinkers consume significantly more microplastics than tap water users, with particles linked to cancer risks and chronic health complications.Salon hair washing can trigger rare beauty parlor stroke syndrome when neck positioning compresses arteries, though proper support reduces risk significantly.New JAMA study finds inhalers for asthma and COPD generate over 2 million metric tons of carbon emissions annually, equivalent to pollution from 530,000 cars.Medical experts and vaccine maker Merck reject HHS Deputy Secretary Jim O'Neill's suggestion to split the MMR vaccine into individual measles, mumps and rubella shots.Researchers announce breakthrough results for AMT-130, the first disease-modifying treatment for Huntington's disease, with FDA approval application planned for early next year.Scientists in Germany have created a novel flu detection method using an edible sensor that produces taste when the influenza virus is present in the mouth.Air pollution exposure could make Alzheimer's disease worse by speeding up brain changes that cause memory loss and impaired judgment, a Penn Medicine study finds.High costs and shortages are driving demand for unregulated GLP-1 drugs, prompting FDA alerts about counterfeit Ozempic and calls for stricter enforcement by legal experts.Researchers analyzed data from over 222,000 Parkinson's patients and found TCE exposure from metal degreasing and industrial cleaning may increase disease risk.A new Wright State University study finds that over 40% of fatal car accident victims had elevated THC levels in their blood, with average concentrations far exceeding legal limits.Professor Elliot Long explains why sepsis in children is difficult to diagnose, with nearly 10% of cases missed in emergency rooms despite being treatable.Nutritionist Kendall Mackintosh recommends fruits packed with natural hormones and antioxidants to help regulate sleep cycles and aid rest.A NIH-funded study shows acupuncture treatments significantly reduce chronic low back pain and disability in adults 65 and older compared to usual medical care alone.Testosterone therapy can help men with low hormone levels, but experts warn of serious risks including stroke, prostate issues and heart disease complications.The Fox News Health Newsletter brings you trending and important stories about healthcare, drug developments, mental health issues, real people's triumphs over medical struggles, and more.A clinical trial of NVG-291 peptide drug demonstrates promising results for spinal cord injury patients, with participant Larry Williams regaining balance abilities.New research reveals synthetic cannabinoid users experience more severe psychotic symptoms than natural cannabis users, with gaming disorders creating additional risks.A UCLA study shows that a new treatment combining a radioactive drug with radiation therapy could help delay hormone therapy for men with recurring prostate cancer.Weight-loss experts explain why combining GLP-1 medications with bariatric surgery may be the most effective approach to treating obesity in 2025.Scientists link poor oral health to dramatically higher pancreatic cancer risk, emphasizing the importance of regular brushing and dental care for prevention.Researchers developed an experimental method to convert skin cells into eggs, potentially allowing older women and same-sex couples to have genetically related children.Amid growing outbreaks, Americans traveling abroad should use insect repellent and protective clothing to prevent chikungunya virus, experts recommend.The FDA-approved Inluriyo, an oral estrogen receptor antagonist from Eli Lilly, has shown to achieve significant improvement in progression-free survival for breast cancer.Research on María Branyas, the world's oldest woman at 117, reveals how healthy diet, beneficial gut bacteria and protective genes contributed to her record-breaking longevity.A new study from the University of Leicester finds that high fruit intake reduces air pollution's harmful effects on the lungs, particularly in women who eat four portions daily.Registered dietitians weigh in on Starbucks' new protein drinks, noting benefits for breakfast skippers while cautioning against using them as meal substitutes.Medical experts recognize type 5 diabetes as separate from other types, requiring specialized treatment focusing on nutritional rehabilitation and careful insulin management.The honey and salt pre-workout trend gains expert approval from nutritionist Robin DeCicco, who says the combination mimics supplements' effects for gym sessions.A new study finds that GLP-1 medications are linked to lower overall cancer risk, particularly for endometrial and ovarian cancers, in obese adults. Oncologist Dr. Slomovitz discusses the findings.A simple wellness trend of jumping 50 times each morning gains popularity on TikTok as an accessible alternative to traditional morning workouts.Experts question the popular social media trend of using magnesium products on the feet for better sleep due to a lack of research backing the claims.Personal trainers explain how older adults can exercise safely by avoiding common mistakes like ego lifting, skipping strength training and having inadequate recovery time.A new study finds that vitamin B3 (nicotinamide) at 500 mg twice daily reduces basal cell carcinoma and squamous cell carcinoma risk in veterans over a 25-year period.The Fox News Health Newsletter brings you trending and important stories about healthcare, drug developments, mental health issues, real people's triumphs over medical struggles, and more.Flu vaccination timing varies by group, with pregnant women and those over 65 advised to wait until September, while some children may need two doses.Jeffrey Mittman transforms his experience as a blind Army veteran into advocacy for disabled employment through his leadership role on the U.S. AbilityOne Commission.A study of 766 patients suggested that specially formulated eye drops improved near vision for over 80% of presbyopia sufferers after one year of daily use.The XFG variant, also known as Stratus, is now the predominant COVID-19 strain in the U.S. after spreading to 38 countries, according to WHO and CDC data.New York City doctors reveals how weight-loss drugs reduce inflammatory cytokines by decreasing fat cells, potentially preventing cancer and autoimmune diseases.A dangerous drug-resistant bacteria called NDM-CRE is spreading rapidly across the U.S., resisting most antibiotics and proving difficult for doctors to treat.The family of Sophia Forchas shares an update on the 12-year-old's recovery after she was critically injured in a mass shooting at Annunciation Catholic Church in Minneapolis.Autism diagnoses rose from 1 in 150 children in 2000 to 1 in 31 in 2022, sparking debate about whether this reflects better detection or a true increase in the disorder.A new oral weight loss medication, orforglipron, demonstrated meaningful weight loss results in phase 3 trials, potentially providing an easier alternative to Ozempic injections.Mayo Clinic study reveals nontraditional factors cause over half of heart attacks in women under 65, compared to atherosclerosis being responsible for 75% of men's cases.Experts share symptoms of autism in adults, including social communication challenges, repetitive behaviors, difficulty making eye contact and intense specific interests.The cancer medication leucovorin shows potential benefits for autism spectrum disorder, improving communication skills in some children, say administration health officials.New research from Edith Cowan University shows that a single bout of weight training or HIIT can boost anti-cancer myokines and reduce breast cancer cell growth in survivors.Four American families aim to raise $1.15 million by October to fund a phase 3 gene therapy trial for their children with SPG50, a rare genetic disease.Kristen Bell eats leafy gerens before carbs to prevent glucose spikes, a biohacking approach that experts say can improve mood and reduce diabetes risk.Metabolic dysfunction-associated steatohepatitis (MASH) is a silent liver disease that is caused by fat buildup, inflammation and cell damage in the liver. Here's what to know.New research challenges BMI assumptions, showing overweight individuals may not face higher death rates while underweight people show increased mortality risk.Singer Selena Gomez's lupus-related arthritis diagnosis sheds light on how up to 90% of lupus patients experience joint pain, according to medical experts and recent research.Strength training for seniors should emphasize posterior muscles like the glutes and upper back rather than mirror muscles to prevent pain and maintain independence.Two healthcare workers were fired by Acadian Ambulance Service and Children's Healthcare of Atlanta for controversial social media comments about Charlie Kirk's assassination.The Fox News Health Newsletter brings you trending and important stories about healthcare, drug developments, mental health issues, real people's triumphs over medical struggles, and more.Trump administration announces organ procurement reforms with $25 million investment for living donors and new oversight measures for patient safety.The \"7 As\" of super-aging offer practical strategies for living longer and healthier lives, covering attitude, activity, awareness and four other key principles.Medical experts say vaccination is the best prevention method for hepatitis B, a liver infection that can be acute or chronic. The disease has no cure and can cause a variety of complications.Researchers found that 160 milligrams of daily aspirin significantly lowered cancer recurrence risk for colorectal patients with PIK3 pathway alterations.Mayo Clinic researchers report that chronic insomnia in older adults leads to a 40% higher dementia risk and accelerated brain aging over 5-1/2 years.New research reveals that GLP-1 drugs may significantly lower mortality rates in Americans by 2045, as obesity contributes to 70% of leading death causes in high-income countries.Heart health requires balance across lifestyle factors, as poor sleep, lack of exercise or bad diet can drive inflammation and cardiovascular disease, expert says.Cannabis users showed a 2.2% diabetes rate compared to 0.6% for non-users over five years, with researchers linking marijuana to appetite and metabolism changes.A Detroit nurse at Henry Ford Health was placed on leave following a social media comment supporting violence against Charlie Kirk after his assassination.Psychotherapist Jonathan Alpert explains how witnessing traumatic events, like recent deaths, can cause shock, fear and sleep difficulties, and shares coping mechanisms.West Nile virus outbreak has intensified across the U.S., with the 770 reported human cases far exceeding normal seasonal patterns for severe infections.Health experts warn pregnant women that marijuana poses safety risks even where legal, with no known safe amount of cannabis during pregnancy.Celebrity trainer Kollins Ezekh explains Zone Zero workout trend to Fox News Digital, describing light movement that supports recovery without strain or intensity.The cortisol cocktail, a trending social media drink made with coconut water and orange juice, claims to reduce stress hormones and boost energy levels.Global childhood obesity rates tripled from 2000-2022 according to UNICEF, with ultra-processed foods and junk food marketing fueling the epidemic in 190 countries.Riverside Walter Reed Hospital terminated an anesthesiologist's contract after she posted inappropriate comments supporting violence against Charlie Kirk.Health experts recommend strength training as the main priority for older adults to prevent muscle decline and maintain functional fitness for daily activities.Scientists developed a non-invasive MRI technique to measure brain iron levels, which may help identify patients at higher risk of developing Alzheimer's disease early.The Fox News Health Newsletter brings you trending and important stories about healthcare, drug developments, mental health issues, real people's triumphs over medical struggles, and more.Psychiatrist Dr. Daniel Amen explains how beta blockers work for anxiety by blocking adrenaline effects, as the medication is growing rapidly in popularity.Fox News correspondent Eric Shawn reveals he was diagnosed with cancer this year from 9/11 toxic dust exposure while reporting on the 24th anniversary ceremony.Certain prescription medications, including beta-blockers and gabapentinoids, could increase fall risk in older adults, as some experts claim that reducing unnecessary drugs could prevent injuries.Researchers are warning of a diabetes crisis, as nearly half of 1.3 billion affected adults go undiagnosed, with young people and low-income regions most at risk.GLP-1 medications like Ozempic show promise for multiple health conditions, as experts explore microdosing benefits for blood sugar control and longevity.Cardiothoracic surgeon Dr. Jeremy London discusses the 80/20 diet approach for heart health, emphasizing whole foods 80% of the time while limiting alcohol and processed foods.A new study reveals that sucralose may reduce cancer treatment effectiveness, but supplementation could counteract the artificial sweetener's negative effects.A new study shows that LSD reduced anxiety symptoms in adults with generalized anxiety disorder, with 100-microgram doses proving most effective in a clinical trial.Scientists have created a pre-clinical weight loss drug combining GLP-1, GIP, glucagon and peptide YY hormones to match bariatric surgery effectiveness.Researchers discovered Human Pegivirus in brain tissue from five of ten Parkinson's patients, suggesting the virus may play a role in the neurodegenerative disease.Researchers suggest intense marathon training may cause gut stress leading to colon adenomas, with 41% of studied runners having at least one polyp.Research identifies five food additive categories including flavors, sweeteners and coloring agents that may significantly increase all-cause mortality risk.Orthopedist Dr. Ran Schwarzkopf of NYU explains how knee pain affects more young people in their 30s and 40s due to obesity and high-intensity sports.Helen Mirren's simple XBX workout routine from the Royal Canadian Air Force demonstrates how a vintage 12-minute plan remains effective decades later.A new study from Beth Israel Deaconess Medical Center in Boston finds that using smartphones in the bathroom increases hemorrhoid risk by nearly 50%.A new study reveals that eating dinner within two hours of bedtime and frequently missing breakfast correlates with increased osteoporotic fracture risk in adults.Health officials investigate three tuberculosis cases in Maine's Greater Portland area, working to test contacts of infected patients for the bacterial disease.A study of 12,772 adults reveals artificial sweeteners like aspartame and saccharin are linked to accelerated cognitive decline and memory problems.Cannabis users with childhood trauma experience worse paranoia effects, according to new studies, as researchers warn against self-medicating with marijuana.The Fox News Health Newsletter brings you trending and important stories about health care, drug developments, mental health issues, real people's triumphs over medical struggles, and more.Rabies outbreaks among wild animals are rising across the U.S., with different species presenting regional risks, from the eastern states to Alaska and the Southwest.Researchers found that AI-enabled stethoscopes can help doctors identify heart failure, atrial fibrillation and valve disease early, potentially improving patient treatment outcomes.A phase 2 study shows that azelastine nasal spray lowered coronavirus infection rates to 2.2% compared to 6.7%, researchers at Germany's Saarland University revealed.\"Kissing bugs\" transmit Chagas disease through infected feces, causing symptoms like fever and potentially fatal heart problems in 20%-30% of chronic cases.Surgeon General Joseph Ladapo and Gov. Ron DeSantis announced that Florida will move to eliminate vaccine mandates in schools, citing informed consent and individual choice over mandates.Erin Andrews credits her routine gynecologist's visits with saving her life from cervical cancer and now advocates for early detection through a national campaign.",
      "source": "News Source",
      "date": "2025-10-09T14:29:58.210Z"
    },
    {
      "title": "Biomedical Science and New Frontiers Rhodes Biomedical Science",
      "url": "https://pubmed.ncbi.nlm.nih.gov/PMC9302547?utm_source=valyu.ai&utm_medium=referral",
      "image_url": {},
      "content": "The British Journal of Biomedical Science (BJBS) has come a long way since it was first published as the Laboratory Journal now over 100 years ago, back in 1913. Its latest impact factor exceeds that of some of the most well-known pathology journals; emphasising the quality of the science now being published.\n\nIt is and always has been the official journal of the Institute of Biomedical Science (IBMS). Consequently, its articles reflect the scientific interests and specialties of IBMS members. Traditionally, the membership has been predominantly biomedical scientists employed in the health services of the UK and other countries, frequently in discipline specific areas such as Cell Sciences, Blood Sciences, Infectious Sciences, Genetics and Molecular Pathology. However, the IBMS membership profile is changing to include increasing numbers of members from the pharmaceutical and biotechnology industries, and universities, both in the UK and from overseas. The skill sets of biomedical scientists working in the health services are also rapidly changing, with an increasing number of advanced practice and consultancy roles necessary to meet the growing demands of a modernised pathology service, and with many advanced practitioners and consultant biomedical scientists now having doctoral qualifications.\n\nThe term biomedical science is used globally to describe the range of life sciences underpinning medicine. As such, biomedical research covers the whole “bench-to-bedside” journey, ranging from initial mechanistic and functional studies on cell lines, or even tiny organisms such as *Drosophila* spp. and *Caenorhabditis elegans*, through to translation of the findings to human clinical trials and predicting response to targeted therapies. Biomedical scientists in hospital laboratories are familiar with testing for established biomarkers as part of their day-to-day work. However, these established diagnostics started their embryonic life many years earlier as hypothesis driven research, subsequently tested on cell lines or animal models prior to their testing in clinical trials and eventually impacting on patient management. Set against these backdrops, the aim for the BJBS is to retain its deeply embedded foundations in the full range of disciplines that comprise biomedical science and therefore represent the interests of the many hospital-based members of the IBMS. However, in order to attract articles from the broader biomedical science communities, the journal will continue to grow by including a greater number of papers involving fundamental biomedical research that investigates the function and mechanisms of the disease process, the findings of which in years to come may be translated into new diagnostic tests that influence patient management. In short, we wish to encourage research submissions that reflect the whole of the bench-to-bedside journey.\n\nA new feature of the journal which the Frontiers open access model supports is the introduction of Special Issues. These are a series of articles grouped on a central theme with a Guest Editor, soliciting and editing the compilation. Currently, we have a Special Issue on *Dermatopathology and Associated Laboratory Investigations in the Study of Skin Disease* edited by Dr Guy Orchard. We also have a Special Issue focusing on Women in Science which ties in with the IBMS’ celebration of 100 years of female members. We hope it will serve the community by shedding light on female researchers and provide them with a platform to showcase their work and their role in open science. With this in mind, for this Special Issue, we invite submissions from female biomedical scientists on a range of research topics related to the investigation and treatment of disease, to include but not limited to; cancer, the microbiome, cardiovascular disease and infectious disease. To complement the scientific content within the published articles we also invite authors to provide some personal reflections on life in academia that will be included within the published paper. If you wish to submit an article to either of these Special Issues or indeed to act as a Guest Editor for a new theme for which you have a passion, please do contact us at the journal, we would love to hear from you (bjbs@frontierspartnerships.org).\n\nThe BJBS has recently changed publishers from Taylor and Francis to Frontiers, which is fully open access and online. This allows the reader free access to articles published without having to subscribe to the journal, or to pay to view it. The advantage to authors is that their work can be read immediately by anybody in the world with internet access, from the moment that it is published. The value of this to the global research community was exemplified during the pandemic when most journals, even those normally requiring payment to view, made all COVID-19 related articles free to read with the aim of disseminating the results of important COVID-19 research as quickly as possible. However, as the saying goes; “there is no such thing as a free meal” and in pre- and post-COVID times, it would ordinarily fall on the authors to pay an article processing charge (APC) to publish in open access journals, and this charge can be substantial. Thankfully for IBMS members wishing to publish in the BJBS the APC is waived and members can publish their research for free.\n\nWorking closely with the Editor-in-Chief and the publishing team at the journal are four Deputy Editors who are responsible for handling the submitted articles and sourcing experts in the field to review the articles; Dr Andrew Blann, Dr Guy Orchard, Dr Mark Hajjawi and Dr Yuh Fen Pung. In addition, the editorial board members are appointed based on their expertise in different areas of biomedical science and their experience in reviewing papers. As the journal continues to grow, we will expand the editorial board to provide an increased range of expertise.\n",
      "source": "News Source",
      "date": "2025-10-09T14:29:58.210Z"
    },
    {
      "title": "<i> Regenerative Medicine Research </i> : an open access translational medicine journal",
      "url": "https://pubmed.ncbi.nlm.nih.gov/PMC4376332?utm_source=valyu.ai&utm_medium=referral",
      "image_url": {},
      "content": "I am, as an Editor-in-Chief joining BioMed Central, so excited to announce the launch of a new biomedical journal, *Regenerative Medicine Research*. In this open access, online journal, we aim to publish research relating to both the fundamental and practical aspects of regenerative medicine, with a particular emphasis on translational research.\n\nRegenerative medicine is an emerging field with the potential to empower medical research and practice. The process of tissue regeneration is essential to many organisms for a healthy life, from the highly studied axolotl, to us as human beings. In many ways regenerative medicine has become the leading edge of biomedical research and clinical practice, due to its key implications for the treatment of increasingly prevalent diseases, such as heart disease.\n\nThe field is in the infant stage of its development but it is growing at an impressively fast pace. For instance, based on a PubMed search, there were less than 200 articles relating to regenerative medicine published in 2002, but more than 3,000 articles published in 2012. However, comprehensive information or research data on regenerative medicine cannot presently be efficiently gathered, but can only be scrutinized through a diversity of different journals in various fields. Regenerative medicine is, by current definition, the process of creating living, functional tissues to repair or replace tissue or organ function lost due to age, disease, damage, or congenital defects [1]. Obviously, this requires a multidisciplinary approach, and one that looks beyond tissue engineering and stem cells. This need calls for a comprehensive journal and therefore, the launch of *Regenerative Medicine Research* takes place.\n\nWe hope to publish articles that shed light on the signalling pathways involved in cell/tissue regeneration, as well as those that address how biomaterials and stem cells can be adapted or integrated into the failing organ system. Two of the first articles published in the journal today focus on the effects of chronic alcohol consumption on tissue repair and regeneration; Dekeyser *et al.*[2] study the effect on skeletal muscle and Borrisser-Pairó *et al.*[3] look at levels of IGF-1 myocardial expression. In addition, Coletti *et al*. [4] provide a comprehensive review comparing the cellular mechanisms of skin, nerve and muscle regeneration.\n\nAs an open access journal, articles accepted for publication in *Regenerative Medicine Research* are made rapidly available online following acceptance**.** This ensures efficient dissemination of information and experimental data to scientific communities and the medical practice field. Furthermore, a highly respected Editorial Board composed of internationally well-recognized experts in the field facilitates a fair, timely and rigorous peer review process.\n\nThe Editorial Board, Publisher, and myself assure the authors and readers that we are committed to making *Regenerative Medicine Research* a preeminent platform for exchanging research protocols and experimental data in this exciting, emerging field. We look forward to receiving your high quality contributions to the journal.\n",
      "source": "News Source",
      "date": "2025-10-09T14:29:58.210Z"
    },
    {
      "title": "BME 2.0: Engineering the Future of Medicine",
      "url": "https://pubmed.ncbi.nlm.nih.gov/PMC10530648?utm_source=valyu.ai&utm_medium=referral",
      "image_url": {
        "bmef.0001.fig.001.jpg": "https://prod-s3-vyplatform-processeddata.s3.amazonaws.com/valyu-v5/valyu-pubmed/c6084312-32bd-52c1-a365-1089537c7472/bmef.0001.fig.001.jpg?response-content-type=image%2Fjpeg&response-content-disposition=inline%3B%20filename%3D%22bmef.0001.fig.001.jpg%22&X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAZEI6M4QPS476EZP6%2F20251009%2Feu-west-2%2Fs3%2Faws4_request&X-Amz-Date=20251009T142842Z&X-Amz-Expires=3600&X-Amz-SignedHeaders=host&X-Amz-Security-Token=IQoJb3JpZ2luX2VjED4aCXVzLWVhc3QtMSJGMEQCIGmr%2B5%2F1VYExPtfcW8ZNJCW9K6ddpkpaBwmJBy9GkKV5AiBmKqishAckhf0G1k%2FbuYbR26rmWFA6ruRDEazGvCaPoiqSBAjX%2F%2F%2F%2F%2F%2F%2F%2F%2F%2F8BEAAaDDYyNzY2NTg1NTUxOSIMi8l4ic6YLrrIdv6oKuYD6q3fUx619DMPj3gt%2BtxELkoAbDZFSWw%2F%2FPD%2BbJRj4hiCx%2BTOMblIGCEwCKQ1CnlhqT96SLRGx7YAhOTpS41BjVj7%2FMtQ6LbwEZLqCz2%2B1NwEplKcXpjlY%2BXrrhh06%2Fp%2B71BeQRyBjKgAZmTWYnxvQ3WvmdFlqzHTIUC%2FpxKRjmCSxwmVELurUUHGVk0t0DVyZvkckD2tpKn6V%2BivkoXVAnLSNbRgx8Gru1W6PoS2vaY%2FKXYa8VaG4O4AstQa6WF7Wv8drH1gY0izPF3ZogeR03jPh84eCNtId5AxXf5eXGkHheh%2B4PcrucOgGT%2BnZqrcNzSB0zqxMlrCr3jiY1DCOLunUb4PKGPKCrLfybUEUospnyEESJknA3dfH8Y01mR7HhgN9nFhAlZNiZBAGQ%2BOHmNv1I3nZe8zKd%2Fpb4DnNB%2F0LtCizIgmPWpn0gzON5cI8ukaiX%2BJPqiFIE94H9SBK2rMAwVKir36nS3k9OEwFlkOzZTao7u5JW7YcaSiREYzyiioc4RwCtjTTctI3m7pH4LwNPTmPSPb02c9zr2dKT8Ee8DPy5Gcu94pYf%2FIpRfyVNWOmcx%2BMuq6WATClqC4Fs9ZGV9DoyUW59vDvTtsEBc8z8D9ARB9YYe%2BtBPutxXDxpVKtIb%2FMLmAn8cGOqYB6vR46vPqb40ZOT8Jutw3jyJyVVhAtU11Et%2FzspoLX0KpS1bbZJ%2B2rpGyw4G1DlgEwbkkDNpN%2BoZVTbeFNWEJ11r9Hb7Z1RF2QdE8nTdOJtWHfFV%2B5PaSbeJL7RPt8jRuWR6sRyxFmHsO4dDP3NtYiw7UAzEenpKGD9Rqon0VRa4s9RCuK56HZihXNOKTJhTbySvSqrAxCVzm6ngjaV0ec2IL6oyWqQ%3D%3D&X-Amz-Signature=eff2e4adecb0e223ae1ec260c4763351d8ff7f94a5b8711d359e4d5a9b7ab36b"
      },
      "content": "## BME 2.0: A Roadmap of Disciplines for Next-Generation BME Education\nWe propose the next generation of integration of engineering disciplines in BME, what we term “BME 2.0,” which builds on the process that was initiated during the early post-Whitaker years. BME 2.0 was first announced at the BMES 50th celebration ([https://www.bme.jhu.edu/news-events/news/miller-opens-2017-bmes-annual-meeting-with-vision-for-new-bme-era/]()). BME 2.0 will be enabled by tight coupling with the biomedical enterprise within schools of medicine as well as the biotechnology, pharamaceutical and medical technology industries. We envision a curriculum with focus areas that builds on the major discoveries and emerging opportunities in biomedical research. To deal with the dynamism of the biomedical science discovery process, a principle for evolution of the BME 2.0 curriculum is that the most important research discoveries are rapidly conserved through their integration into the BME 2.0 curriculum.\nA substantial departure from the BME 1.0 transition is motivated by the remarkable progress that we have seen in the biomedical sciences at the molecular and cellular scales. The frontiers of BME including molecular, genetic, and microphysiological systems are being tightly integrated into the BME programs, bringing together the natural sciences core, biology-chemistry-physics, in new fundamental ways. The BME 2.0 curriculum would begin for the entering class with an in-depth introduction to modern life sciences and the scientific foundations of modern molecular and cell biology, followed by a second year of rigorous quantitative bioengineering foundations. In junior and senior years, students would explore their areas of interest in their practice of the discipline differentiating into focus areas.\nThe accompanying Fig. [F1] shows the table of specialty areas of BME published by *Nature Biomedical Engineering*, which instantiate in part the focus areas that have emerged in many of the schools nationwide, including biomedical imaging and medical devices, biomechanics and mechanobiology, computational medicine, genetic engineering and systems biology, digital health and biomedical data science, neuroengineering, and immuno, regenerative, and tissue engineering.\n\nBiomedical engineers will be trained in biomedical data science, which intersects all of the focus areas. The BME 2.0 curriculum ideally would provide students with the flexibility in their junior and senior years to fully personalize their education according to interests and major focus areas. While having flexible junior and senior years that enable student exploration in focus areas, design projects, and independent research projects is a critical component of some BME programs today, it is still not the standard in programs today.\nBME 2.0 also envisions a new type of engagement in which the educational programs of our BME students recognize insights garnered from clinical and industrial partnerships that articulate the need for new therapeutics, diagnostics, and biomedical enabling technologies. Examples that are already emerging from this include design programs that integrate clinical faculty including BS/MD programs, PhD/MD and MD/MS programs, as well several engineering-based medicine programs including the Carle Illinois College of Medicine as one of the first medical schools with an engineering-based curriculum, with EnMed at Texas A&M College of Medicine and Duke and Minnesota all having MD-MSE dual degree programs. Vanderbilt has a Medical Innovators Development Program focused on training physicians in innovation/design for which the MDs must have existing engineering degrees to participate. Industrial involvement in BME curriculum is progressing from a distant, advisory relationship to synergistic resources in which universities in regions with high concentrations of medical technology industries are engaged in partnering models that provide opportunities for student project translation as a real-world educational experience, a well known example the Coulter Foundation.\nWe believe that this next generation of differentiated curriculum responds directly to the question, “Why should we hire biomedical engineers rather than chemical, electrical, or mechanical engineers?”. The BME answer is: Biomedical engineers are already being trained in the converging technologies of the biomedical marketplace. They are bilingually fluent in biology and mathematically based model thinking, working well in teams within highly regulated translational environment.\n<FG id='F1'>\n**Figure 1**: Fig. 1.\n<F href='bmef.0001.fig.001.jpg'>\nTopics in nature biomedical engineering [42] largely represent the BME focus areas, which are emerging nationwide including biomedical imaging and medical devices, biomechanics and mechanobiology, computational medicine, genetic engineering and systems biology, digital health and biomedical data science, neuroengineering, and immuno, regenerative, and tissue engineering.\n</F>\n</FG>",
      "source": "News Source",
      "date": "2025-10-09T14:29:58.210Z"
    },
    {
      "title": "Latest AI News: Daily Updated Artificial Intelligence Insights (October 8, 2025)",
      "url": "https://opentools.ai/news?utm_source=valyu.ai&utm_medium=referral",
      "image_url": {
        "0": "https://opentools.ai/_next/image?url=https%3A%2F%2Fimagedelivery.net%2FFCiXvK7dG4mSm_W_033WNA%2F06774281-a0df-4325-3cc9-d9cbd31a4d00%2Fpublic&w=3840&q=75",
        "1": "https://opentools.ai/_next/image?url=https%3A%2F%2Fimagedelivery.net%2FFCiXvK7dG4mSm_W_033WNA%2Fc2076317-89fb-4aef-8879-50aecdd71d00%2Fcontentbanner&w=3840&q=75",
        "2": "https://opentools.ai/_next/image?url=https%3A%2F%2Fimagedelivery.net%2FFCiXvK7dG4mSm_W_033WNA%2Faefbbb21-2fa3-4a88-91c7-63b25a73d100%2Fpublic&w=3840&q=75",
        "3": "https://opentools.ai/_next/image?url=https%3A%2F%2Fimagedelivery.net%2FFCiXvK7dG4mSm_W_033WNA%2Fdd8b613d-7cc1-4121-e705-f270d44e6400%2Fcontentthumbnail&w=3840&q=75",
        "4": "https://opentools.ai/_next/image?url=https%3A%2F%2Fimagedelivery.net%2FFCiXvK7dG4mSm_W_033WNA%2F12ae361d-985c-4990-4076-e9f9ec5e1600%2Ftest&w=3840&q=75"
      },
      "content": "# Latest AI News: October 8, 2025\n\nStay informed with our daily curated artificial intelligence news and insights. We bring you the most important updates in AI, machine learning, and emerging technologies.\n\nEdited By\n\nMackenzie Ferguson\n\nAI Tools Researcher & Implementation Consultant\n\n# Explore News by Tags\n\n- NITES\n\n- campus recruits\n\n- employee rights\n\n- internal assessments\n\n- intimidation tactics\n\n- labor law\n\n- layoffs\n\n- reputation management\n\n- tech industry\n\n- #PutTheMaskBackOn\n\n## Tesla Revs Up Savings with Affordable 2026 Model 3 and Model Y Standard Trims!\n\nOctober 9, 2025\n\nTesla is shaking up the EV market with the return of its Standard trims for the 2026 Model 3 and Mod...\n\n## Tesla's Electrifying Twist: Model Y and Model 3 Now Power Up with Cobalt Manganese Batteries!\n\nTesla is shaking up its battery game by introducing cobalt manganese (CM) cathode chemistry in the M...\n\n## Oracle's AI Rollercoaster and Tesla's Model Y Price Drop Shake Up Tech Markets!\n\nOracle's deep dive into AI is causing waves in the stock market, showing gains but also sparking fea...\n\n## Tesla's $40K Model Y: A Jackfruit in the Apple Cart of EVs?\n\nTesla launches a new Model Y Standard with cost-cutting measures, including a controversial textile-...\n\n## Tesla's New FSD v14.1: A Leap Towards Fully Autonomous Robotaxis\n\nTesla has unleashed its Full Self-Driving (FSD) version 14.1, adding robotaxi-like flair with smart ...\n\n## MG IM5 Revves Up to Challenge Tesla Model 3 with Stunning Low Price!\n\nThe automotive world is buzzing as the MG IM5 enters the scene, offering a compelling alternative to...\n\n## Tesla's Model Y and Model 3 Price Shake-Up: A Game Changer or Just Hype?\n\nTesla's latest pricing strategies for the Model 3 and Model Y are turning heads. With new 0% interes...\n\n## Elon Musk's Trillion-Dollar Tesla Play: The Stakes, The Goals, and The Pushback!\n\nElon Musk's monumental Tesla compensation plan, potentially valued at up to $1 trillion, aligns with...\n\n## Tesla's FSD Under the Microscope: New U.S. Safety Probe Launched\n\nThe U.S. National Highway Traffic Safety Administration has launched a safety probe into nearly 2.88...\n\n## UK Faces Double Hit: Water Bills Soar 26% and Winter Blackout Fears Loom\n\nAs the UK braces for a double whammy of budding economic challenges, residents must prepare for a he...\n\n### Learn to use AI like a Pro",
      "source": "News Source",
      "date": "2025-10-09T14:29:58.210Z"
    },
    {
      "title": "AI News - Latest Artificial Intelligence Product Updates and Launches",
      "url": "https://analyticsindiamag.com/ai-news-updates/?utm_source=valyu.ai&utm_medium=referral",
      "image_url": {
        "0": "https://analyticsindiamag.com/wp-content/uploads/2025/02/GCCs-Steals-Indian-ITs-Limelight.jpg.webp",
        "1": "https://analyticsindiamag.com/wp-content/uploads/2025/04/gemini.jpg",
        "2": "https://analyticsindiamag.com/wp-content/uploads/2025/10/Leadership-team-2024-missing-VP-of-Sales-Ben-Kiziltug-scaled-e1760010204893.jpeg",
        "3": "https://analyticsindiamag.com/wp-content/uploads/2025/10/image-18.png",
        "4": "https://analyticsindiamag.com/wp-content/uploads/2020/05/cisco-puts-end-to-employee-ratings.jpg"
      },
      "content": "AI News\n\nReal-time news coverage on artificial intelligence and tech companies updates and breakthroughs to keep you ahead in the world of AI.\n\n## Latest in AI News\n\n### GlobalLogic Expands to Chennai to Deepen Telecom and Media Partnerships\n\n09/10/2025 6:37 pm\n\nThe new Chennai office will function as a Center of Excellence (CoE) with plans to strengthen partnerships with GCCs\n\n### With $30 a Month, Build AI Agents at Work with Gemini Enterprise\n\n09/10/2025 6:33 pm\n\nThe company said that it provides an environment where employees can build and deploy AI agents to automate processes.\n\n### Amidst Competition from OpenAI, n8n Raises $180 Mn\n\n09/10/2025 5:13 pm\n\nThe startup also revealed that this year has led to a sixfold increase in user growth and a tenfold increase in revenue growth.\n\n### IG Drones Signs MoU with UP Government for Defence Corridor Facility\n\n09/10/2025 4:37 pm\n\n“Our new facility will serve as a hub of innovation, manufacturing, and employment.”\n\n### Cisco Launches 8223 Routing System to Connect AI Data Centres\n\n09/10/2025 4:16 pm\n\nThe 8223 addresses the growing demand for inter-data centre connections as AI workloads increase, stretching power and space limits in hyperscale data centres.\n\n### VC Firm Andreessen Horowitz (a16z) to Open Bengaluru Office\n\n09/10/2025 4:03 pm\n\nSan Francisco-based general partner Anish Acharya will oversee the hiring of the local investment team.\n\n### Razorpay, NPCI, and OpenAI Launch Agentic Payments to Bring AI-Driven Commerce to India\n\n09/10/2025 12:52 pm\n\nThe service allows users to discover, compare, and purchase products seamlessly within conversational AI.\n\n### Tiny Model from Samsung AI Lab Beats Gemini 2.5 Pro, o3-mini on ARC-AGI\n\n09/10/2025 11:42 am\n\nTrained with just 4 H100 GPUs.\n\n### AWS Selects 3 Indian Startups for its GenAI Accelerator Programme\n\n09/10/2025 11:32 am\n\nThis eight-week programme for early-stage generative AI companies offers up to $1 million in AWS credits.\n\n### Paytm Launches AI-Powered Soundbox for Merchants in 11 Indian Languages\n\n09/10/2025 10:11 am\n\nMerchants can ask the device for summaries of their collections, trends, and performance, turning it into what Paytm describes as an “AI business assistant.”\n\n### Gnani.ai Debuts Realistic AI Avatars in Indic Languages with HumanOS\n\n09/10/2025 10:00 am\n\nThe company said it is targeting use cases like video KYC, onboarding, document guidance, customer service, and executive communication across web, mobile, and kiosk platforms.\n\n### Google Expands No-Code AI Mini-App Builder Opal to India and 14 Other Countries\n\n08/10/2025 5:14 pm\n\nAlongside the expansion, Google is rolling out new features aimed at improving workflow transparency and performance.\n\n### Elon Musk’s xAI to Raise $20 Billion from NVIDIA and Others: Report\n\n08/10/2025 3:05 pm\n\nNVIDIA is reportedly investing up to $2 billion in the equity part of the transaction.\n\n### Simplismart, Yotta Team Up to Deliver Fast and Local AI Infrastructure for India\n\n08/10/2025 3:05 pm\n\nSimplismart’s inference-first platform underpins Shakti Studio’s serverless inference layer, ensuring low latency for LLMs.\n\n### ZillOut Secures ₹2.75 Crore Seed Funding to Enhance India’s Nightlife\n\n08/10/2025 2:12 pm\n\nZillOut plans to use the new funds to scale its AI capabilities and expand into international markets.\n\n### Agentic AI Supply Exceeds Demands, Says Gartner\n\n08/10/2025 12:00 pm\n\nGartner warns of an oversupply of agentic AI as market consolidation begins.\n\n### Google DeepMind Releases Gemini 2.5 Computer Use Model\n\n08/10/2025 11:01 am\n\nThe model lets AI agents interact directly with graphical interfaces, such as filling forms, scrolling and operating behind logins.\n\n### 20-Year-Old Indian AI Founder Secures $3 Mn Backing from Google, Cloudflare Executives\n\n08/10/2025 10:17 am\n\nSupermemory is designed to help AI systems retain and recall context across data sources and sessions.\n\n### Anthropic Announces Bengaluru Office, CEO Dario Amodei to Visit India\n\n08/10/2025 7:48 am\n\nThe Bengaluru office will be the company’s second in the Asia Pacific region after Tokyo, which is expected to open soon.\n\n### Nobel Physics Prize 2025 Goes to 3 Scientists for Discoveries in Quantum Mechanics\n\n07/10/2025 7:50 pm\n\nJohn Clarke, Michel Devoret and John Martinis were recognised for their work in macroscopic quantum physics.\n\n### QWR and Kaynes Partner to Build India’s First XR Device Manufacturing Hub\n\n07/10/2025 5:25 pm\n\nThis aims to reduce reliance on imports by up to 50% and create over 1,000 skilled jobs by 2027.\n\n### Cadence Partners with TSMC for Advanced AI, Chip Design\n\n07/10/2025 4:55 pm\n\nCadence’s AI design flows now support TSMC’s N2 and A16 technologies, while new silicon-proven IP is available for TSMC N3P.\n\n### Eli Lilly to Invest ₹9,000 Crore in Hyderabad, Boost Telangana’s Pharma Leadership\n\n07/10/2025 1:22 pm\n\nThe investment is expected to create thousands of high-value jobs and attract further global partnerships in the sector.\n\n### CoreWeave to Acquire Monolith, Offer Full Stack Research & Design\n\n07/10/2025 12:59 pm\n\nWith this acquisition, CoreWeave will expand into automotive, aerospace, manufacturing and other industries.\n\n### ‘Almost All New Code Written at OpenAI Today is From Codex Users’\n\n07/10/2025 12:37 pm\n\nSam Altman stated that nearly every pull request at OpenAI undergoes a Codex review.\n\n### ChatGPT Enters the Super App Era With Apps SDK\n\n07/10/2025 11:12 am\n\nThe company also announced a new no-code, drag-and-drop AI agent builder.\n\n### Leaked Preview Shows OpenAI’s Agent Builder, a Potential n8n Rival\n\n06/10/2025 10:16 pm\n\nThe tool is expected to be launched at OpenAI’s DevDay event on October 6.\n\n### OpenAI and AMD to Deploy 6 GW of GPUs\n\n06/10/2025 6:53 pm\n\nThe first 1 GW of deployment of AMD Instinct MI450 GPUs is set to begin in the second half of next year.\n\n### AI Regulatory Violations to Cause 30% Spike in Tech Firms’ Legal Disputes by 2028, Claims Gartner\n\n06/10/2025 6:17 pm\n\nOnly 23% IT leaders very confident in organisation’s ability to manage security and governance components when rolling out GenAI tools.\n\n### NTT DATA, AWS Clinch Deal to Deliver AI-Powered Contact Centre Solutions\n\n06/10/2025 6:13 pm\n\nThe initiative will focus on industries with complex customer lifecycles, including financial services, healthcare, telecommunications and retail.\n\nTrending Stories Masayoshi Son’s New Experiment Walks, Lifts and Learns TCS to Build 1 GW AI Data Centre in India, Reports Moderate Q2 Growth Most Heated Indian AI Debates of 2025 Tummoc and the Promise of a Seamless Commute Across India India’s AI Boom Could Crash Without This One Crucial Change\n\nAssociation of Data Scientists GenAI Corporate Training Programs Enquire Today >>",
      "source": "News Source",
      "date": "2025-10-09T14:29:58.210Z"
    },
    {
      "title": "Artificial Intelligence: Read latest news updates on AI technology | The Indian Express",
      "url": "https://indianexpress.com/section/technology/artificial-intelligence/?utm_source=valyu.ai&utm_medium=referral",
      "image_url": {
        "0": "https://indianexpress.com/wp-content/themes/indianexpress/images/IE-OGimage.jpg"
      },
      "content": "- [Gadgets](https://indianexpress.com/section/technology/gadgets/) - [Reviews](https://indianexpress.com/section/technology/tech-reviews/) - [Mobile & Tabs](https://indianexpress.com/section/technology/mobile-tabs/) - [Science](https://indianexpress.com/section/technology/science/) - [Techook](https://indianexpress.com/section/technology/techook/) - [AI](https://indianexpress.com/section/technology/artificial-intelligence/)\n\n# Artificial Intelligence News\n\n( As on - October 9, 2025 05:57 PM IST )\n\nArtificial IntelligenceOct 9, 2025\n\n## Google launches Gemini Enterprise, a new platform for workplace automation using AI agents\n\nArtificial IntelligenceOct 9, 2025\n\n## Hollywood, Bollywood groups lobby Indian panel to protect content from AI models\n\nArtificial IntelligenceOct 9, 2025\n\n## Microsoft taps Harvard for Copilot health queries as OpenAI reliance eases, WSJ reports\n\nArtificial IntelligenceOct 8, 2025\n\n## Google AI Mode gets Search Live, adds support for seven Indian languages\n\nadvertisement\n\nArtificial IntelligenceOct 8, 2025\n\n## Google debuts Gemini 2.5 Computer Use, an AI model with human-like web browsing skills\n\nArtificial IntelligenceOct 7, 2025\n\n## ‘Almost all OpenAI code written using AI tool’: Sam Altman at DevDay 2025\n\nArtificial IntelligenceOct 7, 2025\n\n## ‘Human intelligence problem’: Deloitte to refund Australian govt over AI-generated report errors\n\nArtificial IntelligenceOct 7, 2025\n\n## From OpenAI to Meta, firms channel billions into AI infrastructure as demand booms\n\nadvertisement\n\nArtificial IntelligenceOct 7, 2025\n\n## New Yale study shows no significant impact of AI on US job market\n\nArtificial IntelligenceOct 7, 2025\n\n## OpenAI DevDay 2025: ChatGPT gets apps, AgentKit for developers, and cheaper GPT models\n\nArtificial IntelligenceOct 6, 2025\n\n## AMD signs AI chip-supply deal with OpenAI, gives it option to take a 10% stake\n\nArtificial IntelligenceOct 6, 2025\n\n## Who is Rahul Patil, the former Stripe exec chosen as Anthropic’s new CTO?\n\nadvertisement\n\nArtificial IntelligenceOct 6, 2025\n\n## OpenAI acquires AI finance startup Roi for undisclosed sum\n\nArtificial IntelligenceOct 6, 2025\n\n## OpenAI’s Sora makes disinformation extremely easy and extremely real\n\nArtificial IntelligenceOct 5, 2025\n\n## Thinking Machines debuts Tinker, a developer tool to simplify fine-tuning of AI models\n\nArtificial IntelligenceOct 5, 2025\n\n## When AI came for Hollywood\n\nArtificial IntelligenceOct 5, 2025\n\n## OpenAI to boost content owners’ control for Sora AI video app, plans monetization\n\nArtificial IntelligenceOct 4, 2025\n\n## Google Gemini may get a new look with a scrollable Instagram-like feed\n\nArtificial IntelligenceOct 3, 2025\n\n## Perplexity Comet AI browser is now free for all: Here’s how it differs from Chrome and Firefox\n\nArtificial IntelligenceOct 2, 2025\n\n## Google AI Mode now lets you search with pictures and get visual inspiration\n\nArtificial IntelligenceOct 1, 2025\n\n## Meta to use AI chats to personalise content and ads from December\n\nArtificial IntelligenceOct 1, 2025\n\n## Wikipedia might give AI models access to site for ‘knowledge base’\n\nArtificial IntelligenceOct 1, 2025\n\n## OpenAI launches Sora App alongside Sora 2 for improved audio, video generation AI platform\n\nArtificial IntelligenceSep 27, 2025\n\n## AI ‘workslop’ may be destroying your productivity, suggests new Harvard study\n\nArtificial IntelligenceSep 27, 2025\n\n## Sam Altman claims AGI will take over 40% of tasks in the near future\n\n- 1 - … - [96](https://indianexpress.com/section/technology/artificial-intelligence/page/96/) - [Next](https://indianexpress.com/section/technology/artificial-intelligence/page/2/)",
      "source": "News Source",
      "date": "2025-10-09T14:29:58.210Z"
    },
    {
      "title": "Artificial intelligence (AI) News, Research and Analysis - The Conversation",
      "url": "https://theconversation.com/topics/artificial-intelligence-ai-90?utm_source=valyu.ai&utm_medium=referral",
      "image_url": {
        "0": "https://images.theconversation.com/files/695051/original/file-20251008-66-vnry9n.jpg?ixlib=rb-4.1.0&rect=0%2C229%2C1936%2C1089&q=45&auto=format&w=496&fit=clip",
        "1": "https://cdn.theconversation.com/static/tc/author/width170_default-bea415b3a0223821a698f6e3f6d5ab99.jpg"
      },
      "content": "Articles on Artificial intelligence (AI)\n\n### Displaying 1 - 20 of 2047 articles\n\nWhile most children were familiar with computers and had some idea of the internet, coding and AI were largely unfamiliar or misunderstood. Getty Images Early digital literacy prepares children for future learning and careers. Globally, nearly half of the deaths of children under five years are linked to malnutrition. Wikimedia Commons Acute malnutrition weakens a child’s immune system, which can lead to severe illness and an increased risk of death. A new AI research center opening in North Carolina: Colleges and universities are embracing AI technology, often through corporate partnerships. North Carolina Central University via Getty Images Higher education’s embrace of AI reveals deeper trends in institutional priorities − and what’s at risk. shutterstock. ESB Professional/Shutterstock Automation threatens manual jobs. But what does that mean for working-class young men. And how can policy stop them from being left behind? A crowd gathers outside the New York Stock Exchange following the ‘Great Crash’ of October 1929. New York World-Telegram and the Sun Newspaper Photograph Collection, US Library of Congress AI is showing some of the hallmarks of another technology’s rapid rise and fall back in the 1920s. These are the lessons we could learn. Particle6 Productions Hollywood’s first AI ‘actor’ has officially launched her career. Is this the future of film, or is it a gimmick? As AI becomes more integrated, it will continue to influence organizational tone, pace, communication style and decision-making norms. (Getty Images/Unsplash+) Without deliberate strategies, over-reliance on AI could erode self-trust, creativity and ethical judgment and leave organizations more fragile, not more resilient. The first attempt to lay submarine telegraph cable between Britain and France. Universal History Archive/Getty The telegraph was hailed for its revolutionary ability to span distance. Now AI is being hailed as a great leap forward. But both came with environmental costs. Sean Gladwell/Getty Images While we’re at the peak of AI hype, some people are concerned it will wipe out humanity. Students must learn not just how to use AI, but how to question it. Oscar Omondi via Unsplash Employers and societies demand graduates who can evaluate information and make sound judgments. Teachers need to be scientists themselves, experimenting and measuring the impact of powerful AI products on education. Hyoung Chang via Getty Images It can take years to collect evidence that shows effective uses of new technologies in schools. Unfortunately, early guesses sometimes go seriously wrong. AI actor Tilly Norwood. Courtesy Particle6 Production The outcry from established actors was immediate and heartfelt. Technology can be isolating, but it can also help kids learn emotional connection. Dusan Stankovic/E+ via Getty Images Virtual reality might seem like an unlikely way to help kids develop empathy, but the right VR environment can do just that. The Delphi-2M model seeks to predict a person’s next health event, and when it will happen in the next 20 years. Nan_Got/ Shutterstock Delphi-2M is the first open source, large-scale model for predicting a patient’s disease risk and when it may occur. Vikas Anand Dev/Unsplash Generative AI changes how we see – and how we decide what’s real. Are public schools set to become testing grounds for AI developments? People walk past an AI sign at the All In artificial intelligence conference, Sept. 28, 2023 in Montréal, Que. THE CANADIAN PRESS/Ryan Remiorz Canada and other OECD countries’ plans to test students’ AI literacy in 2029 threatens to obscure essential questions about the marketing of AI. Getty Images A chatbot can produce text, but it can’t sustain a probing conversation about your reasoning. Our work suggests oral assessment has a role in the age of AI. Individuals can help check the risks of AI by choosing a provider that complies with incumbent security standards. Institutions can hold AI developers accountable for building systems that are resilient against adversarial attacks. Tapati Rinchumrus / Shutterstock Individuals, organisations, countries and AI developers all have a role to play. The simple matter of reconciling actuarial precision with the values of redistribution and solidarity has always been at the heart of the insurance business. (Unsplash) In this age of algorithms, personalized insurance is encountering legal limits, especially the ban on discrimination. Can we balance accurate pricing, solidarity, and fairness? Daren England/AAP Researchers found more than 80 cases of generative AI use in Australian courts so far – mostly by people representing themselves. That comes with serious risks.\n\n### Related Topics\n\n1. [Artificial Intelligence ethics](https://theconversation.com/topics/artificial-intelligence-ethics-132140) 2. [Chatbots](https://theconversation.com/topics/chatbots-36681) 3. [ChatGPT](https://theconversation.com/topics/chatgpt-130961) 4. [Generative AI](https://theconversation.com/topics/generative-ai-133426) 5. [Give me perspective](https://theconversation.com/topics/give-me-perspective-135233) 6. [Google](https://theconversation.com/topics/google-119) 7. [Large language models](https://theconversation.com/topics/large-language-models-130671) 8. [Machine learning](https://theconversation.com/topics/machine-learning-8332) 9. [Robots](https://theconversation.com/topics/robots-6403) 10. [Technology](https://theconversation.com/topics/technology-3440)\n\n### Top contributors\n\n1. [Toby Walsh](https://theconversation.com/profiles/toby-walsh-51) Professor of AI, Research Group Leader, UNSW Sydney 2. [David Tuffley](https://theconversation.com/profiles/david-tuffley-13731) Senior Lecturer in Applied Ethics & CyberSecurity, Griffith University 3. [Anjana Susarla](https://theconversation.com/profiles/anjana-susarla-334987) Professor of Information Systems, Michigan State University 4. [Jonathan Roberts](https://theconversation.com/profiles/jonathan-roberts-94843) Professor in Robotics, Queensland University of Technology 5. [T.J. Thomson](https://theconversation.com/profiles/t-j-thomson-503845) Senior Lecturer in Visual Communication & Digital Media, RMIT University 6. [Aaron J. Snoswell](https://theconversation.com/profiles/aaron-j-snoswell-1331146) Senior Research Fellow in AI Accountability, Queensland University of Technology 7. [Nir Eisikovits](https://theconversation.com/profiles/nir-eisikovits-802914) Professor of Philosophy and Director, Applied Ethics Center, UMass Boston 8. [Bruce Schneier](https://theconversation.com/profiles/bruce-schneier-446919) Adjunct Lecturer in Public Policy, Harvard Kennedy School 9. [Sean Welsh](https://theconversation.com/profiles/sean-welsh-113910) PhD in machine ethics, University of Canterbury 10. [Michael Milford](https://theconversation.com/profiles/michael-milford-271854) Professor, Director of the Centre for Robotics, Queensland University of Technology 11. [Sandra Peter](https://theconversation.com/profiles/sandra-peter-385460) Director of Sydney Executive Plus, Business School, University of Sydney 12. [Jordan Richard Schoenherr](https://theconversation.com/profiles/jordan-richard-schoenherr-523361) Assistant Professor, Psychology, Concordia University 13. [Arend Hintze](https://theconversation.com/profiles/arend-hintze-225106) Assistant Professor of Integrative Biology & Computer Science and Engineering, Michigan State University 14. [Nello Cristianini](https://theconversation.com/profiles/nello-cristianini-241151) Professor of Artificial Intelligence, University of Bath 15. [Michelle Grattan](https://theconversation.com/profiles/michelle-grattan-20316) Professorial Fellow, University of Canberra\n\n[More](#)\n\n### Links\n\n- [Email](mailto:?subject=Artificial%20intelligence%20%28AI%29%20on%20The%20Conversation&body=Hi.%20I%20found%20this%20topic%20on%20https%3A%2F%2Ftheconversation.com%20that%20you%20might%20follow%3A%20%22Artificial%20intelligence%20%28AI%29%22%20https%3A%2F%2Ftheconversation.com%2Ftopics%2Fartificial-intelligence-ai-90) - [X (Twitter)](http://twitter.com/intent/tweet?text=Artificial+intelligence+%28AI%29&url=https%3A%2F%2Ftheconversation.com%2Ftopics%2Fartificial-intelligence-ai-90%3Futm_source%3Dtwitter%26utm_medium%3Dtwitterbutton&utm_campaign=none&via=ConversationUS) - [Facebook](http://www.facebook.com/sharer.php?u=https%3A%2F%2Ftheconversation.com%2Ftopics%2Fartificial-intelligence-ai-90%3Futm_source%3Dfacebook%26utm_medium%3Dfacebookbutton) - [LinkedIn](http://www.linkedin.com/shareArticle?mini=true&source=The+Conversation&title=Artificial+intelligence+%28AI%29&url=https%3A%2F%2Ftheconversation.com%2Ftopics%2Fartificial-intelligence-ai-90%3Futm_source%3Dlinkedin%26utm_medium%3Dlinkedinbutton) - [Feed](https://theconversation.com/topics/artificial-intelligence-ai-90/articles.atom)\n\n- [​](https://facebook.com/theConversationUS) - [​](https://twitter.com/ConversationUS) - [​](https://www.instagram.com/theconversationdotcom) - [​](https://www.linkedin.com/company/conversationus) - [​](https://newsie.social/@TheConversationUS) - [​](https://bsky.app/profile/us.theconversation.com)",
      "source": "News Source",
      "date": "2025-10-09T14:29:58.210Z"
    },
    {
      "title": "The Latest AI News and Analysis | PCMag",
      "url": "https://www.pcmag.com/news/categories/ai?utm_source=valyu.ai&utm_medium=referral",
      "image_url": {
        "0": "https://www.pcmag.com/images/pcmag-social-share.png"
      },
      "content": "### Related Categories\n\n### Latest AI News\n\n## Facing Backlash, OpenAI Curbs Use of Dead Celebrities' Likenesses in Sora\n\nThe company is creating the opt-out after the daughters of Robin Williams and Martin Luther King Jr. condemned the AI-generated videos of their fathers. Still, there might be a loophole.\n\n## Many Americans Blame Rising Electricity Costs on AI. They Don't Think It's Worth It\n\nAs tech firms pour billions into data centers, 70% of households have seen their electricity bills increase over the past year, according to a survey from energy tech firm Arbor.\n\n## NotebookLM Makes It Easier to Find Sources From Your Google Drive\n\nYou can now search your Google Drive for topics or for queries like last week's meeting notes directly within NotebookLM.\n\n## Nano Banana Is So Popular Google May Integrate It Into Some of Its Other Tools\n\nHints of Nano Banana are showing up on the Google app for tools like AI Mode, Circle to Search, and Google Lens. A Google executive has stoked the buzz further with a cryptic post on X.\n\n## Neuralink User Taps Brain Chip to Control a Robot Arm\n\nNeuralink patient Nick Wray demonstrates how the brain chip lets him control a robot arm to take a drink from a cup.\n\n## Jony Ive: Sorry You're All Addicted to Your Phones. My AI Device Will Be Different\n\nThe former Apple designer has been tight-lipped about the device he's developing with OpenAI, but the idea is to 'address a lot of the overwhelm and despair that people feel right now,' he says.\n\n## OpenAI: Here's Why Spending Billions on GPUs Makes Sense\n\nOpenAI executives explain their view on why they're spending hundreds of billions to build power-hungry data centers, amid tech bubble fears.\n\n## You Can Now Add Spotify, Zillow to ChatGPT, But Don't Call It an App Store\n\nOpenAI is rolling out app integrations for its chatbot, which one exec calls the 'evolution of ChatGPT [into] something that’ll be a bit more like an operating system.'\n\n## Deloitte Refunds Portion of $440K Report Over AI Hallucinations\n\nIt comes as the business consulting firm signs a deal with Anthropic to give all of its employees access to the Claude chatbot.\n\n## Major Evernote Update Taps AI for Search and Transcription, But Not Writing\n\nTwo years after a steep subscription price increase, rates stay the same with Evernote V11.\n\n## Elon Musk: 'Grokipedia' Arrives Later This Month\n\nMusk is hoping 'Grokipedia' will usurp Wikipedia. But it'll launch as an early beta, suggesting it'll contain its fair share of bugs.\n\n## Nvidia Isn't Enough — OpenAI Turns to AMD for GPUs, Too\n\nThe deal opens the door for OpenAI to own a 10% stake in AMD. However, CEO Sam Altman says his company is still committed to buying GPUs from longtime partner Nvidia.\n\n## Report: OpenAI's First Device Won't Feature a Screen, Working on Tech Issues\n\nJony Ive and OpenAI are reportedly struggling to determine how to teach its AI device to recognize when it should intervene in a conversation.\n\n## No More Pikachu Oppenheimer? OpenAI Promises Rightsholders More Control Over Sora Creations\n\nDetails are scant, but CEO Sam Altman says a revenue-sharing arrangement is in the works.\n\n## OpenAI's Sora Video Tops Apple App Store Despite Being Invite-Only\n\nThe service is currently only available on iOS.\n\n## Perplexity's Comet AI Browser Now Free for All, Mobile App Coming Soon\n\nAfter launching earlier this year for users on the company’s $200-per-month plan, Perplexity’s AI browser is now free for everyone with no waitlist.\n\n## OpenAI's Sora Bans Deepfakes of Public Figures, Except for Dead Celebrities\n\nSora users have been able to create AI-generated videos of Michael Jackson, Tupac Shakur, and even Malcom X. OpenAI explains why.\n\n## Ohio Lawmaker Proposes Bill to Block AI From Getting Married, Owning Property\n\nAI could be more dangerous than nuclear weapons, says Ohio lawmaker Thad Claggett. His proposed bill aims to stop AI from taking over tasks reserved for competent humans.\n\n## How Safe Is Your Facial Data With OpenAI's Sora App?\n\nTo create life-like deepfakes with Sora's Cameo feature, OpenAI needs to store your facial and audio data. Canceling your Sora account will also nuke your ChatGPT presence.\n\n## Hype for OpenAI's Sora Sparks a Resale Market for Invite Codes on eBay\n\nAny in-demand item can be resold, including invite codes for OpenAI's TikTok-like AI app.\n\n- 1\n\n- 2\n\n- 3\n\n- 4\n\n- 5\n\n- 6\n\n- 7\n\n- 8\n\n- 9\n\n- 10\n\n- ...\n\n- 91\n\n- 92",
      "source": "News Source",
      "date": "2025-10-09T14:29:58.210Z"
    },
    {
      "title": "Artificial Intelligence (AI) News Live Feed | Stock Titan",
      "url": "https://www.stocktitan.net/news/ai.html?utm_source=valyu.ai&utm_medium=referral",
      "image_url": {
        "0": "https://www.stocktitan.net/img/stock_titan_thumbnail.png"
      },
      "content": "10/09/2025 10:00 AM III : Nasdaq AI Drives Tech Services, Software Spending to New High in Q3: ISG Index™ AI\n\n10/09/2025 09:30 AM MDCE : OTC Medical Care Technologies (OTC PINK:MDCE) Advances AI Research to Help Identify Early Health Risks in Skin Cancer, Vision, Wound Care, and Mental Wellness AI penny stock\n\n10/09/2025 09:02 AM ESTC : NYSE Elastic Completes Acquisition of Jina AI, a Leader in Frontier Models for Multimodal and Multilingual Search acquisition AI\n\n10/09/2025 09:00 AM ZM : Nasdaq Zoom Phone hits 10 million seats, transforming how businesses connect in the AI era AI\n\n10/09/2025 09:00 AM YEXT : NYSE Yext Research: 86% of AI Citations Come from Brand-Managed Sources, Clarifying How Marketers Can Compete in the AI Search Era AI\n\n10/09/2025 09:00 AM QUAD : NYSE Quad makes audience creation easier, faster and more precise with natural language AI prompts powered by Snowflake AI\n\n10/09/2025 09:00 AM INTC : Nasdaq Intel Unveils Panther Lake Architecture: First AI PC Platform Built on 18A AI\n\n10/09/2025 09:00 AM CNHI : NYSE How AI is accelerating innovation in agriculture AI\n\n10/09/2025 08:55 AM SMCI : Nasdaq Hitachi Vantara Collaborates with Supermicro to Deliver Superior Performance and Scale for Mission-Critical Applications and Enterprise AI partnership AI\n\n10/09/2025 08:31 AM AISP : Nasdaq Airship AI Announces Exercise of Warrants for $9.7 Million in Gross Proceeds offering AI\n\n10/09/2025 08:30 AM WTF : Nasdaq Waton Financial Limited Unveils DePearl™, Core AI Agent Technology Bridging Traditional Markets with Web3 Infrastructure AI low float\n\n10/09/2025 08:30 AM RVLV : NYSE Zelig Debuts AI-Powered ‘Build a Look’ Fashion Experience on REVOLVE AI\n\n10/09/2025 08:30 AM PMEC : Nasdaq Primech AI’s HYTRON Robot Achieves >99% Disinfection Efficacy, Targeting $76.7B U.S. Commercial Health Market AI low float penny stock\n\n10/09/2025 08:28 AM HCTI : Nasdaq Healthcare Triangle Takes Bold Step toward AI-Driven Future with the Signing of a Non-Binding LOI for the Acquisition of Teyame.AI, which is on track to generate $34M in Revenue for fiscal year 2025 and would create for Healthcare Triangle a Next-Generation Global Customer Engagement Platform acquisition AI low float\n\n10/09/2025 08:26 AM BPAIF : OTC BrandPilot AI Joins Industry Leaders at Digital Marketing World Forum to Shape the Future of AI-Driven Advertising AI penny stock\n\n10/09/2025 08:10 AM MTEK : Nasdaq MTEKW : Nasdaq Maris-Tech to Demonstrate AI-Powered Situational Awareness and Edge Computing Solutions at AUSA 2025 AI low float\n\n10/09/2025 08:00 AM RZLV : Nasdaq Rezolve Ai Acquires Subsquid: Building the Data and Payments Backbone for the AI Economy acquisition AI\n\n10/09/2025 08:00 AM ORCL : NYSE Oracle Intelligent Communications Orchestration Network Makes It Easier to Connect Critical AI and Cloud Services AI\n\n10/09/2025 08:00 AM GAP : NYSE Gap Inc. Sets Out to Reimagine Retail Powered by Google Cloud's AI AI\n\n10/09/2025 08:00 AM FIS : NYSE FIS Brings AI-Powered Advancements to Seamless, Personalized Digital Banking Experiences AI\n\n10/09/2025 08:00 AM DUOT : Nasdaq Duos Edge AI Deploys Another Edge Data Center in Waco, Texas AI low float\n\n10/09/2025 07:55 AM DVLT : Nasdaq Datavault AI to Showcase Revolutionary Joke Token Technology for Comedic Copyright Protection at Exclusive October 11 Event in Babylon, NY AI\n\n10/09/2025 07:53 AM AIIO : Nasdaq Astra, a Subsidiary of Robo.ai, Secures Development and Procurement Order for 30,000 Smart Electric and Autonomous Vehicles (AEVs) with W Motors AI penny stock\n\n10/09/2025 07:50 AM CHAI : Nasdaq Core AI Expands Leadership in AI Audio with Launch of VoicePix 2.0 AI low float\n\n10/09/2025 07:45 AM ACN : NYSE Accenture Helps Organizations Advance Agentic AI with Gemini Enterprise AI\n\n10/09/2025 07:30 AM LTRX : Nasdaq Lantronix to Showcase Edge AI Drone Platform at AUSA 2025, Highlighting Strategic Partnerships and UAV Innovations AI\n\n10/09/2025 07:00 AM ZDGE : NYSE Zedge Introduces its AI-Powered Product Innovation Team to Drive New Growth AI low float\n\n10/09/2025 07:00 AM MOB : Nasdaq MOBBW : Nasdaq Mobilicom Debuts Industry-First Secured Autonomy Compute System with Aitech NVIDIA-Based AI Supercomputers AI low float\n\n10/09/2025 07:00 AM DCMDF : OTC DCM Unveils contentcloud.ai - An Enhanced AI-Powered Digital Asset Management (DAM) Platform AI penny stock\n\n10/09/2025 07:00 AM AZ : Nasdaq A2Z Cust2Mate Launches Dedicated AI and Business Insight Division In Line with Next-Gen Smart Cart Rollout AI\n\n10/09/2025 06:55 AM RVSN : Nasdaq Rail Vision Signs Term Sheet to Boost Growth with Advanced AI Acquisition of 51% Stake in Quantum Transportation acquisition AI penny stock\n\n10/09/2025 06:00 AM NWSA : Nasdaq NWS : Nasdaq Search It, How You Say It: Realtor.com® Launches New AI-Powered Search AI\n\n10/09/2025 06:00 AM NWSA : Nasdaq NWS : Nasdaq 82% of Americans Use AI for Housing Market Information, Realtor.com® Survey Finds AI\n\n10/09/2025 06:00 AM GPUS : NYSE Hyperscale Data Reduces Debt by $30 Million, Strengthening Capital Structure to Advance AI and Bitcoin Operations crypto AI penny stock\n\n10/09/2025 12:01 AM DXC : NYSE Security Leaders Embrace Zero Trust but Lag on Adopting AI Security Tools, DXC and Microsoft Research Finds AI\n\n10/08/2025 04:30 PM CTEV : NYSE Claritev and iO Health Forge Strategic Relationship to Bring AI-Powered Revenue Cycle Management Optimization to the MENA Region AI low float\n\n10/08/2025 02:30 PM RLAIF : OTC Railtown AI Technologies Announces Strategic Partnership with Uniserve Communications to Expand AI Solutions for SMEs partnership AI penny stock\n\n10/08/2025 02:00 PM BLKB : Nasdaq Blackbaud Unveils AI Agent Tailored to Social Impact Sector, Announces AI Coalition for Social Impact at bbcon 2025 AI\n\n10/08/2025 01:00 PM CRWV : Nasdaq CoreWeave Launches First Publicly Available Serverless Reinforcement Learning Capability to Build Reliable AI Agents AI\n\n10/08/2025 11:44 AM OPRA : Nasdaq adMarketplace Launches AMP Discover to Improve the Consumer Search Journey By Powering Advertising in Opera's Aria AI Chat Application AI\n\n10/08/2025 11:00 AM ESTC : NYSE Elastic 2025 Global Threat Report Reveals AI is Supercharging Old-School Tactics with New Scale AI\n\n10/08/2025 10:26 AM SHMD : Nasdaq SCHMID Group Expands Advanced Packaging Portfolio to Power the AI Era AI low float\n\n10/08/2025 09:30 AM MDCE : OTC Medical Care Technologies (OTC PINK:MDCE) Initiates Preparatory Phase for Self-Conducted Research Studies on AI Mental Health and Preventive Biometrics Modules AI penny stock\n\n10/08/2025 09:15 AM ISRG : Nasdaq Intuitive expands AI and advanced imaging integration in Ion Endoluminal System AI\n\n10/08/2025 09:06 AM NTWK : Nasdaq NETSOL Technologies launches Check AI: An AI-native credit decisioning engine AI low float\n\n10/08/2025 09:04 AM SOUN : Nasdaq Apivia Courtage Brings Agentic AI to its Contact Centers With SoundHound’s Amelia 7 Platform AI high short\n\n10/08/2025 09:00 AM XYZ : NYSE Square AI Gains New Intelligence Capabilities, Providing Deeper Business and Neighborhood Insights to Square Sellers AI\n\n10/08/2025 09:00 AM VRNS : Nasdaq Varonis Launches Interceptor: AI-Native Email Security to Stop Data Breaches Before They Start AI\n\n10/08/2025 09:00 AM SNX : NYSE NBIS : Nasdaq TD SYNNEX Launches AI Infrastructure-as-a-Service Offering to Accelerate AI Innovation AI\n\n10/08/2025 09:00 AM SNPS : Nasdaq Sumitomo Riko Leverages Ansys AI Technology to Accelerate Simulation Over 10x for Automotive Component Design and Manufacturing AI",
      "source": "News Source",
      "date": "2025-10-09T14:29:58.210Z"
    },
    {
      "title": "The latest AI news we announced in September",
      "url": "https://blog.google/technology/ai/google-ai-updates-september-2025/?utm_source=valyu.ai&utm_medium=referral",
      "image_url": {
        "0": "https://storage.googleapis.com/gweb-uniblog-publish-prod/images/Sep_AI_Recap_2025_hero.width-1300.png",
        "1": "https://storage.googleapis.com/gweb-uniblog-publish-prod/images/superG_v3.max-244x184.format-webp.webp",
        "2": "https://storage.googleapis.com/gweb-uniblog-publish-prod/images/1001-real-world-gen-ai-use-cases-.width-300.format-webp.webp",
        "3": "https://storage.googleapis.com/gweb-uniblog-publish-prod/original_images/Freightgeist_Social.png",
        "4": "https://storage.googleapis.com/gweb-uniblog-publish-prod/images/Hero_2_RxMg7JL.width-300.format-webp.webp"
      },
      "content": "# The latest AI news we announced in September\n\nOct 08, 2025\n\nHere’s a recap of some of our biggest AI updates from September, including an AI upgrade for Chrome, a new visual search option in AI Mode and the next step in bringing helpful robots into the physical world.\n\nFor more than 20 years, we’ve invested in machine learning and AI research, tools and infrastructure to build products that make everyday life better for more people. Teams across Google are working on ways to unlock AI’s benefits in fields as wide-ranging as healthcare, crisis response and education. To keep you posted on our progress, we're doing a regular roundup of Google's most recent AI news.\n\nHere’s a look back at some of our AI announcements from September.\n\nForget pumpkin spice; the real news from September was the massive stack of AI updates. AI delivered major updates across our most popular core services like Chrome, Search and Android, making them significantly smarter. And the Gemini app became a powerhouse with its latest Gemini Drop, featuring the viral Nano Banana, Gemini Live, custom and shareable Gems, and the no-code app-building tool, Canvas. Meanwhile, even as we integrate AI across our digital products, Google DeepMind is busy working to bring helpful robots into the physical world.\n\nWith AI our overarching goal remains the same: to make AI as useful as possible, whether through the fun, visible features that help you with everyday tasks or in the essential, behind-the-scenes magic boosting your cybersecurity and learning.\n\nWe added major new AI features to Chrome. Gemini in Chrome now acts as an AI browsing assistant, letting you answer questions and find information across all of your open tabs. We also introduced AI Mode in the omnibox for asking complex, multi-part questions, alongside future agentic capabilities that will automate multi-step tasks like ordering groceries. Plus, AI is now keeping you safer by proactively blocking new types of scams and enhancing security and privacy features. To take a deeper look at the update, we shared how AI was built into the new, shinier Chrome.\n\nWe shared five tips for Search Live, a new way to get help in real-time. By integrating an interactive voice conversation in AI Mode with the ability to share your phone’s camera feed, we’ve created a new way to get multimodal help in real-time. Search can now literally see what your camera sees and respond instantly, providing hands-free help with tasks like travel exploration, complex troubleshooting and bringing school projects to life.\n\nWe expanded AI Mode to new languages. This update brings our most powerful AI search experience, powered by a custom version of Gemini, to new languages globally: Hindi, Indonesian, Japanese, Korean, Brazilian Portuguese and Spanish. The expansion focuses on a nuanced understanding of local information so users can ask complex questions and explore the web more deeply in their preferred language.\n\nWe shared 10 ways you can use Nano Banana in the Gemini app. Since launching in August, Google DeepMind’s image generation and editing model, fondly known as Nano Banana, has quickly grown in popularity in the Gemini app. So we created 10 examples to show how capable and fun the model is, whether you’re looking for more straightforward tasks like swapping outfits in a photo, or interested in complex, imaginative image generation, like showing your adult self having a tea party with a younger you.\n\nWe made collaboration easier in the Gemini app with the ability to share custom Gems. Gems allow you to tailor Gemini for specific needs, and now you can share the ones you create with friends, family or coworkers. The sharing process is similar to Google Drive, giving you control over who can view or edit your personalized AI tools like detailed vacation guides or even custom meal planners.\n\nWe launched new Android features to help you polish and share what you write. The latest features in Android include new AI writing tools in Gboard to revise your tone and automatically fix spelling and grammar right on your device. We also announced the ability to let two people listen to the same audio simultaneously, introduced a way to create private QR code audio broadcasts and redesigned Quick Share for instant file transfer previews and live progress updates.\n\nWe've introduced the next step in bringing helpful robots into the physical world. Google DeepMind is leveling up robotics with Gemini Robotics 1.5 and Gemini Robotics-ER 1.5, kicking off the era of physical agents. These models let robots see, plan, think and use tools to tackle complicated, multi-step tasks far better than before, and allow for learnings to transfer between different types of robots. Think of Gemini Robotics-ER 1.5 as the smart brain, handling the big-picture reasoning (and even Googling stuff!) while Gemini Robotics 1.5 is the mover, turning visual information and instructions into motor commands for a robot to perform a task.\n\nWe introduced new features into NotebookLM to help with learning. Our latest updates turn NotebookLM into your ultimate personal AI study partner, with a focus on active learning. You can instantly create flashcards and quizzes grounded in your own notes, generate upgraded reports with suggested formats like a blog post or study guide, and try the Learning Guide option for personalized, step-by-step tutoring. Plus, you can now hear your sources in new ways with Audio Overviews that offer perspectives like a Critique or a Debate.\n\nWe launched new resources to promote AI literacy for parents, students and educators. These resources include a new podcast for parents called \"Raising kids in the age of AI,\" expanded student programs like the Be Internet Awesome AI Literacy curriculum and the AI Quests game-based experience. This work includes substantial support for teachers, with over 650,000 educators trained so far and $40 million in grants dedicated to scaling AI literacy programs.\n\nWe introduced Guided Learning, a new, interactive study partner in the Gemini app. Powered by LearnLM, Guided Learning fine tunes our AI models for education, allowing people to navigate any topic, step-by-step, to ask questions and promote understanding. With helpful videos and images, the result is a personalized tutor that can break down complex code, create study plans from your uploaded material, and guide you to homework solutions without doing the work for you.\n\nSundar Pichai spoke at the White House AI Education Taskforce. Sundar highlighted Google’s major push to support AI education across the U.S., including offering Gemini for Education to every high school in America. It builds on Google’s broader $1 billion commitment to support AI education in the U.S., including giving all students and teachers access to our best AI tools, putting $150 million towards grants for AI education and digital wellbeing, and expanding our AI for Education Accelerator from 100 to 200 colleges and universities.\n\nWe sent our AI to the International Collegiate Programming Contest World Finals. Gemini 2.5 Deep Think achieved a major AI milestone by achieving gold-medal level performance at the International Collegiate Programming Contest (ICPC) World Finals. This breakthrough performance in abstract problem-solving builds on our previous gold at the International Mathematical Olympiad, proving Gemini's world-class coding and reasoning capabilities.\n\n#### 1,001 real-world gen AI use cases from the world's leading organizations\n\n#### Check out the top Halloween trends of 2025 on our Frightgeist site.\n\n#### Gemini Enterprise: The new front door for Google AI in your workplace\n\n#### 4 ways Gemini Enterprise makes work easier for everyone\n\n#### Teaming up with LA28, Team USA and NBCUniversal for the LA28 Olympic and Paralympic Games\n\n#### Google is powering Belgium's digital future with a two-year €5 billion investment in AI infrastructure.",
      "source": "News Source",
      "date": "2025-10-09T14:29:58.210Z"
    },
    {
      "title": "Artificial Intelligence News -- ScienceDaily",
      "url": "https://www.sciencedaily.com/news/computers_math/artificial_intelligence/?utm_source=valyu.ai&utm_medium=referral",
      "image_url": {
        "0": "https://www.sciencedaily.com/images/scidaily-icon.png"
      },
      "content": "Top Science News\n\n# Artificial Intelligence News\n\nOctober 8, 2025\n\n## Top Headlines\n\nQuantum Chips Just Proved They’re Ready for the Real World Sep. 28, 2025 — Diraq has shown that its silicon-based quantum chips can maintain world-class accuracy even when mass-produced in semiconductor foundries. Achieving over 99% fidelity in two-qubit operations, the breakthrough clears a major hurdle toward ... Caltech’s Massive 6,100-qubit Array Brings the Quantum Future Closer Sep. 25, 2025 — Caltech scientists have built a record-breaking array of 6,100 neutral-atom qubits, a critical step toward powerful error-corrected quantum computers. The qubits maintained long-lasting superposition and exceptional accuracy, even while being moved ... Scientists Just Made Atoms Talk to Each Other Inside Silicon Chips Sep. 21, 2025 — Researchers at UNSW have found a way to make atomic nuclei communicate through electrons, allowing them to achieve entanglement at scales used in today’s computer chips. This breakthrough brings scalable, silicon-based quantum computing much ... AI Has No Idea What It’s Doing, but It’s Threatening Us All Sep. 7, 2025 — Artificial intelligence is reshaping law, ethics, and society at a speed that threatens fundamental human dignity. Dr. Maria Randazzo of Charles Darwin University warns that current regulation fails to protect rights such as privacy, autonomy, and ... Caltech Breakthrough Makes Quantum Memory Last 30 Times Longer Aug. 27, 2025 — While superconducting qubits are great at fast calculations, they struggle to store information for long periods. A team at Caltech has now developed a clever solution: converting quantum information into sound waves. By using a tiny device that ... Why Tiny Bee Brains Could Hold the Key to Smarter AI Aug. 24, 2025 — Researchers discovered that bees use flight movements to sharpen brain signals, enabling them to recognize patterns with remarkable accuracy. A digital model of their brain shows that this movement-based perception could revolutionize AI and ... Scientists Just Cracked the Quantum Code Hidden in a Single Atom Aug. 22, 2025 — A research team has created a quantum logic gate that uses fewer qubits by encoding them with the powerful GKP error-correction code. By entangling quantum vibrations inside a single atom, they achieved a milestone that could transform how quantum ... This Simple Magnetic Trick Could Change Quantum Computing Forever Aug. 16, 2025 — Researchers have unveiled a new quantum material that could make quantum computers much more stable by using magnetism to protect delicate qubits from environmental disturbances. Unlike traditional approaches that rely on rare spin-orbit ... Tiny “Talking” Robots Form Shape-shifting Swarms That Heal Themselves Aug. 13, 2025 — Scientists have designed swarms of microscopic robots that communicate and coordinate using sound waves, much like bees or birds. These self-organizing micromachines can adapt to their surroundings, reform if damaged, and potentially undertake ... A Simple Twist Fooled AI—and Revealed a Dangerous Flaw in Medical Ethics July 24, 2025 — Even the most powerful AI models, including ChatGPT, can make surprisingly basic errors when navigating ethical medical decisions, a new study reveals. Researchers tweaked familiar ethical dilemmas and discovered that AI often defaulted to intuitive ... Scientists Discover the Moment AI Truly Understands Language July 8, 2025 — Neural networks first treat sentences like puzzles solved by word order, but once they read enough, a tipping point sends them diving into word meaning instead—an abrupt “phase transition” reminiscent of water flashing into steam. By revealing ... Scientists Just Simulated the “Impossible” — Fault-tolerant Quantum Code Cracked at Last July 3, 2025 — A multinational team has cracked a long-standing barrier to reliable quantum computing by inventing an algorithm that lets ordinary computers faithfully mimic a fault-tolerant quantum circuit built ...\n\n## Latest Headlines\n\nupdated 11:13am EDT\n\nThese Little Robots Literally Walk on Water Oct. 4, 2025 — HydroSpread, a breakthrough fabrication method, lets scientists build ultrathin soft robots directly on water. These tiny, insect-inspired machines could transform robotics, healthcare, and ... AI-Powered Smart Bandage Heals Wounds 25% Faster Sep. 24, 2025 — A new wearable device, a-Heal, combines AI, imaging, and bioelectronics to speed up wound recovery. It continuously monitors wounds, diagnoses healing stages, and applies personalized treatments like ... Harvard’s Ultra-Thin Chip Could Revolutionize Quantum Computing July 25, 2025 — Researchers at Harvard have created a groundbreaking metasurface that can replace bulky and complex optical components used in quantum computing with a single, ultra-thin, nanostructured layer. This ... Google's Deepfake Hunter Sees What You Can’t—even in Videos Without Faces July 25, 2025 — AI-generated videos are becoming dangerously convincing and UC Riverside researchers have teamed up with Google to fight back. Their new system, ... Quantum Computers Just Beat Classical Ones — Exponentially and Unconditionally June 30, 2025 — A research team has achieved the holy grail of quantum computing: an exponential speedup that’s unconditional. By using clever error correction and ... Quantum Breakthrough: ‘Magic States’ Now Easier, Faster, and Way Less Noisy June 26, 2025 — Quantum computing just got a significant boost thanks to researchers at the University of Osaka, who developed a much more efficient way to create ... Quantum Computers Just Got an Upgrade – and It’s 10× More Efficient June 25, 2025 — Chalmers engineers built a pulse-driven qubit amplifier that’s ten times more efficient, stays cool, and safeguards quantum states—key for bigger, better quantum ... Affordances in the Brain: The Human Superpower AI Hasn’t Mastered June 23, 2025 — Scientists at the University of Amsterdam discovered that our brains automatically understand how we can move through different environments—whether it's swimming in a lake or walking a ... Half of Today’s Jobs Could vanish—Here’s How Smart Countries Are Future-Proofing Workers June 22, 2025 — AI is revolutionizing the job landscape, prompting nations worldwide to prepare their workforces for dramatic changes. A University of Georgia study ... AI at Light Speed: How Glass Fibers Could Replace Silicon Brains June 20, 2025 — Imagine supercomputers that think with light instead of electricity. That s the breakthrough two European research teams have made, demonstrating how intense laser pulses through ultra-thin glass ...\n\n- [These Little Robots Literally Walk on Water](https://www.sciencedaily.com/releases/2025/10/251003033930.htm) - [Smart Bandage Heals Wounds Faster With AI](https://www.sciencedaily.com/releases/2025/09/250924012232.htm) - [Harvard’s Ultra-Thin Quantum Computing Chip](https://www.sciencedaily.com/releases/2025/07/250724232413.htm) - [Google's Deepfake Hunter Is Here](https://www.sciencedaily.com/releases/2025/07/250724232412.htm) - [Holy Grail of Quantum Computing Achieved](https://www.sciencedaily.com/releases/2025/06/250629033459.htm) - [Quantum Hack Silences Noise, Boosts Speed](https://www.sciencedaily.com/releases/2025/06/250621233816.htm) - [Quantum Speed Boost, 90% Less Heat](https://www.sciencedaily.com/releases/2025/06/250625011632.htm) - [Affordance: The Brain’s Hidden Superpower](https://www.sciencedaily.com/releases/2025/06/250622225921.htm) - [Half of Today’s Jobs Could Vanish](https://www.sciencedaily.com/releases/2025/06/250622030429.htm) - [AI at Light Speed](https://www.sciencedaily.com/releases/2025/06/250619090855.htm)\n\n/Top Science News\n\n## Earlier Headlines\n\n- [Summaries](#summaries) - [Headlines](#headlines)\n\nThe AI That Writes Climate-Friendly Cement Recipes in Seconds June 19, 2025 — AI researchers in Switzerland have found a way to dramatically cut cement s carbon footprint by redesigning its recipe. Their system simulates thousands of ingredient combinations, pinpointing those ... Robots That Feel Heat, Pain, and Pressure? This New “skin” Makes It Possible June 16, 2025 — Researchers have created a revolutionary robotic skin that brings machines closer to human-like touch. Made from a flexible, low-cost gel material, this skin transforms the entire surface of a ... Photonic Quantum Chips Are Making AI Smarter and Greener June 8, 2025 — A team of researchers has shown that even small-scale quantum computers can enhance machine learning performance, using a novel photonic quantum circuit. Their findings suggest that today s quantum ... This “robot Bird” Flies at 45 Mph Through forests—With No GPS or Light June 7, 2025 — Unlike birds, which navigate unknown environments with remarkable speed and agility, drones typically rely on external guidance or pre-mapped routes. However, a groundbreaking development by ... Guardrails, Education Urged to Protect Adolescent AI Users June 3, 2025 — The effects of artificial intelligence on adolescents are nuanced and complex, according to a new report that calls on developers to prioritize features that protect young people from exploitation, ... Self-Powered Artificial Synapse Mimics Human Color Vision June 2, 2025 — Despite advances in machine vision, processing visual data requires substantial computing resources and energy, limiting deployment in edge devices. Now, researchers from Japan have developed a ... Engineers Develop Self-Healing Muscle for Robots May 30, 2025 — Students recently unveiled their invention of a robotic actuator -- the 'muscle' that converts energy into a robot's physical movement -- that has the ability to detect punctures or ... Horses 'Mane' Inspiration for New Generation of Social Robots May 28, 2025 — Interactive robots should not just be passive companions, but active partners -- like therapy horses who respond to human emotion -- say ... Mid-Air Transformation Helps Flying, Rolling Robot to Transition Smoothly May 28, 2025 — Engineers have developed a real-life Transformer that has the 'brains' to morph in midair, allowing the drone-like robot to smoothly roll away and begin its ground operations without pause. ... AI Meets Game Theory: How Language Models Perform in Human-Like Social Scenarios May 28, 2025 — Large language models (LLMs) -- the advanced AI behind tools like ChatGPT -- are increasingly integrated into daily life, assisting with tasks such as writing emails, answering questions, and even ... Solitonic Superfluorescence Paves Way for High-Temperature Quantum Materials May 28, 2025 — A new study in Nature describes both the mechanism and the material conditions necessary for superfluorescence at high ... Emotional Responses Crucial to Attitudes About Self-Driving Cars May 27, 2025 — When it comes to public attitudes toward using self-driving cars, understanding how the vehicles work is important -- but so are less obvious characteristics like feelings of excitement or pleasure ... AI Is Here to Stay, Let Students Embrace the Technology, Experts Urge May 22, 2025 — A new study says students appear to be using generative artificial intelligence (GenAI) responsibly, and as a way to speed up tasks, not just boost their ... Could AI Understand Emotions Better Than We Do? May 22, 2025 — Is artificial intelligence (AI) capable of suggesting appropriate behavior in emotionally charged situations? A team put six generative AIs -- including ChatGPT -- to the test using emotional ... Scientists Discover Class of Crystals With Properties That May Prove Revolutionary May 21, 2025 — By twisting atom-thin sheets of graphene in just the right way, Rutgers researchers created intercrystals, a new form of matter where geometry alone controls electron behavior. These strange ... MIT Scientists Develop Tool That Makes Underwater Scenes Crystal Clear May 21, 2025 — MIT and WHOI scientists have unveiled SeaSplat, a system that makes underwater scenes look as if the ocean had been drained away. The tool cancels out water’s distortions and builds true-color 3D ... World's First Petahertz-Speed Phototransistor in Ambient Conditions May 19, 2025 — Researchers demonstrated a way to to manipulate electrons using pulses of light that last less than a trillionth of a second to record electrons bypassing a physical barrier almost instantaneously -- ... Robots Learning Without Us? New Study Cuts Humans from Early Testing May 19, 2025 — Humans no longer have exclusive control over training social robots to interact effectively, thanks to a new study. The study introduces a new simulation method that lets researchers test their ... Empowering Robots With Human-Like Perception to Navigate Unwieldy Terrain May 19, 2025 — Researchers have developed a novel framework named WildFusion that fuses vision, vibration and touch to enable robots to 'sense' and navigate complex outdoor environments much like humans ... With Evolutionary AI, Scientists Find Hidden Keys for Better Land Use May 19, 2025 — Using centuries of land-use data, scientists have trained an AI system that evolves policy ideas the way nature evolves species—testing, mutating, and keeping only the best. The result? Smarter ...\n\nend summaries tab\n\n### Thursday, June 19, 2025\n\n- [The AI That Writes Climate-Friendly Cement Recipes in Seconds](https://www.sciencedaily.com/releases/2025/06/250619035502.htm)\n\n### Monday, June 16, 2025\n\n- [Robots That Feel Heat, Pain, and Pressure? This New “skin” Makes It Possible](https://www.sciencedaily.com/releases/2025/06/250616040237.htm)\n\n### Sunday, June 8, 2025\n\n- [Photonic Quantum Chips Are Making AI Smarter and Greener](https://www.sciencedaily.com/releases/2025/06/250608222002.htm)\n\n### Saturday, June 7, 2025\n\n- [This “robot Bird” Flies at 45 Mph Through forests—With No GPS or Light](https://www.sciencedaily.com/releases/2025/06/250607103103.htm)\n\n### Tuesday, June 3, 2025\n\n- [Guardrails, Education Urged to Protect Adolescent AI Users](https://www.sciencedaily.com/releases/2025/06/250603141208.htm)\n\n### Monday, June 2, 2025\n\n- [Self-Powered Artificial Synapse Mimics Human Color Vision](https://www.sciencedaily.com/releases/2025/06/250602155323.htm)\n\n### Friday, May 30, 2025\n\n- [Engineers Develop Self-Healing Muscle for Robots](https://www.sciencedaily.com/releases/2025/05/250530151849.htm)\n\n### Wednesday, May 28, 2025\n\n- [Horses 'mane' Inspiration for New Generation of Social Robots](https://www.sciencedaily.com/releases/2025/05/250528214222.htm) - [Mid-Air Transformation Helps Flying, Rolling Robot to Transition Smoothly](https://www.sciencedaily.com/releases/2025/05/250528150829.htm) - [AI Meets Game Theory: How Language Models Perform in Human-Like Social Scenarios](https://www.sciencedaily.com/releases/2025/05/250528132456.htm) - [Solitonic Superfluorescence Paves Way for High-Temperature Quantum Materials](https://www.sciencedaily.com/releases/2025/05/250528131645.htm)\n\n### Tuesday, May 27, 2025\n\n- [Emotional Responses Crucial to Attitudes About Self-Driving Cars](https://www.sciencedaily.com/releases/2025/05/250527124219.htm)\n\n### Thursday, May 22, 2025\n\n- [AI Is Here to Stay, Let Students Embrace the Technology, Experts Urge](https://www.sciencedaily.com/releases/2025/05/250522133513.htm) - [Could AI Understand Emotions Better Than We Do?](https://www.sciencedaily.com/releases/2025/05/250522124755.htm)\n\n### Wednesday, May 21, 2025\n\n- [Scientists Discover Class of Crystals With Properties That May Prove Revolutionary](https://www.sciencedaily.com/releases/2025/05/250521161106.htm) - [MIT Scientists Develop Tool That Makes Underwater Scenes Crystal Clear](https://www.sciencedaily.com/releases/2025/05/250521125256.htm)\n\n### Monday, May 19, 2025\n\n- [World's First Petahertz-Speed Phototransistor in Ambient Conditions](https://www.sciencedaily.com/releases/2025/05/250519204533.htm) - [Robots Learning Without Us? New Study Cuts Humans from Early Testing](https://www.sciencedaily.com/releases/2025/05/250519132026.htm) - [Empowering Robots With Human-Like Perception to Navigate Unwieldy Terrain](https://www.sciencedaily.com/releases/2025/05/250519132021.htm) - [With Evolutionary AI, Scientists Find Hidden Keys for Better Land Use](https://www.sciencedaily.com/releases/2025/05/250519131038.htm) - [Remotely Controlled Robots at Your Fingertips: Enhancing Safety in Industrial Sites](https://www.sciencedaily.com/releases/2025/05/250519131817.htm)\n\n### Thursday, May 15, 2025\n\n- [Learning as an Adventure: The Lecture Theater in the Spaceship](https://www.sciencedaily.com/releases/2025/05/250515132510.htm) - [Seeing Blood Clots Before They Strike](https://www.sciencedaily.com/releases/2025/05/250515132126.htm)\n\n### Wednesday, May 14, 2025\n\n- [Following the Folds -- With Quantum Technology](https://www.sciencedaily.com/releases/2025/05/250514175424.htm) - [Study Shows Vision-Language Models Can't Handle Queries With Negation Words](https://www.sciencedaily.com/releases/2025/05/250514165630.htm) - [Artificial Intelligence and Genetics Can Help Farmers Grow Corn With Less Fertilizer](https://www.sciencedaily.com/releases/2025/05/250514164325.htm) - [Energy and Memory: A New Neural Network Paradigm](https://www.sciencedaily.com/releases/2025/05/250514164320.htm) - [How We Think About Protecting Data](https://www.sciencedaily.com/releases/2025/05/250514164318.htm) - [The Key to Spotting Dyslexia Early Could Be AI-Powered Handwriting Analysis](https://www.sciencedaily.com/releases/2025/05/250514151712.htm) - [Handy Octopus Robot Can Adapt to Its Surroundings](https://www.sciencedaily.com/releases/2025/05/250514141656.htm) - [Digital Lab for Data And Robot-Driven Materials Science](https://www.sciencedaily.com/releases/2025/05/250514120105.htm) - [Protons on the Move](https://www.sciencedaily.com/releases/2025/05/250514111225.htm) - [Light-Driven Cockroach Cyborgs Navigate Without Wires or Surgery](https://www.sciencedaily.com/releases/2025/05/250514181651.htm)\n\n### Tuesday, May 13, 2025\n\n- [Eldercare Robot Helps People Sit and Stand, and Catches Them If They Fall](https://www.sciencedaily.com/releases/2025/05/250513172033.htm) - [Robotic Hand Moves Objects With Human-Like Grasp](https://www.sciencedaily.com/releases/2025/05/250513112155.htm) - [AI Meets the Conditions for Having Free Will -- We Need to Give It a Moral Compass](https://www.sciencedaily.com/releases/2025/05/250513112151.htm) - [New Computer Language Helps Spot Hidden Pollutants](https://www.sciencedaily.com/releases/2025/05/250513172036.htm)\n\n### Monday, May 12, 2025\n\n- [Submarine Robot Catches an Underwater Wave](https://www.sciencedaily.com/releases/2025/05/250512153357.htm)\n\n### Thursday, May 8, 2025\n\n- [Ping Pong Bot Returns Shots With High-Speed Precision](https://www.sciencedaily.com/releases/2025/05/250508161448.htm) - [Robotic Dog Mimics Mammals for Superior Mobility on Land and in Water](https://www.sciencedaily.com/releases/2025/05/250508112731.htm) - [Eco-Friendly Aquatic Robot Is Made from Fish Food](https://www.sciencedaily.com/releases/2025/05/250508112558.htm) - [Is AI Truly Creative? Turns out Creativity Is in the Eye of the Beholder](https://www.sciencedaily.com/releases/2025/05/250508112427.htm)\n\n### Wednesday, May 7, 2025\n\n- [Transforming Hospital Sanitation: Autonomous Robots for Wiping and UV-C Disinfection](https://www.sciencedaily.com/releases/2025/05/250507130744.htm) - [Is Virtual-Only Couture the New Clothing Craze?](https://www.sciencedaily.com/releases/2025/05/250507130506.htm)\n\n### Tuesday, May 6, 2025\n\n- [Gender Characteristics of Service Robots Can Influence Customer Decisions](https://www.sciencedaily.com/releases/2025/05/250506152209.htm) - [How AI Tools Can Improve Manufacturing Worker Safety, Product Quality](https://www.sciencedaily.com/releases/2025/05/250506131333.htm)\n\n### Monday, May 5, 2025\n\n- [A New Method for Characterizing Quantum Gate Errors](https://www.sciencedaily.com/releases/2025/05/250505204915.htm) - [Robotic Touch Sensors Are Not Just Skin Deep](https://www.sciencedaily.com/releases/2025/05/250505171017.htm) - [Text-to-Video AI Blossoms With New Metamorphic Video Capabilities](https://www.sciencedaily.com/releases/2025/05/250505170633.htm) - [Privacy-Aware Building Automation](https://www.sciencedaily.com/releases/2025/05/250505121743.htm)\n\n### Thursday, May 1, 2025\n\n- [Using Principles of Swarm Intelligence, Study Compared Platforms That Allow Brainstorming Among Large Groups](https://www.sciencedaily.com/releases/2025/05/250501164122.htm) - [Making AI Models More Trustworthy for High-Stakes Settings](https://www.sciencedaily.com/releases/2025/05/250501164119.htm) - [Artificial Sense of Touch, Improved](https://www.sciencedaily.com/releases/2025/05/250501122459.htm) - [Researchers Develop a Novel Vote-Based Model for More Accurate Hand-Held Object Pose Estimation](https://www.sciencedaily.com/releases/2025/05/250501122251.htm)\n\n### Wednesday, April 30, 2025\n\n- [Engineers Advance Toward a Fault-Tolerant Quantum Computer](https://www.sciencedaily.com/releases/2025/04/250430142617.htm) - ['Explainable' AI Cracks Secret Language of Sticky Proteins](https://www.sciencedaily.com/releases/2025/04/250430141644.htm)\n\n### Monday, April 28, 2025\n\n- [Advancing AI for Diverse Applications in Manufacturing, Business and Education](https://www.sciencedaily.com/releases/2025/04/250428221228.htm)\n\n### Friday, April 25, 2025\n\n- [Cutting the Complexity from Digital Carpentry](https://www.sciencedaily.com/releases/2025/04/250425113342.htm)\n\n### Thursday, April 24, 2025\n\n- [Awkward. Humans Are Still Better Than AI at Reading the Room](https://www.sciencedaily.com/releases/2025/04/250424165649.htm) - [Flying Robots Unlock New Horizons in Construction](https://www.sciencedaily.com/releases/2025/04/250424121155.htm) - [Making AI-Generated Code More Accurate in Any Language](https://www.sciencedaily.com/releases/2025/04/250424121658.htm)\n\n### Wednesday, April 23, 2025\n\n- [Engineering a Robot That Can Jump 10 Feet High -- Without Legs](https://www.sciencedaily.com/releases/2025/04/250423164027.htm) - ['Periodic Table of Machine Learning' Could Fuel AI Discovery](https://www.sciencedaily.com/releases/2025/04/250423135036.htm) - [Generative AI Masters the Art of Scent Creation](https://www.sciencedaily.com/releases/2025/04/250423112654.htm) - [New Electronic 'skin' Could Enable Lightweight Night-Vision Glasses](https://www.sciencedaily.com/releases/2025/04/250423111902.htm) - [Material? Robot? It's a Metabot](https://www.sciencedaily.com/releases/2025/04/250423111857.htm)\n\n### Tuesday, April 22, 2025\n\n- [Robot See, Robot Do: System Learns After Watching How-to Videos](https://www.sciencedaily.com/releases/2025/04/250422155938.htm) - [Brain-Inspired AI Breakthrough: Making Computers See More Like Humans](https://www.sciencedaily.com/releases/2025/04/250422131924.htm) - [AI Tool Grounded in Evidence-Based Medicine Outperformed Other AI Tools -- And Most Doctors On USMLE Exams](https://www.sciencedaily.com/releases/2025/04/250422131218.htm)\n\n### Monday, April 21, 2025\n\n- [It's a Quantum Zoo out There, and Scientists Just Found a Dozen New 'species'](https://www.sciencedaily.com/releases/2025/04/250421162939.htm) - [High-Tech Sticker Can Identify Real Human Emotions](https://www.sciencedaily.com/releases/2025/04/250421162810.htm)\n\n### Wednesday, April 16, 2025\n\n- [RoboBee Comes in for a Landing](https://www.sciencedaily.com/releases/2025/04/250416151924.htm)\n\n### Tuesday, April 15, 2025\n\n- [Explainable AI for Ship Navigation Raises Trust, Decreases Human Error](https://www.sciencedaily.com/releases/2025/04/250415144007.htm)\n\n### Monday, April 14, 2025\n\n- [AI Tool to Better Assess Parkinson's Disease, Other Movement Disorders](https://www.sciencedaily.com/releases/2025/04/250414134922.htm) - [Photonic Computing Needs More Nonlinearity: Acoustics Can Help](https://www.sciencedaily.com/releases/2025/04/250414124725.htm) - [How the Brain Controls Movement Under Uncertainty](https://www.sciencedaily.com/releases/2025/04/250414124345.htm)\n\n### Thursday, April 10, 2025\n\n- [AI Tool Set to Speed Quest for Advanced Superconductors](https://www.sciencedaily.com/releases/2025/04/250410160958.htm)\n\n### Wednesday, April 9, 2025\n\n- [AI Models of the Brain Could Serve as 'digital Twins' In Research](https://www.sciencedaily.com/releases/2025/04/250409173116.htm) - [Could LLMs Help Design Our Next Medicines and Materials?](https://www.sciencedaily.com/releases/2025/04/250409155046.htm) - [A New Robotic Gripper Made of Measuring Tape Is Sizing Up Fruit and Veggie Picking](https://www.sciencedaily.com/releases/2025/04/250409154638.htm) - [Hopping Gives This Tiny Robot a Leg Up](https://www.sciencedaily.com/releases/2025/04/250409154610.htm) - [Engineers Bring Sign Language to 'life' Using AI to Translate in Real-Time](https://www.sciencedaily.com/releases/2025/04/250409114945.htm) - [3D-Printed Open-Source Robot Offers Accessible Solution for Materials Synthesis](https://www.",
      "source": "News Source",
      "date": "2025-10-09T14:29:58.210Z"
    },
    {
      "title": "AI is a strategic tool to improve scientific research - The Joint Research Centre: EU Science Hub",
      "url": "https://joint-research-centre.ec.europa.eu/jrc-news-and-updates/ai-strategic-tool-improve-scientific-research-2025-10-08_en?utm_source=valyu.ai&utm_medium=referral",
      "image_url": {
        "0": "https://joint-research-centre.ec.europa.eu/sites/default/files/styles/ewcms_metatag_image/public/2025-10/AdobeStock_1423685034.jpeg?h=ae1ec0d2&itok=zgg_-4vz",
        "1": "https://joint-research-centre.ec.europa.eu/sites/default/files/styles/oe_theme_medium_no_crop/public/2025-10/AdobeStock_1423685034.jpeg?itok=8XFG9OLP",
        "2": "https://joint-research-centre.ec.europa.eu/sites/default/files/styles/oe_theme_ratio_3_2_medium/public/2025-09/Childhood_cancer_SH_AdobeStock_481090419.jpeg?h=f872b3ed&itok=g6I5xY0n",
        "3": "https://joint-research-centre.ec.europa.eu/sites/default/files/styles/oe_theme_ratio_3_2_medium/public/2025-07/smartwatch_wearable_data_AdobeStock_631232500.jpeg?h=71cccd6d&itok=3Geyrg6r",
        "4": "https://joint-research-centre.ec.europa.eu/sites/default/files/styles/oe_theme_ratio_3_2_medium/public/2025-07/Medical%20imaging-stock_adobe_com_254908648.jpeg?h=7b8f1edf&itok=OTzn8Oks"
      },
      "content": "# AI is a strategic tool to improve scientific research\n\n© Gorodenkoff, stock.adobe.com\n\nThe Commission publishes today “[A European Strategy for Artificial Intelligence in Science Paving the way for the Resource for AI Science in Europe (RAISE)](https://research-and-innovation.ec.europa.eu/document/c1afd7d0-ff65-4f84-be48-b0e0949596c5_en)” to accelerate the adoption of AI by European scientists in all disciplines.\n\nThe Joint Research Centre (JRC) report“[Role of Artificial Intelligence in Scientific Research - A Science for Policy, European Perspective](https://publications.jrc.ec.europa.eu/repository/handle/JRC143482)” accompanies the Strategy, providing a detailed analysis on the use of AI in the scientific process and the landscape of AI in science.This report helps policymakers develop informed policies to unlock AI’s full potential for EU research and paves the way for informed investment decisions.\n\nThe JRC will lead the future **AI Evaluation Hub**, announced in the Strategy, to monitor and evaluate AI models and systems in strategic scientific fields.\n\n## The EU has the biggest share of AI research players\n\nThe JRC studied the global distribution of AI players, including research institutes, government bodies and firms publishing scientific articles, filing for priority patents or having their core business in AI activities.\n\nUntil 2024, two in five global AI players had at least one research and innovation (R&I) activity, (i.e. had filed for a patent on AI or published a scientific article on the topic). The JRC finds that among the AI players with research activities, the EU has the biggest share of AI research players (13%, US 4%, China 1%).\n\n## Accelerating the adoption of AI tools in research\n\nTo accelerate the uptake of AI in science, the JRC stresses the need for shared infrastructures and open science to ensure reproducibility, wider access, and trustworthiness.\n\nWhile AI models are becoming more powerful and versatile, they also require significant resources for training and deployment. This makes investment in High-Performance Computing (HPC), AI Factories (ecosystems that foster innovation and collaboration) and open scientific data repositories essential to secure EU's position as a leader in AI research.\n\nA larger use of AI in science would generate new requirements for specialised expertise among researchers. The JRC assessment on skills shows the need for “hybrid” (multidisciplinary and interdisciplinary) teams that combine expertise in engineering, computer sciences and AI with specific domain expertise. Policies should therefore focus on attracting, developing and retaining this interdisciplinary talent to ensure that human expertise remains central to the research process.\n\n## AI is reshaping scientific research\n\nResearchers use AI to enhance search and discovery in science, leveraging its context-aware and semantic search capabilities to generate answers based on search results.\n\nThe JRC report finds that scientists employ AI tools in varied fields, tasks and disciplines, from engineering to life sciences and humanities to drive real, applicable innovations. This includes using AI tools to analyse proteins more efficiently in life-science research, an AI application proven particularly successful in medicine like more effective drug discovery.\n\n## Background\n\nDrawing on deep dives into AI technology for protein structure prediction, material discovery and computational humanities, JRC report showcases how AI is accelerating innovation and strengthening EU research.\n\nOpportunities are emerging across the full scientific process, from data analysis to the generation of novel research hypotheses. By assessing their potential and impact, the report gathers invaluable insights to guide investments in crucial areas such as high-performance computing and open-science infrastructure. This research can thereby boost EU competitiveness at global leve\n\nThe EU [Competitiveness compass](https://commission.europa.eu/topics/eu-competitiveness/competitiveness-compass_en), published in January 2025, and the [Clean Industrial Deal](https://commission.europa.eu/topics/eu-competitiveness/clean-industrial-deal_en), published in February 2025, emphasise the importance of circular economy in creating a more sustainable, resilient and competitive European industrial sector, that in turn supports the EU's climate goals, while promoting more efficient technologies and job creation.\n\n## Related videos\n\nValentin Comte and his colleagues in the Digital Health team at the Joint Research Centre are exploring the latest scientific breakthroughs in medical imaging\n\nSee also: [AI in Science – Disaster Risk Management](https://audiovisual.ec.europa.eu/en/media/video/I-278437).\n\n## Related link\n\n[Press release - Commission launches two strategies to speed up AI uptake in European industry and science](https://ec.europa.eu/commission/presscorner/detail/en/ip_25_2299)\n\n## Details\n\nPublication date8 October 2025AuthorJoint Research Centre\n\nJRC portfolios 2025-27\n\n- [AI and data](https://joint-research-centre.ec.europa.eu/scientific-portfolios/ai-and-data_en)\n\n## More news on a similar topic\n\n- News announcement - 25 September 2025\n\n[Rising trend of new childhood cancer cases in EU over time](https://joint-research-centre.ec.europa.eu/jrc-news-and-updates/rising-trend-new-childhood-cancer-cases-eu-over-time-2025-09-25_en)\n\n- 3 min read\n\n- General publications - 11 July 2025\n\n[Wearable data: can they be shared for a public interest, such as healthcare?](https://joint-research-centre.ec.europa.eu/jrc-news-and-updates/wearable-data-can-they-be-shared-public-interest-such-healthcare-2025-07-11_en)\n\n- 3 min read\n\n- General publications - 1 July 2025\n\n[AI in medical imaging: where do we stand and what comes next?](https://joint-research-centre.ec.europa.eu/jrc-news-and-updates/ai-medical-imaging-where-do-we-stand-and-what-comes-next-2025-07-01_en)\n\n- 3 min read\n\n- News announcement - 13 June 2025\n\n[How is generative AI impacting our economy, society and policy?](https://joint-research-centre.ec.europa.eu/jrc-news-and-updates/how-generative-ai-impacting-our-economy-society-and-policy-2025-06-13_en)\n\n- 4 min read",
      "source": "News Source",
      "date": "2025-10-09T14:29:58.210Z"
    },
    {
      "title": "RZLV News Today | Why did Rezolve AI stock go down today? $RZLV",
      "url": "https://www.marketbeat.com/stocks/NASDAQ/RZLV/news/?utm_source=valyu.ai&utm_medium=referral",
      "image_url": {
        "0": "https://www.marketbeat.com/images/loading-gif-small.gif",
        "1": "https://www.marketbeat.com/images/news-sites/businessinsider.png",
        "2": "https://www.marketbeat.com/images/news-sites/marketbeat.png",
        "3": "https://www.marketbeat.com/images/news-sites/prnewswire.jpg",
        "4": "https://www.marketbeat.com/images/news-sites/globenewswire.png"
      },
      "content": "# Rezolve AI (RZLV) News Today\n\n- Stock Analysis\n\n- Analyst Forecasts\n\n- Chart\n\n- Competitors\n\n- Headlines\n\n- Ownership\n\n- SEC Filings\n\n- Short Interest\n\n- Trends\n\n- Buy This Stock\n\n## Why Is Rezolve AI Down Today?\n\nRezolve AI PLC (NASDAQ: RZLV) shares are trading higher today, driven by strategic moves in digital-asset payments alongside ongoing analyst coverage and legal developments. Key factors include:\n\n- Positive Sentiment: Rezolve AI expanded its global digital-asset payment network by acquiring Smartpay, bolstering its infrastructure for seamless crypto and fiat transactions. Rezolve AI Acquires Smartpay\n\n- Positive Sentiment: Following the Smartpay acquisition, Rezolve outlined its “agentic commerce” architecture, detailing how AI, digital-asset payments and real-time data will converge to support a $100 trillion global economy. Agentic Commerce Architecture\n\n- Neutral Sentiment: An MSN Markets column highlighted Rezolve as an “underdog AI stock” that’s up 380% over six months, with analysts forecasting another 70% upside—underscoring bullish sentiment but not new company news. Underdog AI Stock Feature\n\n- Negative Sentiment: Weiss Ratings reaffirmed a “sell (E+)” rating on RZLV shares, maintaining their cautious stance on the stock. Weiss Ratings Sell Reiteration\n\n- Negative Sentiment: Pomerantz LLP launched a securities-fraud investigation on behalf of Rezolve AI investors, citing potential disclosure issues—a development that could heighten legal risk. Pomerantz Investigation Alert\n\n- Negative Sentiment: HC Wainwright cut its FY2025 EPS estimates for Rezolve AI, pointing to potential margin pressure and slower-than-expected revenue growth. FY2025 EPS Estimate Cut\n\n- Negative Sentiment: Northland Capital Markets expressed a negative view on Rezolve AI’s upcoming Q3 earnings, flagging weaker metrics that may fall short of market expectations. Northland Q3 View\n\nInvestors will be watching how the Smartpay integration drives revenue growth and whether legal and analyst headwinds temper the recent rally.\n\n## RZLV Latest News\n\n- Very Positive\n\n- Positive\n\n- Neutral\n\n- Negative\n\n- Very Negative\n\n## Related Videos\n\n## RZLV Media Mentions By Week\n\n## RZLV Media Sentiment\n\nRZLV News Sentiment▼0.36\n\n0.66▲Average Business Services News Sentiment\n\n## RZLV News Coverage\n\nRZLV Articles This Week▼46\n\n7▲RZLV Articles Average Week\n\nEnter your email address to receive the latest news and analysts' ratings for Rezolve AI and its competitors.\n\n## Related Companies and Tools\n\n- BILL News\n\n- Clearwater Analytics News\n\n- Workiva News\n\n- Trump Media & Technology Group News\n\n- BOX News\n\n- Zeta Global News\n\n- Science Applications International News\n\n- OneStream News\n\n- Cellebrite DI News\n\n- Kingsoft Cloud News\n\n- Trending Media Mentions\n\n- High Media Sentiment Stocks\n\n- Live News Feed\n\n- MarketBeat Originals\n\n- Stock Ideas\n\nYou have already added ten stocks to your watchlist. Upgrade to MarketBeat All Access to add more stocks to your watchlist.\n\n## MarketBeat All Access Features\n\n### Best-in-Class Portfolio Monitoring\n\n- Get personalized stock ideas.\n\n- Compare portfolio to indices.\n\n- Check stock news, ratings, SEC filings, and more.\n\n### Stock Ideas and Recommendations\n\n- See daily stock ideas from top analysts.\n\n- Receive short-term trading ideas from MarketBeat.\n\n- Identify trending stocks on social media.\n\n### Advanced Stock Screeners and Research Tools\n\n- Use our seven stock screeners to find suitable stocks.\n\n- Stay informed with MarketBeat's real-time news.\n\n- Export data to Excel for personal analysis.\n\n- In-depth profiles and analysis for 20,000 public companies.\n\n- Real-time analyst ratings, insider transactions, earnings data, and more.\n\n- Our daily ratings and market update email newsletter.\n\n- Create Account",
      "source": "News Source",
      "date": "2025-10-09T14:29:58.210Z"
    },
    {
      "title": "Scientific consensus can strengthen pro-climate attitudes in society | ScienceDaily",
      "url": "https://www.sciencedaily.com/releases/2024/08/240826131219.htm?utm_source=valyu.ai&utm_medium=referral",
      "image_url": {
        "0": "https://www.sciencedaily.com/images/scidaily-icon.png"
      },
      "content": "Top Science News\n\nScience News from research organizations\n\n# Scientific consensus can strengthen pro-climate attitudes in society\n\n## A new study clearly shows how important it is to emphasize consensus among climate scientists\n\nDate: August 26, 2024 Source: University of Vienna Summary: Climate scientists have long agreed that humans are largely responsible for climate change. A new study finds that communicating the scientific consensus about climate change can clear up misperceptions and strengthen beliefs about the existence and the causes of climate change. The team surveyed over 10,000 people from 27 countries on 6 continents. Share: Facebook Twitter Pinterest LinkedIN Email\n\nFULL STORY Climate scientists have long agreed that humans are largely responsible for climate change. A new study, co-led by Bojana Ve?kalov from the University of Amsterdam and Sandra Geiger from the University of Vienna, finds that communicating the scientific consensus about climate change can clear up misperceptions and strengthen beliefs about the existence and the causes of climate change. The team surveyed over 10,000 people from 27 countries on 6 continents. The study has just been published in the journal Nature Human Behaviour. Scientific consensus identifying humans as primarily responsible for climate change is not new and was already forming in the 1980s. Today, 97% to 99.9% of climate scientists agree that climate change is happening and that human activity is the primary cause. Over the past decade, researchers have begun to study the effects of communicating this overwhelming consensus -- with promising results. So far, however, such studies have primarily been conducted in the United States. \"As is the case with many findings in behavioral science, we know little about the effects of communicating this consensus beyond the United States. Our study now takes an extensive and detailed look at these effects,\" says environmental psychologist Sandra Geiger from the University of Vienna. The international research team of 46 collaborators showed different scientific consensus messages to more than 10,500 people and subsequently asked them about their opinions on climate change. \"We observed that previous findings from the United States hold true in other parts of the world as well,\" explains co-lead author Bojana Većkalov from the University of Amsterdam. Across all 27 countries, people responded similarly to the scientific consensus on the existence and causes of climate change. Co-lead author Geiger further explains: \"Prior to reading about the consensus among climate scientists, people estimated this consensus to be much lower than it really is. In response to reading about it, they adjusted their own perceptions, believed more in climate change, and worried more about it -- but they did not support public action on climate change more.\" 88% of climate scientists additionally agree that climate change constitutes a crisis. How do people react when they learn about this additional crisis consensus? Interestingly, this added piece of information did not have any effects. Co-lead author Većkalovexplains: \"We believe that the gap between the actual and perceived consensus could have played a role. When it came to consensus on the existence and causes of climate change, respondents thought the scientific consensus was lower than it actually was, adjusted their estimate, and revised their beliefs. In the case of the crisis consensus, the respondents' estimate was substantially closer to the actual consensus, and this gap was likely not big enough to alter beliefs about climate change.\" These new findings show that it is important to continue emphasizing the consensus among climate scientists -- be it in the media or in our everyday lives when we have conversations about climate change and its impacts. \"Especially in the face of increasing politicization of science and misinformation about climate change, cultivating universal awareness of the scientific consensus will help protect public understanding of the issue,\" adds senior author Sander van der Linden from the University of Cambridge. \"Beyond climate change communication, these findings also underscore the importance of testing previous findings in behavioral science globally. Such endeavors are only possible if we bring together researchers worldwide,\" summarizes study co-lead Sandra Geiger.\n\n/col-md-8\n\n- [RELATED TOPICS](#) Earth & Climate Environmental Awareness Environmental Policy Geography Earth Science Science & Society Popular Culture Political Science World Development\n\n- [RELATED TERMS](#) Scientific misconduct Global warming controversy Attribution of recent climate change Antarctica IPCC Report on Climate Change - 2007 United Nations Development Programme Climate change mitigation Climate engineering\n\n/col-xs-6\n\n/row\n\n/col-md-4\n\n/row\n\n/story_source\n\n/related_multimedia\n\n**Journal Reference**:\n\n1. Bojana Većkalov, Sandra J. Geiger, František Bartoš, Mathew P. White, Bastiaan T. Rutjens, Frenk van Harreveld, Federica Stablum, Berkan Akın, Alaa Aldoh, Jinhao Bai, Frida Berglund, Aleša Bratina Zimic, Margaret Broyles, Andrea Catania, Airu Chen, Magdalena Chorzępa, Eman Farahat, Jakob Götz, Bat Hoter-Ishay, Gesine Jordan, Siri Joustra, Jonas Klingebiel, Živa Krajnc, Antonia Krug, Thomas Lind Andersen, Johanna Löloff, Divya Natarajan, Sasha Newman-Oktan, Elena Niehoff, Celeste Paerels, Rachel Papirmeister, Steven Peregrina, Felicia Pohl, Amanda Remsö, Abigail Roh, Binahayati Rusyidi, Justus Schmidt, Mariam Shavgulidze, Valentina Vellinho Nardin, Ruixiang Wang, Kelly Warner, Miranda Wattier, Chloe Y. Wong, Mariem Younssi, Kai Ruggeri, Sander van der Linden. **A 27-country test of communicating the scientific consensus on climate change**. *Nature Human Behaviour*, 2024; DOI: [10.1038/s41562-024-01928-2](http://dx.doi.org/10.1038/s41562-024-01928-2)\n\n/journal_references\n\n**Cite This Page**:\n\nNav tabs\n\n- [MLA](#citation_mla) - [APA](#citation_apa) - [Chicago](#citation_chicago)\n\nTab panes\n\nUniversity of Vienna. \"Scientific consensus can strengthen pro-climate attitudes in society.\" ScienceDaily. ScienceDaily, 26 August 2024. <www.sciencedaily.com/releases/2024/08/240826131219.htm>. University of Vienna. (2024, August 26). Scientific consensus can strengthen pro-climate attitudes in society. ScienceDaily. Retrieved October 8, 2025 from www.sciencedaily.com/releases/2024/08/240826131219.htm University of Vienna. \"Scientific consensus can strengthen pro-climate attitudes in society.\" ScienceDaily. www.sciencedaily.com/releases/2024/08/240826131219.htm (accessed October 8, 2025).\n\nend citations\n\n## Explore More\n\nfrom ScienceDaily\n\nRELATED STORIES\n\nHere's Something Americans Agree On: Sports Build Character Nov. 21, 2024 — In a polarized nation, there is one thing that nearly all Americans agree on, according to a recent study: sports are good for us. Researchers found that more than 9 out of 10 Americans agreed that ... What Was Behind the 2021-2022 Energy Crisis Within Europe? July 2, 2024 — A team of researchers had already been working with electricity price data for years before Russia's invasion of Ukraine, exploring statistics and developing forecasting methods. Now they zero ... Climate: Why Disinformation Is So Persistent Nov. 30, 2023 — Melting of glaciers, rising sea levels, extreme heat waves: the consequences of climate change are more visible than ever, and the scientific community has confirmed that humans are responsible. Yet ... Warning of the Need to Standardize the Beach Safety Signage System Oct. 31, 2022 — A study warns that safety flag systems differ even between beaches in close proximity to each other, and that this lack of uniformity may be due to an outdated legal framework and the absence of an ... People With Paranormal Beliefs Spooked by Science and the COVID-19 Vaccine, Sociologists Suggest Oct. 26, 2022 — Previous research has shown that people with conservative religious beliefs are more likely to lack confidence in the COVID-19 vaccine, but most studies have observed only mainstream or ... Is It Worth Trying to Sway the Most Staunch Climate Deniers? Oct. 30, 2021 — A researcher surveyed 645 Americans about their beliefs on climate change -- whether or not those beliefs are informed by fact or fiction -- to assess their communication behaviors about climate ... TRENDING AT SCITECHDAILY.com Scientists Catch Parkinson’s Protein Drilling Holes in Brain Cells Scientists “Supercharge” the Immune System To Stop Cancer From Coming Back Rogue Planet Feasting Faster Than Any World Ever Seen Dark Matter and Dark Energy Don’t Exist, New Study Claims",
      "source": "News Source",
      "date": "2025-10-09T14:29:58.210Z"
    },
    {
      "title": "Water News -- ScienceDaily",
      "url": "https://www.sciencedaily.com/news/earth_climate/water/?utm_source=valyu.ai&utm_medium=referral",
      "image_url": {
        "0": "https://www.sciencedaily.com/images/scidaily-icon.png"
      },
      "content": "Top Science News\n\n# Water News\n\nOctober 8, 2025\n\n## Top Headlines\n\nThe Red Sea That Vanished and the Catastrophic Flood That Brought It Back Oct. 8, 2025 — Researchers at KAUST have confirmed that the Red Sea once vanished entirely, turning into a barren salt desert before being suddenly flooded by waters from the Indian Ocean. The flood carved deep channels and restored marine life in less than ... Ocean Heatwaves Are Breaking Earth’s Hidden Climate Engine Oct. 7, 2025 — Marine heatwaves can jam the ocean’s natural carbon conveyor belt, preventing carbon from reaching the deep sea. Researchers studying two major heatwaves in the Gulf of Alaska found that plankton shifts caused carbon to build up near the surface ... From Gentle Giants to Ghostly Hunters, Sharks Face an Unseen Peril Oct. 5, 2025 — New research reveals that deep-sea mining could dramatically threaten 30 species of sharks, rays, and ghost sharks whose habitats overlap with proposed mining zones. Many of these species, already at risk of extinction, could face increased dangers ... Japan’s Hot Springs Hold Clues to the Origins of Life on Earth Oct. 3, 2025 — Billions of years ago, Earth’s atmosphere was hostile, with barely any oxygen and toxic conditions for life. Researchers from the Earth-Life Science Institute studied Japan’s iron-rich hot springs, which mimic the ancient oceans, to uncover how ... 1,000 Swiss Glaciers Already Gone, and the Melting Is Speeding Up Oct. 2, 2025 — Swiss glaciers lost nearly 3% of their volume in 2025, following a snow-poor winter and scorching summer heatwaves. The melt has been so extreme that some glaciers lost more than two meters of ice thickness in a single season. Scientists caution ... Tiny Stones Rewrite Earth’s Evolution Story Sep. 26, 2025 — Scientists have uncovered an unexpected witness to Earth’s distant past: tiny iron oxide stones called ooids. These mineral snowballs lock away traces of ancient carbon, revealing that oceans between 1,000 and 541 million years ago held far less ... Hidden “Electron Highways” Beneath Our Feet Could Revolutionize Pollution Cleanup Sep. 26, 2025 — Electrons flow underground in ways far more extensive than once believed, forming networks that link distant chemical zones. Minerals, organic molecules, and specialized bacteria can act as bridges, ... The Shocking Reason Arctic Rivers Are Turning Rusty Orange Sep. 22, 2025 — Researchers found that ice can trigger stronger chemical reactions than liquid water, dissolving iron minerals in extreme cold. Freeze-thaw cycles amplify the effect, releasing iron into rivers and soils. With climate change accelerating these ... Wildfire Smoke Could Kill 70,000 Americans a Year by 2050 Sep. 19, 2025 — Wildfires are no longer a seasonal nuisance but a deadly, nationwide health crisis. Fueled by climate change, smoke is spreading farther and lingering longer, with new research warning of tens of thousands of additional deaths annually by ... Scientists Stunned by Salt Giants Forming Beneath the Dead Sea Sep. 18, 2025 — The Dead Sea isn’t just the saltiest body of water on Earth—it’s a living laboratory for the formation of giant underground salt deposits. Researchers are unraveling how evaporation, temperature shifts, and unusual mixing patterns lead to ... Why Alaska’s Salmon Streams Are Suddenly Bleeding Orange Sep. 18, 2025 — Warming Arctic permafrost is unlocking toxic metals, turning Alaska’s once-clear rivers into orange, acid-laced streams. The shift, eerily similar to mine pollution but entirely natural, threatens fish, ecosystems, and communities that depend on ... Toxic “Forever Chemicals” Found in 95% of Beers Tested in the U.S. Sep. 12, 2025 — Forever chemicals known as PFAS have turned up in an unexpected place: beer. Researchers tested 23 different beers from across the U.S. and found that 95% contained PFAS, with the highest concentrations showing up in regions with known water ...\n\n## Latest Headlines\n\nupdated 11:43am EDT\n\nEarthquakes Release Blistering Heat That Can Melt Rock in an Instant Sep. 19, 2025 — MIT scientists have unraveled the hidden energy balance of earthquakes by recreating them in the lab. Their findings show that while only a sliver of energy goes into the shaking we feel on the ... Scientists Finally Solve the Mystery of Ghostly Halos on the Ocean Floor Sep. 10, 2025 — Barrels dumped off Southern California decades ago have been found leaking alkaline waste, not just DDT, leaving behind eerie white halos and transforming parts of the seafloor into toxic vents. The ... The Invisible Plastic Threat You Can Finally See Sep. 10, 2025 — Researchers in Germany and Australia have created a simple but powerful tool to detect nanoplastics—tiny, invisible particles that can slip through skin and even the blood-brain barrier. Using an ... Hungry Flathead Catfish Are Changing Everything in the Susquehanna Sep. 9, 2025 — Flathead catfish are rapidly reshaping the Susquehanna River’s ecosystem. Once introduced, these voracious predators climbed to the top of the food chain, forcing native fish like channel catfish ... The Ocean’s Most Abundant Microbe Is Near Its Breaking Point Sep. 9, 2025 — Tiny ocean microbes called Prochlorococcus, once thought to be climate survivors, may struggle as seas warm. These cyanobacteria drive 5% of Earth’s photosynthesis and underpin much of the marine ... Antarctica’s Frozen Heart Is Warming Fast, and Models Missed It Sep. 9, 2025 — New research has revealed that East Antarctica’s vast and icy interior is heating up faster than its coasts, fueled by warm air carried from the Southern Indian Ocean. Using 30 years of weather ... Scientists Finally Crack the Mystery of Rogue Waves Sep. 8, 2025 — Once thought to be sailors’ myths, rogue waves gained credibility after a towering 80-foot wall of water struck the Draupner oil platform in 1995. New research shows that these extreme waves ... Satellites Confirm 1990s Sea-Level Predictions Were Shockingly Accurate Sep. 6, 2025 — Satellite data reveals sea-level rise has unfolded almost exactly as predicted by 1990s climate models, with one key underestimation: melting ice sheets. Researchers stress the importance of refining ... Oceans Could Reach a Dangerous Tipping Point by 2050 Sep. 5, 2025 — UC Santa Barbara researchers project that human impacts on oceans will double by 2050, with warming seas and fisheries collapse leading the charge. The tropics and poles face the fastest changes, and ... Even the Toughest Corals Are Shrinking in Warming Seas Sep. 5, 2025 — Scientists found that Red Sea corals can endure warming seas but grow much smaller and weaken under long-term heat stress. Though recovery is possible in cooler months, rising global temperatures may ...\n\n- [Earthquakes Release Blistering Heat](https://www.sciencedaily.com/releases/2025/09/250918225010.htm) - [Scientists Solve the Mystery of Ghostly Halos](https://www.sciencedaily.com/releases/2025/09/250910000244.htm) - [The Invisible Plastic Threat You Can Finally See](https://www.sciencedaily.com/releases/2025/09/250910000240.htm) - [Flathead Catfish Take Over the Susquehanna](https://www.sciencedaily.com/releases/2025/09/250909031516.htm) - [The Ocean’s Most Abundant Microbe Faces ...](https://www.sciencedaily.com/releases/2025/09/250909031505.htm) - [Antarctica’s Frozen Heart Is Warming Fast](https://www.sciencedaily.com/releases/2025/09/250909031503.htm) - [Scientists Crack the Mystery of Rogue Waves](https://www.sciencedaily.com/releases/2025/09/250907172647.htm) - [1990s Sea-Level Predictions Shockingly Accurate](https://www.sciencedaily.com/releases/2025/09/250906013453.htm) - [Oceans Near Breaking Point by 2050](https://www.sciencedaily.com/releases/2025/09/250905180728.htm) - [Even the Toughest Corals Are Shrinking](https://www.sciencedaily.com/releases/2025/09/250905112308.htm)\n\n/Top Science News\n\n## Earlier Headlines\n\n- [Summaries](#summaries) - [Headlines](#headlines)\n\nCentral Asia’s Last Stable Glaciers Just Started to Collapse Sep. 3, 2025 — Snowfall shortages are now destabilizing some of the world’s last resilient glaciers, as shown by a new study in Tajikistan’s Pamir Mountains. Using a monitoring station on Kyzylsu Glacier, ... Scientists Fear the Atlantic’s Great Ocean Conveyor Could Shut Down Sep. 1, 2025 — A new study projects that the Atlantic Meridional Overturning Circulation (AMOC)—the system of currents that includes the Gulf Stream—could shut down after 2100 under high-emission scenarios. ... A Monster Seaweed Bloom Is Taking Over the Atlantic Sep. 1, 2025 — Sargassum has escaped the Sargasso Sea and exploded across the Atlantic, forming the massive Great Atlantic Sargassum Belt. Fueled by nutrient runoff, Amazon outflows, and climate events, these ... Sharks’ Teeth Are Crumbling in Acid Seas Aug. 27, 2025 — Even sharks’ famous tooth-regrowing ability may not save them from ocean acidification. Researchers found that future acidic waters cause shark teeth to corrode, crack, and weaken, threatening ... The Ancient Oxygen Flood That Forever Changed Life in the Oceans Aug. 27, 2025 — Ancient forests may have fueled a deep-sea oxygen boost nearly 390 million years ago, unlocking evolutionary opportunities for jawed fish and larger marine animals. New isotopic evidence shows that ... Scientists Found a New Way to Turn Sunlight Into Fuel Aug. 26, 2025 — A research team created a plant-inspired molecule that can store four charges using sunlight, a key step toward artificial photosynthesis. Unlike past attempts, it works with dimmer light, edging ... Geologists Got It Wrong: Rivers Didn’t Need Plants to Meander Aug. 31, 2025 — Stanford researchers reveal meandering rivers existed long before plants, overturning textbook geology. Their findings suggest carbon-rich floodplains shaped climate for billions of ... Ozone Recovery Could Trigger 40% More Global Warming Than Predicted Aug. 22, 2025 — As the ozone layer recovers, it’s also intensifying global warming. Researchers predict that by 2050, ozone will rank just behind carbon dioxide as a driver of heating, offsetting many of the ... Protected Seas Help Kelp Forests Bounce Back from Heatwaves Aug. 20, 2025 — Kelp forests bounce back faster from marine heatwaves when shielded inside Marine Protected Areas. UCLA researchers found that fishing restrictions and predator protection strengthen ecosystem ... Scientists Reveal How Just Two Human Decisions Rewired the Great Salt Lake Forever Aug. 19, 2025 — Scientists found that Great Salt Lake’s chemistry and water balance were stable for thousands of years, until human settlement. Irrigation and farming in the 1800s and a railroad causeway in 1959 ... Scientists Just Found a Hidden Factor Behind Earth’s Methane Surge Aug. 17, 2025 — Roughly two-thirds of all atmospheric methane, a potent greenhouse gas, comes from methanogens. Tracking down which methanogens in which environment produce methane with a specific isotope signature ... Mexican Cave Stalagmites Reveal the Deadly Droughts Behind the Maya Collapse Aug. 16, 2025 — Chemical evidence from a stalagmite in Mexico has revealed that the Classic Maya civilization’s decline coincided with repeated severe wet-season droughts, including one that lasted 13 years. These ... Scientists Turn Grapevine Waste Into Clear, Strong Films That Vanish in Days Aug. 13, 2025 — Amid growing concerns over plastic waste and microplastics, researchers are turning agricultural leftovers into biodegradable packaging. Using cellulose extracted from unlikely sources, including ... Scientists Just Measured How Fast Glaciers Carve the Earth Aug. 9, 2025 — Scientists used machine learning to reveal how glaciers erode the land at varying speeds, shaped by climate, geology, and heat. The findings help guide global planning from environmental management ... This Prehistoric Predator Survived Global Warming by Eating Bones Aug. 6, 2025 — A prehistoric predator changed its diet and body size during a major warming event 56 million years ago, revealing how climate change can reshape animal behavior, food chains, and survival ... The Hidden Climate Battle Between Forests and the Ocean Aug. 2, 2025 — Between 2003 and 2021, Earth saw a net boost in photosynthesis, mainly thanks to land plants thriving in warming, wetter conditions—especially in temperate and high-latitude regions. Meanwhile, ... Digital Twins Are Reinventing Clean Energy — but There’s a Catch July 29, 2025 — Researchers are exploring AI-powered digital twins as a game-changing tool to accelerate the clean energy transition. These digital models simulate and optimize real-world energy systems like wind, ... Deep-Sea Fish Just Changed What We Know About Earth’s Carbon Cycle July 27, 2025 — Mesopelagic fish, long overlooked in ocean chemistry, are now proven to excrete carbonate minerals much like their shallow-water counterparts—despite living in dark, high-pressure depths. Using the ... Satellites Just Revealed a Hidden Global Water Crisis—and It’s Worse Than Melting Ice July 27, 2025 — For over two decades, satellites have quietly documented a major crisis unfolding beneath our feet: Earth's continents are drying out at unprecedented rates. Fueled by climate change, ... Is the Air You Breathe Silently Fueling Dementia? A 29-Million-Person Study Says Yes July 27, 2025 — Air pollution isn't just bad for your lungs—it may be eroding your brain. In a sweeping review covering nearly 30 million people, researchers found that common pollutants like PM2.5, nitrogen ...\n\nend summaries tab\n\n### Wednesday, September 3, 2025\n\n- [Central Asia’s Last Stable Glaciers Just Started to Collapse](https://www.sciencedaily.com/releases/2025/09/250902085147.htm)\n\n### Monday, September 1, 2025\n\n- [Scientists Fear the Atlantic’s Great Ocean Conveyor Could Shut Down](https://www.sciencedaily.com/releases/2025/08/250830001201.htm) - [A Monster Seaweed Bloom Is Taking Over the Atlantic](https://www.sciencedaily.com/releases/2025/08/250830001159.htm)\n\n### Wednesday, August 27, 2025\n\n- [Sharks’ Teeth Are Crumbling in Acid Seas](https://www.sciencedaily.com/releases/2025/08/250827010714.htm) - [The Ancient Oxygen Flood That Forever Changed Life in the Oceans](https://www.sciencedaily.com/releases/2025/08/250827010726.htm)\n\n### Tuesday, August 26, 2025\n\n- [Scientists Found a New Way to Turn Sunlight Into Fuel](https://www.sciencedaily.com/releases/2025/08/250826005230.htm)\n\n### Sunday, August 31, 2025\n\n- [Geologists Got It Wrong: Rivers Didn’t Need Plants to Meander](https://www.sciencedaily.com/releases/2025/08/250831010533.htm)\n\n### Friday, August 22, 2025\n\n- [Ozone Recovery Could Trigger 40% More Global Warming Than Predicted](https://www.sciencedaily.com/releases/2025/08/250821094527.htm)\n\n### Wednesday, August 20, 2025\n\n- [Protected Seas Help Kelp Forests Bounce Back from Heatwaves](https://www.sciencedaily.com/releases/2025/08/250820000805.htm)\n\n### Tuesday, August 19, 2025\n\n- [Scientists Reveal How Just Two Human Decisions Rewired the Great Salt Lake Forever](https://www.sciencedaily.com/releases/2025/08/250818102953.htm)\n\n### Sunday, August 17, 2025\n\n- [Scientists Just Found a Hidden Factor Behind Earth’s Methane Surge](https://www.sciencedaily.com/releases/2025/08/250816113528.htm)\n\n### Saturday, August 16, 2025\n\n- [Mexican Cave Stalagmites Reveal the Deadly Droughts Behind the Maya Collapse](https://www.sciencedaily.com/releases/2025/08/250814094654.htm)\n\n### Wednesday, August 13, 2025\n\n- [Scientists Turn Grapevine Waste Into Clear, Strong Films That Vanish in Days](https://www.sciencedaily.com/releases/2025/08/250812234523.htm)\n\n### Saturday, August 9, 2025\n\n- [Scientists Just Measured How Fast Glaciers Carve the Earth](https://www.sciencedaily.com/releases/2025/08/250809100914.htm)\n\n### Wednesday, August 6, 2025\n\n- [This Prehistoric Predator Survived Global Warming by Eating Bones](https://www.sciencedaily.com/releases/2025/08/250806094118.htm)\n\n### Saturday, August 2, 2025\n\n- [The Hidden Climate Battle Between Forests and the Ocean](https://www.sciencedaily.com/releases/2025/08/250802022926.htm)\n\n### Tuesday, July 29, 2025\n\n- [Digital Twins Are Reinventing Clean Energy — but There’s a Catch](https://www.sciencedaily.com/releases/2025/07/250729001217.htm)\n\n### Sunday, July 27, 2025\n\n- [Deep-Sea Fish Just Changed What We Know About Earth’s Carbon Cycle](https://www.sciencedaily.com/releases/2025/07/250726234426.htm) - [Satellites Just Revealed a Hidden Global Water Crisis—and It’s Worse Than Melting Ice](https://www.sciencedaily.com/releases/2025/07/250726234415.htm) - [Is the Air You Breathe Silently Fueling Dementia? A 29-Million-Person Study Says Yes](https://www.sciencedaily.com/releases/2025/07/250726234404.htm)\n\n### Saturday, July 26, 2025\n\n- [The Oceans Are Overheating—and Scientists Say a Climate Tipping Point May Be Here](https://www.sciencedaily.com/releases/2025/07/250724232417.htm)\n\n### Thursday, July 24, 2025\n\n- [This Plastic Disappears in the Deep Sea—and Microbes Make It Happen](https://www.sciencedaily.com/releases/2025/07/250724232418.htm)\n\n### Saturday, August 9, 2025\n\n- [332 Colossal Canyons Just Revealed Beneath Antarctica’s Ice](https://www.sciencedaily.com/releases/2025/08/250809100910.htm)\n\n### Wednesday, July 23, 2025\n\n- [Snowless Winter? Arctic Field Team Finds Flowers and Meltwater Instead](https://www.sciencedaily.com/releases/2025/07/250722035658.htm)\n\n### Monday, July 21, 2025\n\n- [This Genetic Breakthrough Could Help Thousands of Species Cheat Extinction](https://www.sciencedaily.com/releases/2025/07/250720034017.htm)\n\n### Tuesday, July 29, 2025\n\n- [Drones Reveal 41,000-Turtle Nesting Mega-Site Hidden in the Amazon](https://www.sciencedaily.com/releases/2025/07/250729231241.htm)\n\n### Saturday, July 19, 2025\n\n- [18x More Floods, 105% Bigger Storms — All from a Single Clear-Cut](https://www.sciencedaily.com/releases/2025/07/250718031220.htm)\n\n### Wednesday, July 16, 2025\n\n- [Frozen for 12,000 Years, This Alpine Ice Core Captures the Rise of Civilization](https://www.sciencedaily.com/releases/2025/07/250716000858.htm) - [They Fled the Flames—now Jaguars Rule a Wetland Refuge](https://www.sciencedaily.com/releases/2025/07/250716000849.htm) - [Corals in Crisis: A Hidden Chemical Shift Is Reshaping Hawaiian Reefs](https://www.sciencedaily.com/releases/2025/07/250716000851.htm) - [25 Years, 1 Coastline Report Card: The Shocking Wins and Misses](https://www.sciencedaily.com/releases/2025/07/250715043405.htm)\n\n### Tuesday, July 22, 2025\n\n- [What Radar Found Beneath Antarctica Could Slow Ice Melt and Rising Seas](https://www.sciencedaily.com/releases/2025/07/250721223835.htm)\n\n### Monday, July 21, 2025\n\n- [Scientists Just Solved the Mystery of the Missing Ocean Plastic—now We’re All in Trouble](https://www.sciencedaily.com/releases/2025/07/250721223827.htm)\n\n### Thursday, July 10, 2025\n\n- [Lasers Capture the Invisible Dance of Wind and Waves](https://www.sciencedaily.com/releases/2025/07/250709091656.htm)\n\n### Sunday, August 31, 2025\n\n- [Scientists Stunned as Strange Islands and Hidden Springs Appear in the Great Salt Lake](https://www.sciencedaily.com/releases/2025/08/250831010526.htm)\n\n### Tuesday, July 8, 2025\n\n- [Melting Glaciers Are Awakening Earth's Most Dangerous Volcanoes](https://www.sciencedaily.com/releases/2025/07/250708045654.htm)\n\n### Saturday, July 5, 2025\n\n- [Scientists Thought the Arctic Was Sealed in Ice — They Were Wrong](https://www.sciencedaily.com/releases/2025/07/250704235554.htm)\n\n### Monday, July 7, 2025\n\n- [Antarctica’s Slow Collapse Caught on Camera—and It’s Accelerating](https://www.sciencedaily.com/releases/2025/07/250706230305.htm)\n\n### Thursday, July 3, 2025\n\n- [Rainforest Deaths Are Surging and Scientists Just Found the Shocking Cause](https://www.sciencedaily.com/releases/2025/07/250703092609.htm) - [Even Low Levels of Air Pollution May Quietly Scar Your Heart, MRI Study Finds](https://www.sciencedaily.com/releases/2025/07/250703092606.htm)\n\n### Wednesday, July 2, 2025\n\n- [Antarctica’s Ocean Flip: Satellites Catch Sudden Salt Surge Melting Ice from Below](https://www.sciencedaily.com/releases/2025/07/250701020711.htm)\n\n### Saturday, June 28, 2025\n\n- [New Orleans Is Sinking—and So Are Its $15 Billion Flood Defenses](https://www.sciencedaily.com/releases/2025/06/250627234122.htm)\n\n### Friday, June 27, 2025\n\n- [Tiny Creatures, Massive Impact: How Zooplankton Store 65 Million Tonnes of Carbon Annually](https://www.sciencedaily.com/releases/2025/06/250627021851.htm)\n\n### Monday, June 30, 2025\n\n- [Fighting Fire With Fire: How Prescribed Burns Reduce Wildfire Damage and Pollution](https://www.sciencedaily.com/releases/2025/06/250629033445.htm)\n\n### Friday, June 27, 2025\n\n- [This Breakthrough Turns Old Tech Into Pure Gold — No Mercury, No Cyanide, Just Light and Salt](https://www.sciencedaily.com/releases/2025/06/250626081540.htm)\n\n### Thursday, June 26, 2025\n\n- [Can These Endangered Lizards Beat the Heat? Scientists Test Bold Relocation Plan](https://www.sciencedaily.com/releases/2025/06/250626081530.htm)\n\n### Tuesday, June 24, 2025\n\n- [Wildfires Threaten Water Quality for Up to Eight Years After They Burn](https://www.sciencedaily.com/releases/2025/06/250624044332.htm) - [Ancient Carbon ‘burps’ Caused Ocean Oxygen Crashes — and We’re Repeating the Mistake](https://www.sciencedaily.com/releases/2025/06/250624044326.htm)\n\n### Friday, June 20, 2025\n\n- [Scientists Create Living Building Material That Captures CO₂ from the Air](https://www.sciencedaily.com/releases/2025/06/250620231906.htm) - [The Atlantic's Chilling Secret: A Century of Data Reveals Ocean Current Collapse](https://www.sciencedaily.com/releases/2025/06/250620222140.htm) - [Flash Floods in the Alps: How Climate Change Is Supercharging Summer Storms](https://www.sciencedaily.com/releases/2025/06/250620031102.htm)\n\n### Friday, June 27, 2025\n\n- [Only 3 Years Left: The Carbon Budget for 1.5°C Is Almost Gone](https://www.sciencedaily.com/releases/2025/06/250627021853.htm)\n\n### Thursday, June 19, 2025\n\n- [The AI That Writes Climate-Friendly Cement Recipes in Seconds](https://www.sciencedaily.com/releases/2025/06/250619035502.htm)\n\n### Wednesday, June 18, 2025\n\n- [Winter Sea Ice Supercharges Southern Ocean’s CO2 Uptake](https://www.sciencedaily.com/releases/2025/06/250618094450.htm)\n\n### Saturday, June 14, 2025\n\n- [Scientists Reveal the Hidden Trigger Behind Massive Floods](https://www.sciencedaily.com/releases/2025/06/250614121958.htm)\n\n### Friday, June 13, 2025\n\n- [Toxic Tides: Centuries-Old Mercury Is Flooding the Arctic Food Chain](https://www.sciencedaily.com/releases/2025/06/250613013926.htm)\n\n### Thursday, June 12, 2025\n\n- [Something More Toxic Than Gators Is Hiding in the Swamps](https://www.sciencedaily.com/releases/2025/06/250612031558.htm)\n\n### Friday, June 13, 2025\n\n- [New MIT Study Reveals How Biofilms Help Stop Microplastic Build-Up](https://www.sciencedaily.com/releases/2025/06/250613013823.htm)\n\n### Thursday, August 14, 2025\n\n- [Unprecedented Climate Shocks Are Changing the Great Lakes Forever](https://www.sciencedaily.com/releases/2025/08/250813083616.htm)\n\n### Thursday, June 12, 2025\n\n- [Rivers Are Exhaling Ancient Carbon — and Climate Math Just Changed](https://www.sciencedaily.com/releases/2025/06/250612092543.htm)\n\n### Tuesday, June 3, 2025\n\n- [Collaboration Can Unlock Australia's Energy Transition Without Sacrificing Natural Capital](https://www.sciencedaily.com/releases/2025/06/250603172908.htm) - [Molecular Link Between Air Pollution and Pregnancy Risks](https://www.sciencedaily.com/releases/2025/06/250603141202.htm) - [First Direct Observation of the Trapped Waves That Shook the World in 2023](https://www.sciencedaily.com/releases/2025/06/250603115015.htm) - [DNA Floating in the Air Tracks Wildlife, Viruses -- Even Drugs](https://www.sciencedaily.com/releases/2025/06/250603114822.htm)\n\n### Monday, June 2, 2025\n\n- [Coastal Flooding More Frequent Than Previously Thought](https://www.sciencedaily.com/releases/2025/06/250602155338.htm) - [Researchers Use Deep Learning to Predict Flooding This Hurricane Season](https://www.sciencedaily.com/releases/2025/06/250602154901.htm) - [Human-Caused Dust Events Are Linked to Fallow Farmland](https://www.sciencedaily.com/releases/2025/06/250602154722.htm) - [Research Shows How Solar Arrays Can Aid Grasslands During Drought](https://www.sciencedaily.com/releases/2025/06/250602154719.htm) - [Air-Quality Monitoring Underestimates Toxic Emissions to Salton Sea Communities, Study Finds](https://www.sciencedaily.com/releases/2025/06/250602154610.htm)\n\n### Friday, May 30, 2025\n\n- [Small Currents, Big Impact: Satellite Breakthrough Reveals Hidden Ocean Forces](https://www.sciencedaily.com/releases/2025/05/250530123950.htm) - [Rising Soil Nitrous Acid Emissions, Driven by Climate Change and Fertilization, Accelerate Global Ozone Pollution](https://www.sciencedaily.com/releases/2025/05/250530123821.",
      "source": "News Source",
      "date": "2025-10-09T14:29:58.210Z"
    },
    {
      "title": "2014 in science",
      "url": "https://en.wikipedia.org/wiki/2014%20in%20science?utm_source=valyu.ai&utm_medium=referral",
      "image_url": {},
      "content": "Iranian scientists at Gilan University created self-cleaning coatings for the textile factories and in construction verified surfaces.\n13 March – Researchers in Siberia state that they have access to good quality DNA that offers a \"high chance\" of cloning the woolly mammoth.\n17 March\nBy demonstrating rippling patterns (the possible effect of gravitational waves) in the cosmic microwave background, astronomers may have uncovered a major piece of evidence to support inflation and the Big Bang theory of the universe. However, on 19 June 2014, lowered confidence in confirming the findings was reported; and on 19 September 2014, even more lowered confidence.\nA large, previously stable part of Greenland has been found to be melting rapidly, suggesting that future sea level estimates will have to be revised upwards.\nSpecimens of the moss Chorisodontium aciphyllum are revived after 1500 years frozen.\n19 March – A new record efficiency of 17 percent for thin-film solar is achieved.\n20 March – A new method to obtain human-induced pluripotent stem cells (hiPSCs) from a single drop of finger-pricked blood is achieved.\n23 March – Scientists demonstrate the distribution of three entangled photons at three different locations, several hundreds of metres apart. This could pave the way to multi-party quantum communication.\n24 March\nResearchers create a biodegradable battery that could be used for medical implants inside the body.\nRates of blindness and partial sight have plummeted in the developed world over the last 20 years, according to new research.\n25 March – Paleontologists assemble giant turtle bone from fossil discoveries made 160 years apart. Atlantochelys mortoni, found in Cretaceous sediments dating back 75 million years, was possibly the largest turtle that ever lived.\n26 March\nAstronomers report the discovery of a new minor planet, named 2012 VP113, beyond the planet Neptune in the Solar System.\nAstronomers report the discovery of the first ring system around an asteroid (10199 Chariklo).\n27 March\nThe first synthetic chromosome is created for integration into a yeast cell.\nA study finds that Cuvier's beaked whale is capable of diving to a depth of 3.2 km and staying under water for 137 minutes, both records for a mammal.\n\n30 March – The first evidence that CRISPR can reverse disease symptoms in living animals has been demonstrated. Using this new gene-editing technique, MIT researchers cured mice of a rare liver disorder.\n31 March\nThe U.N. Intergovernmental Panel on Climate Change (IPCC) releases its second of four planned reports examining the state of climate science. This latest document summarizes what the scientific literature says about \"Impacts, Adaptation, and Vulnerability\".\nIn the landmark case of Australia v. Japan, the International Court of Justice (ICJ) in The Hague has ruled that Japan's JARPA II whaling program in the Antarctic is not for scientific purposes and has ordered all permits to be revoked.\n\nApril\n1 April\nEating seven or more portions (560 g) of fruit and vegetables a day reduces your risk of death at any point in time by 42 percent compared to eating less than one portion, reports a new study by University College London. \nRIKEN concludes that a recent study claiming to having produced stem cells via STAP techniques was partially falsified.\n3 April – NASA reports that evidence for a large underground ocean of liquid water on Enceladus, moon of planet Saturn, has been found by the Cassini. According to the scientists, evidence of an underground ocean suggests that Enceladus is one of the most likely places in the Solar System to \"host microbial life\". (artist image)\n4 April – By manipulating the appropriate signaling, researchers have turned embryonic stem cells into a fish embryo, essentially controlling embryonic development. This breakthrough is a major step toward being able to grow whole organs from stem cells.\n6 April – Samsung has developed a new method of growing large area, single crystal wafer scale graphene, a major development that will accelerate the commercialization of this material.\n\n7 April\nA critical bug (named \"Heartbleed\") in OpenSSL is estimated to have left 17% of the Internet's secure web servers vulnerable to data theft.\nResearchers show the first evidence that green tea extract enhances cognitive functions, especially the working memory, suggesting a possible treatment for impairments such as dementia.\n8 April – A battery that can charge in under 30 seconds is demonstrated at a technology conference in Tel Aviv.\n9 April – Scientists reconstruct a gigantic asteroid impact that occurred 3.26 billion years ago near the Barberton Greenstone Belt. The impactor was up to 58 km (36 miles) wide, leaving a hole almost 480 km (300 miles) across – two and a half times larger in diameter than the Chicxulub crater which killed off the dinosaurs.\n10 April\nNASA scientists report the possible discovery of the first exomoon candidate. (artist image)\nNASA astronomers report that the Hubble Space Telescope can now precisely measure distances up to 10,000 light-years away by using spatial scanning, a ten-fold improvement over earlier measurements. (related image)",
      "source": "News Source",
      "date": "2025-10-09T14:29:58.210Z"
    },
    {
      "title": "2012 in science",
      "url": "https://en.wikipedia.org/wiki/2012%20in%20science?utm_source=valyu.ai&utm_medium=referral",
      "image_url": {},
      "content": "20 November\n NASA scientists report (via an NPR interview) that the Curiosity Mars rover, apparently based on a SAM analysis, has provided, according to John Grotzinger (MSL Principal Investigator), \"data that is gonna be one for the history books.  It's looking really good.\"  Later, a NASA spokesperson said the discovery \"won't be earthshaking, but it will be interesting.\" Nonetheless, the scientists are presently verifying their results and expect to make an official announcement at the fall meeting of the American Geophysical Union, which will take place between 3 December and 7 December in San Francisco, according to Grotzinger in an interview with Space.com. The news is later played down by NASA. (NPR) (Universe Today) (Time) (Space.com) (New York Times)\n More than 1,000 coal-fired power plants are being planned worldwide, new research from the World Resources Institute has revealed, with the majority being constructed in China and India. (The Guardian) (WRI)\n The level of greenhouse gases in the atmosphere reached 390.9 parts per million in 2011, a new record high, according to the World Meteorological Organization. Between 1990 and 2011, there was a 30% increase in radiative forcing. (WMO) (Report)\n Physicists have shown that synthetic membrane channels can be constructed through \"DNA nanotechnology.\" (Science Daily) \n Scientists have developed a computer chip that mimics a dog's nose. It is capable of rapidly identifying trace amounts of vapour molecules, providing continuous real-time monitoring at concentrations of just 1 part per billion (ppb). (UCSB) \n 21 November\n For the first time, encrypted quantum signals are successfully sent down a conventional broadband fiber, instead of requiring a dedicated individual cable. This development could allow quantum cryptography, which offers near-impenetrable data security, to become available to the general public. (BBC) \n The effects of climate change are already evident in Europe and the situation is set to get worse, the European Environment Agency has warned. (BBC) (EEA)\n A United Nations report – the Emissions Gap Report 2012 – says global attempts to limit CO2 emissions are falling well short of what is needed to stem dangerous climate change. (BBC)\n For the first time, scientists at Fred Hutchinson Cancer Research Center have defined key events that take place early in the process of cellular aging. They have shown that the acidity of the vacuole is critical to aging and the stable functioning of mitochondria. (FHCRC) \n The printing of 3D tissue has taken a major step forward with the creation of a novel hybrid printer that simplifies the process of creating implantable cartilage. (IOP) \n European Space Agency (ESA) member states agree at their ministerial council to a 10.1-billion-euro programme of activities, including a planned upgrade to the Ariane 5 rocket. (BBC) (ESA)\n 23 November\n Footprints believed to have been made by the giant flightless bird Diatryma indicate that it was a \"gentle herbivore\" and not a fierce carnivore, scientists say. (BBC) \n Having a job with poor working conditions can be just as bad for a person's mental health as being unemployed, according to new research published in Psychological Medicine. (MachinesLikeUs) \n 25 November\n A Chinese Shenyang J-15 jet fighter conducts the first landing on the country's first aircraft carrier, the Liaoning. This milestone marks a major step forward in China's efforts to increase its naval power. (BBC)\n Pathological changes typical of Alzheimer's disease have been significantly reduced in mice by blockade of an immune system transmitter. (Science Daily)\n\n26 November\n A Norwegian liquid natural gas tanker becomes the first ship of its size to attempt a winter crossing of the Arctic. As Arctic ice cover reduces due to climate change, the Arctic sea route may become increasingly viable for large ships. (BBC)\n Researchers, including NASA scientists and engineers from Los Alamos National Laboratory, have demonstrated a new concept for a reliable nuclear reactor that could be used on space flights. The Demonstration Using Flattop Fissions (DUFF) experiment produced 24 watts of electricity. (Los Alamos National Laboratory)\n 27 November\n Permafrost covering almost a quarter of the Northern Hemisphere contains 1.7 trillion tonnes of carbon, twice that currently in the atmosphere, and could significantly amplify global warming should thawing accelerate as expected, according to a new report released today by the United Nations Environment Programme (UNEP). (UNEP)\n A review reveals that grapefruit drug interactions affects even more than previously though, with the list of drugs with potentially serious interactions more than doubling since 2012. Users of heart medication are particularly vulnerable. (CBC) \n 28 November\n The Reaction Engines Skylon spaceplane project achieves a key engine design milestone. (BBC)\n Astronomers observe a penumbral lunar eclipse. (Los Angeles Times)\n Previous estimates of sea level rise have been underestimated, while estimates of global temperature rises appear to be accurate, according to a new study published in the journal Environmental Research Letters. (PIK) \n A completely new method of manufacturing the smallest structures in electronics could make their manufacture thousands of times quicker, allowing for cheaper semiconductors. The findings have been published in the latest issue of Nature. (Science Daily) \n Scientists have achieved a major breakthrough in deciphering bread wheat's genetic code. This could lead to new varieties that are more productive and better able to cope with disease, drought and other stresses that cause crop losses. (Science Daily) \n American engineers build a 3D printer capable of manufacturing tools from lunar regolith, potentially allowing future astronauts to manufacture equipment on-site using lunar or Martian rock. (CNET) (WSU)\n Vanderbilt University engineers develop a lightweight powered exoskeleton, which technology company Parker Hannifin plans to release commercially for paraplegia sufferers in 2014. (Co.Exist)\n\n29 November\n Scientists discover the second-largest supermassive black hole ever detected, with a mass 17 billion times that of the Sun. However, the black hole resides in an anomalously small galaxy. (BBC) (Universe Today) \n NASA reports that its MESSENGER probe has discovered water ice and organic compounds on the surface of Mercury. (Reuters) (New York Times)   \n Experts have combined data from multiple satellites and aircraft to produce the most comprehensive and accurate assessment to date of ice sheet losses in Greenland and Antarctica and their contributions to sea level rise. Ice sheet loss at both poles is increasing, the study finds. (NASA) \n A study published in Nature states that human genetic variation has accelerated rapidly in recent centuries, faster than natural selection can operate. (Wired) \n 30 November\n British scientists develop a method of safely cultivating medicinal stem cells from the blood of adult patients, potentially allowing each patient to have a personalised source of stem cells. (Science Codex) \n Italian scientists publish the first direct images of DNA, which were produced using a scanning electron microscope. The images provide photographic proof of DNA's double-helix structure, and could further scientific understanding of the compound's function. \n At the Euromold trade show in Germany, manufacturers display numerous advances in commercial 3D printing technology, including a device that can rapidly print an entire bicycle. (Wired)\n MIT researchers develop a protein-inspired modular robot capable of magnetically folding itself into a wide variety of shapes, potentially heralding future devices that can reconfigure themselves for nearly any purpose. (Science Daily) (BBC)",
      "source": "News Source",
      "date": "2025-10-09T14:29:58.210Z"
    },
    {
      "title": "Gulf Stream drives Kuroshio behind the recent abnormal ocean warming",
      "url": "https://arxiv.org/abs/2503.01117?utm_source=valyu.ai&utm_medium=referral",
      "image_url": {},
      "content": "- 1. WMO confirms that 2023 smashes global temperature record. *World Meteorological Organization* https://wmo.int/news/media-centre/wmo-confirms-2023-smashesglobal-temperature-record (2024).\n- 2. WMO confirms 2024 as warmest year on record at about 1.55°C above pre-industrial level. *World Meteorological Organization* https://wmo.int/news/media-centre/wmoconfirms-2024-warmest-year-record-about-155degc-above-pre-industrial-level (2025).\n- 3. Esper, J., Torbenson, M. & Büntgen, U. 2023 summer warmth unparalleled over the past 2,000 years. *Nature* **631**, 94–97 (2024).\n- 4. Goessling, H. F., Rackow, T. & Jung, T. Recent global temperature surge intensified by record-low planetary albedo. *Science* **387**, 68–73 (2025).\n- 5. Minobe, S. *et al.* Global and regional drivers for exceptional climate extremes in 2023- 2024: beyond the new normal. *Npj Clim. Atmospheric Sci.* **8**, 1–11 (2025).\n- 6. Frölicher, T. L., Fischer, E. M. & Gruber, N. Marine heatwaves under global warming. *Nature* **560**, 360–364 (2018).\n- 7. Raghuraman, S. P. *et al.* The 2023 global warming spike was driven by the El Niño– Southern Oscillation. *Atmospheric Chem. Phys.* **24**, 11275–11283 (2024).\n- 8. Samset, B. H., Lund, M. T., Fuglestvedt, J. S. & Wilcox, L. J. 2023 temperatures reflect steady global warming and internal sea surface temperature variability. *Commun. Earth Environ.* **5**, 1–8 (2024).\n- 9. Voosen, P. El Niño fingered as likely culprit in record 2023 temperatures. *Science* **386**, 137–137 (2024).\n- 10. Wu, L. *et al.* Enhanced warming over the global subtropical western boundary currents. *Nat. Clim. Change* **2**, 161–166 (2012).\n- 11. Minobe, S. A 50–70 year climatic oscillation over the North Pacific and North America. *Geophys. Res. Lett.* **24**, 683–686 (1997).\n- 12. Latif, M. & Barnett, T. P. Causes of Decadal Climate Variability over the North Pacific and North America. *Science* **266**, 634–637 (1994).\n- 13. Latif, M. & Barnett, T. P. Decadal Climate Variability over the North Pacific and North America: Dynamics and Predictability. *J. Clim.* **9**, 2407–2423 (1996).\n- 14. Griffies, S. M. & Bryan, K. Predictability of North Atlantic Multidecadal Climate Variability. *Science* **275**, 181–184 (1997).\n- 15. Kosaka, Y. & Xie, S.-P. Recent global-warming hiatus tied to equatorial Pacific surface cooling. *Nature* **501**, 403–407 (2013).\n- 16. England, M. H. *et al.* Recent intensification of wind-driven circulation in the Pacific and the ongoing warming hiatus. *Nat. Clim. Change* **4**, 222–227 (2014).\n- 17. Kwon, Y.-O. *et al.* Role of the Gulf Stream and Kuroshio–Oyashio Systems in Large-Scale Atmosphere–Ocean Interaction: A Review. *J. Clim.* **23**, 3249–3281 (2010).\n- 18. Kelly, K. A. *et al.* Western Boundary Currents and Frontal Air–Sea Interaction: Gulf Stream and Kuroshio Extension. *J. Clim.* **23**, 5644–5667 (2010).\n- 19. Smith, D. M. *et al.* North Atlantic climate far more predictable than models imply. *Nature* **583**, 796–800 (2020).\n- 20. Scaife, A. A. & Smith, D. A signal-to-noise paradox in climate science. *Npj Clim. Atmospheric Sci.* **1**, 28 (2018).\n- 21. Weisheimer, A. *et al.* The Signal-to-Noise Paradox in Climate Forecasts: Revisiting Our Understanding and Identifying Future Priorities. *Bull. Am. Meteorol. Soc.* **105**, E651–E659 (2024).\n- 22. Chelton, D. B. & Xie, S.-P. Coupled Ocean-Atmosphere Interaction at Oceanic\n\nMesoscales. *Oceanography* **23**, 52–69.\n[]",
      "source": "News Source",
      "date": "2025-10-09T14:29:58.210Z"
    },
    {
      "title": "EHPnet: The Earth Observing System",
      "url": "https://pubmed.ncbi.nlm.nih.gov/PMC1277876?utm_source=valyu.ai&utm_medium=referral",
      "image_url": {},
      "content": "In 1991, the National Aeronautics and Space Administration (NASA) embarked upon the extensive and comprehensive Earth Science Enterprise, a program to help us better understand what is happening on the Earth’s surface. The centerpiece of the Earth Science Enterprise is known as The Earth Observing System (EOS). The EOS website, located at **[http://eospso.gsfc.nasa.gov/]()**, is designed to keep scientists, educators, and the news media informed about the system and its activities.\n\nEOS is composed of a series of satellites conducting long-term global observations of the land surface, biosphere, solid Earth, atmosphere, and oceans. The first EOS satellite, Terra, was launched into orbit in December 1999. NASA hopes the data gathered by the system, the first to provide integrated measurements of processes occurring on Earth, can be used to help better predict climate change, oversee conservation efforts, and improve forecasting to help farmers, fishers, and other weather-dependent tradespeople.\n\nThe For Scientists section of the website provides links to overviews of the field experiments that EOS conducts, and contains information on what sorts of measurements EOS takes and what types of instruments are used. Also within this section are links to brochures, reference books, data product catalogs, a bibliography of EOS-related publications, and a calendar of workshops and conference seminars conducted by EOS personnel.\n\nTeachers looking for EOS-related resources can visit the For Educators section. The EOS Education Project, with a link located under the Educational Links subhead, has been developed for teachers and students at all levels to teach about topics including geographic information systems and remote sensing. The project offers outreach programs for teachers and Internet-based classes. This section also features a directory of other EOS-related teaching materials, including brochures, fact sheets, posters, lithographs, and lesson plans that can be downloaded or ordered for free. Also available are online tools for calculating when a satellite will pass overhead and tracking various satellites’ current location in the sky. Links to other websites include the main NASA Earth Science Enterprise educational website and the homepages of related agencies such as the National Science Foundation.\n\nNews writers have their own section on the website. Available under For News Media is the Earth Observatory Newsroom, which contains press releases on the latest EOS research, NASA news announcements, and a list of newly published research. This section also features the EOS Global Change Media Directory 2001. This resource lists 343 scientists working in fields such as ozone chemistry, global warming, and ecosystems who have expressed interest in working with the media. Science writers’ guides to individual spacecraft provide extensive background material and contact information.\n\nThe site’s Data Services section provides links to the different types of data that the EOS and its partners provide. This section links to NASA’s Global Change Master Directory website, which provides extensive data sets on 13 topics, including agriculture, human dimensions, oceans, and sun-Earth interactions. Subscribers can add to the data sets and participate in an online discussion list.\n",
      "source": "News Source",
      "date": "2025-10-09T14:29:58.210Z"
    },
    {
      "title": "Inside Climate News",
      "url": "https://en.wikipedia.org/wiki/Inside%20Climate%20News?utm_source=valyu.ai&utm_medium=referral",
      "image_url": {},
      "content": "Inside Climate News is a non-profit news organization, focusing on environmental journalism. The publication writes that it \"covers clean energy, carbon energy, nuclear energy and environmental science—plus the territory in between where law, policy and public opinion are shaped.\"\n\nEstablished in 2007, the Brooklyn, New York-based website covers environmental issues. In 2013 three of its staff members won a Pulitzer Prize for national reporting on the Kalamazoo River oil spill in Michigan.\n\nHistory\n\nThe website was co-founded in 2007 by publisher David Sassoon and executive editor Stacy Feldman. Originally called SolveClimate News, it adopted its current name \"to counter the perception that it was an environmental advocacy organization.\" As a non-profit journalism outlet, Inside Climate Newss model is similar to that of ProPublica and the Center for Investigative Reporting, which have similarly gained recognition. Like the other two organizations, Inside Climate News publishes its content for free on the Web, collaborates with for-profit news organizations that republish some of the nonprofit's work with credit, and aims \"to tackle topics that bigger, better-known news organizations are not equipped or inclined to do.\"\n\nA 2015 article by Jillian Melchior in National Review said there are questions about Inside Climate News's possible conflict of interest and bias.\n\nAs of February 2018, Inside Climate News had a staff of 18, including 7 full-time reporters.\n\nAwards \nThree Inside Climate News reporters—Elizabeth McGowan, Lisa Song, and David Hasemyer—won the 2013 Pulitzer Prize for National Reporting for their series of \"rigorous reports\" on the Kalamazoo River oil spill in Michigan, in which an Enbridge oil pipeline spill led to the costliest onshore oil spill in American history.  The Pulitzer citation praised the reporters for exporting the aftermath of the 2010-2012 oil spill and \"flawed regulation of the nation's oil pipelines, focusing on potential ecological dangers posed by diluted bitumen (or 'dilbit'), a controversial form of oil.\"\n\nIn April 2016, Inside Climate News was named a finalist for the Pulitzer Prize for Public Service, for the 2015 Exxon: The Road Not Taken series.  Inside Climate News was awarded a 2015 Sigma Delta Chi Award for excellence in journalism by the Society of Professional Journalists for the informational graphics in the Exxon: The Road Not Taken series, which \"provide a visual timeline of Exxon's views and efforts on climate change since the 1970s, and evidence of its uncertainty campaigns in the 1990s and 2000s.\" The White House Correspondents Association awarded Inside Climate News a share in the 2016 Edgar A. Poe Award, which annually honors \"excellence in news coverage of subjects and events of significant national or regional importance, written with fairness and objectivity,\" for the Exxon: The Road Not Taken series.\n\nReferences\n\nExternal links \n Inside Climate News web site\n\nAmerican environmental websites\nPulitzer Prize for National Reporting winners\nMagazines published in New York City\nMagazines established in 2007\nOnline magazines published in the United States\nClimate change organizations based in the United States",
      "source": "News Source",
      "date": "2025-10-09T14:29:58.210Z"
    },
    {
      "title": "A personal perspective on modelling the climate system Modelling Climate",
      "url": "https://pubmed.ncbi.nlm.nih.gov/PMC4892275?utm_source=valyu.ai&utm_medium=referral",
      "image_url": {},
      "content": "6.## Conclusion\nAt the 2015 Paris Climate Conference, leaders from 194 countries of the world unanimously acknowledged the serious threat posed by anthropogenic emissions of greenhouse gases; surely, there can no longer be any serious doubt about the reality of this threat. Item 7c of Article 7 of the Paris Climate Agreement (Item 7c of Article 7) recommends: ‘Strengthening scientific knowledge on climate, including research, systematic observation of the climate system and early warning systems, in a manner that informs climate services and supports decision making’. I myself would put it more strongly: Climate science must now step up a gear to provide reliable estimates of the climate of the coming decades, including climate extremes, on both global and regional scales, which are as sharp as possible. But we cannot do this without a step change in our modelling capabilities, and my view is that this will not be achieved without a more collaborative approach to climate model development. However, climate scientists must first come together and decide, independent of the politics of international collaboration and the politics of climate change, whether the scientific case for a more collaborative approach to climate model development can be made. If the climate research community can speak with one voice-as it does, for example, in the IPCC assessment reports-then the job is half done.\n",
      "source": "News Source",
      "date": "2025-10-09T14:29:58.210Z"
    },
    {
      "title": "Beyond the hockey stick: Climate lessons from the Common Era",
      "url": "https://pubmed.ncbi.nlm.nih.gov/PMC8488652?utm_source=valyu.ai&utm_medium=referral",
      "image_url": {
        "pnas.2112797118fig01.jpg": "https://prod-s3-vyplatform-processeddata.s3.amazonaws.com/valyu-v5/valyu-pubmed/c3b01ee9-2ecb-5b86-bbed-db7f6ecdd6f5/pnas.2112797118fig01.jpg?response-content-type=image%2Fjpeg&response-content-disposition=inline%3B%20filename%3D%22pnas.2112797118fig01.jpg%22&X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAZEI6M4QPZGPZZ2Z6%2F20251009%2Feu-west-2%2Fs3%2Faws4_request&X-Amz-Date=20251009T142850Z&X-Amz-Expires=3600&X-Amz-SignedHeaders=host&X-Amz-Security-Token=IQoJb3JpZ2luX2VjED4aCXVzLWVhc3QtMSJHMEUCIQCWUuk01RGzvnqjdzlGq%2FwqUzHD7h6c4grlNcmZZ4BV5gIgaqygGnBkj0CqRwruAVSOFrwXPke3B0ETMqUr2HVYvBcqkgQI1%2F%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FARAAGgw2Mjc2NjU4NTU1MTkiDF1AzYrTCchT7FdP%2ByrmA3VbCohFmeeRjrNUYJoisygmR5ypQueqbaLAs8tHYm%2BaDjFVq9xdOO%2Bvp7TJGmJUnR6F%2FjbwHpPj8wn0I3A5hoQLNMM37GiuUaf61BMo5d9bVKDE4Qir7JOQxAS6l8EMisBpjc4RNwS2fxBmrpnFkaoYSEHR0Zg5hWcBG41jbheANj1MFQkilJrTOIuQkgvks0A%2BrWJihQp1mmloGDAeEbL2%2BrKCtDo2xj2AtMF0tcIYeI6PV9887C9QyJecAEwWDGbsJBSqxYn%2BA%2BHN37Ia6eeyYQ4tJ5YuPvmhNKuuovk9O5QPIv1mvJ9eTFJstO1WPS9tDJYzSP8HqUDicbpgvpKc8YE2CR2wOmTD6ceF8Wza%2BLMgF3cDQ8wPPJCef4H3UBc%2BAf0H%2BKhjPo40XCnrP1xilRgJxu5lyuOkbMclzAd3qJW9y%2BL5wYcF%2Fa%2BataJPXhZFNAnw2QTZ9UrGq%2BhhNdsjs2%2BiC024izVarsIh2tqSoyIg8TvWL%2FyKBQPNfhn9z1rvGTay44TrhjFbDv9sanBtmTpZJ0KiFKPubsjDyQb9IKFcDNpUWto4o%2Bjf4x2icnAxyDDa2cO3%2BOVt92DOnCB07T06BwNLaFh%2FkWspUfH3IT4BFO4PzlcsLhAl2tt0OwDaZGZsSjCO%2F57HBjqlAb39%2FRs3N1OLzAwF618SKUY%2FacwBKFCvTU%2FO28y9Ma3dYJNlgLvwmvAy%2F3Nf83yLLXjhMr9P5bhKEIN32KsReKN8TUQHxXpBo%2BAjY0Pq8g%2FPAtww1NICao7m9qL8TsuYTQH809LYcmSnM39vYuX3OTdC%2Bbm6rqhkbfCAiNh9c4RgHg2GtPBzFzN7ZCnGqyq0mdgNcPQpkBQ0B1PxbIOPbbZwscRV6w%3D%3D&X-Amz-Signature=66366433dcc9b3e6114fa190d79f351a4082fd57b97b8f5293b47051482b3ed0"
      },
      "content": "Clearly, there is a cautionary tale told by the hockey stick curve in the unprecedented warming that we are causing, but the lessons from the paleoclimate record of the Common Era (CE) go far beyond that. What might we infer, for example, about the role of dynamical mechanisms relevant to climate change impacts today from their past responses to natural drivers? Examples are the El Niño phenomenon, the Asian summer monsoon, and the North Atlantic Ocean “conveyor belt” circulation. Are there potential “tipping point” elements within these climate subsystems? How has sea level changed in past centuries, and what does it tell us about future coastal risk? Are there natural long-term oscillations, evident in the paleoclimate record, that might compete with human-caused climate change today? Can we assess the “sensitivity” of the climate to ongoing human-caused increases in greenhouse gas concentrations from examining how climate has responded to natural factors in the past? Also, can better estimates of past trends inform assessments of how close we are to critical “dangerous” warming thresholds? In this article, I seek to address such questions and offer thoughts about ways forward to more confident answers.\n\n## A Longer, Sturdier Hockey Stick\nIn the two decades since the original “hockey stick” works of Mann et al. [1998 (1) and 1999 (2), often referred to as “MBH98” and “MBH99,” corresponding to authors Mann, Bradley, and Hughes, respectively], which extended back to 1000 CE, far more paleoclimate data have become available, more sophisticated methods have been developed and applied to these data, and longer reconstructions have been achieved using lower-resolution but considerably longer paleoclimate proxy records. The net result is a veritable “hockey league” (3, 4)-dozens of independent studies that come to similar conclusions and a longer, sturdier hockey stick ([fig01]). Updated reconstructions show the recent warming to be anomalous in an even longer-term context, at least the past two millennia and more tentatively, the past 20,000 y (5, 6), than originally concluded two decades ago by Mann et al. (2). Studies using climate models driven by estimated natural (volcanic and solar) and anthropogenic forcing demonstrate that only the latter can explain this unprecedented warming trend (3).\n\nFrom the standpoint of the public climate change discourse, these conclusions are significant. They underscore the profound, unprecedented impact human activity-fossil fuel burning in particular-is having on our planet. From a scientific standpoint, however, some of the more important insights-insights that indeed motivated the original work of MBH98-involve past patterns of variability and what they can tell us about the dynamics of the climate system and the response to external drivers or “forcings.” We explore these insights in the following section.\n\n## Dynamical Mechanisms and Responses\nMany of the key impacts of climate change involve dynamical components of the climate system and their response to anthropogenic climate forcing. These include the El Niño/Southern Oscillation (ENSO), which influences weather patterns around the world, impacting western US drought and Atlantic hurricane activity among other phenomena. These include the Arctic Oscillation (AO) or closely related North Atlantic Oscillation (NAO), which impact weather patterns in North America and Eurasia. They also include the Asian summer monsoon upon which more than a billion people depend for their freshwater supply. Finally, there is the Atlantic Meridional Overturning Circulation (AMOC), often termed the “ocean conveyor belt” circulation. The AMOC delivers warm water to the high latitudes of the North Atlantic, warming neighboring regions and circulating nutrients to North Atlantic surface waters while suppressing sea level along parts of the US East Coast.\nWe can better understand these key dynamical components of the climate system and their potential role in climate change by studying how they have responded to past natural drivers, such as volcanic and solar radiative forcing. Moreover, we can assess whether dramatic changes in these systems are underway today by comparing recent trends against the record of the past one to two millennia.\n<FG id='fig01'>\n**Figure 1**: Fig. 1.\n<F href='pnas.2112797118fig01.jpg'>\nComparison of temperature reconstructions spanning the CE including the original Mann et al. (2) hockey stick reconstruction (1, 2) and its 95% uncertainty range and several different versions of the PAGES2k (Past Global Changes Last Two Millennium initiative) reconstruction (4) and uncertainty range, as well as the lower-resolution reconstruction of Marcott et al. (5) and its uncertainties. The smoothed Hadley Center and Climatic Research Unit Surface Temperature Product version 4 (HadCRUT4) instrumental global temperature series is shown for comparison. RegEM refers to a statistical reconstruction based on the Regularized Expectation-Maximization method.\n</F>\n</FG>",
      "source": "News Source",
      "date": "2025-10-09T14:29:58.210Z"
    },
    {
      "title": "Reelin Shows Promise for Healing Both Gut and Depression - Neuroscience News",
      "url": "https://neurosciencenews.com/reelin-microbiome-depression-29786/?utm_source=valyu.ai&utm_medium=referral",
      "image_url": {
        "0": "https://neurosciencenews.com/files/2025/10/reelin-depression-gut-neuroscienec.jpg",
        "1": "https://neurosciencenews.com/files/2025/10/brainstem-pain-neurons-neurosciene-390x390.jpg",
        "2": "https://neurosciencenews.com/files/2025/10/social-schizophrenia-neuroscience-390x390.jpg",
        "3": "https://neurosciencenews.com/files/2025/10/neuroinflammation-brain-chip-neuroscience-390x390.jpg"
      },
      "content": "# Reelin Shows Promise for Healing Both Gut and Depression\n\nSummary: A new study reveals that the protein Reelin may hold the key to treating both “leaky gut” and major depressive disorder. Chronic stress lowers Reelin levels in the gut, weakening the intestinal barrier and allowing toxins to trigger inflammation that worsens depression.\n\nResearchers found that a single injection of Reelin restored normal levels, strengthening gut integrity and potentially improving mood. The findings suggest a powerful new therapeutic approach that targets the gut–brain axis to heal both body and mind.\n\nKey Facts:\n\n- Dual-Action Protein: Reelin regulates both brain and gut health, restoring intestinal integrity and supporting mood balance.\n\n- Stress Connection: Chronic stress reduces Reelin in the gut, leading to inflammation and worsening depression.\n\n- Therapeutic Potential: A single injection of Reelin normalized gut levels and showed antidepressant-like effects in preclinical models.\n\nSource: University of Victoria\n\nWhat if a protein could be injected to help heal both “leaky gut” and severe depression?\n\nNew research from the University of Victoria (UVic), published in Chronic Stress, shows that a glycoprotein called Reelin may one day be able to do just that.\n\nIn a healthy body, the gastrointestinal system — which includes stomach, colon, and intestines, and is often referred to as the “gut” — controls which nutrients enter the bloodstream.\n\nWhen a person experiences chronic stress, or a stress-related condition such as major depressive disorder (MDD), the gut barrier can become more permeable.\n\nThis “leaky gut” can then allow harmful bacteria and toxins to enter circulation, which can lead to an immune system reaction and inflammation. This can further exacerbate symptoms of depression. Treatments that restore the integrity of the gut barrier may therefore be helpful in preventing MDD.\n\nReelin-based therapeutics could potentially offer such treatment, according to Hector Caruncho, professor of medical sciences at UVic and corresponding author on the study. Reelin is a protein that is found throughout the human body, including in the brain, blood, liver and intestines.\n\n“This study aimed to understand the role of Reelin in the gut, especially under conditions of chronic stress,” says Caruncho. “The gut-brain axis is becoming essential to understanding many psychiatric disorders, including depression.”\n\nThe study found that chronic stress decreased Reelin in the intestines of preclinical models, and that a single injection of 3 µg of Reelin normalized levels.\n\nPrevious studies have shown that individuals diagnosed with major depressive disorder have less Reelin in their brains, as do rodents exposed to chronic stress, and that a single intravenous injection of 3 µg of Reelin can produce antidepressant-like effects in these rodents. They have also shown Reelin to be necessary for proper gut lining renewal.\n\n“Taken together, these results may have important implications for the management of major depressive disorder,” says Ciara Halvorson, neuroscience PhD student at UVic, and first author on the paper.\n\n“This is especially true for people who live with both depression and gastrointestinal conditions.\n\n“Under healthy conditions, the gut lining is renewed every four to five days. This is important as the cells in the gut lining are constantly exposed to damaging factors in the gut.\n\n“If Reelin protects against leaky gut by supporting the renewal of the gut lining, Reelin may thereby protect against the worsening of depression symptoms triggered by inflammatory immune responses to leaked gut material.”\n\nWhile more research is needed before Reelin will be available in the clinic, these findings position Reelin as a promising new treatment for depression that targets processes in both the brain and the gut.\n\nFunding: This study was supported by funding from the Canadian Institutes of Health Research (CIHR) and the Natural Sciences and Engineering Research Council of Canada (NSERC).\n\n### Key Questions Answered:\n\nA: Reelin is a glycoprotein found throughout the body that supports neuron function, regulates the gut barrier, and promotes tissue renewal.\n\nA: Chronic stress can cause “leaky gut,” letting toxins enter the bloodstream and trigger inflammation that contributes to depressive symptoms.\n\nA: By repairing gut integrity and improving brain chemistry simultaneously, Reelin could become a dual-target treatment for depression and gut disorders.\n\n## About this depression and microbiome research news\n\nAuthor: Heather WalmsleySource: University of VictoriaContact: Heather Walmsley – University of VictoriaImage: The image is credited to Neuroscience News\n\nOriginal Research: Open access.“An Intravenous Injection of Reelin Rescues Endogenous Reelin Expression and Epithelial Cell Apoptosis in the Small Intestine Following Chronic Stress” by Ciara Halvorson et al. Chronic Stress\n\nAbstract\n\nAn Intravenous Injection of Reelin Rescues Endogenous Reelin Expression and Epithelial Cell Apoptosis in the Small Intestine Following Chronic Stress\n\nChronic stress disrupts the integrity of the gut environment, including leaking of the intestinal epithelium.\n\nReelin, an extracellular matrix protein, is released from cells of the lamina propria and promotes epithelial cell proliferation and migration up the crypt-villus axis to facilitate renewal of the gut lining.\n\nIn the present study, we evaluated Reelin expression and apoptosis in the small intestine of Long Evan’s rats treated with recombinant Reelin (3 µg) or vehicle following 3 weeks of daily corticosterone (40 mg/kg/day) or vehicle injections.\n\nWe show that Reelin- and cleaved caspase-3- immunoreactive cells are diminished in the lamina propria or epithelial cells of the gut lining following chronic stress (∼ 50% and 55%, respectively), and that a single injection of 3 µg of Reelin delivered intravenously can reverse these parameters.\n\nWe also found Reelin cell counts in the small intestine did not correlate to counts in the hippocampus regardless of exposure to chronic stress or Reelin treatment.\n\nOur results suggest that Reelin may serve a protective function over gut barrier integrity through the restoration of epithelial cell turnover, and that Reelin may have a role in reversing chronic stress-induced changes to the gut environment.\n\n### Hunger, Fear, and the Brain’s Hidden Switch to Turn Off Chronic Pain\n\n### Social Inference Could Be the Key to Healing Schizophrenia\n\n### Human Brain-on-a-Chip Reveals How Inflammation Breaks the Mind\n\n### Why Comfort Food Feels Like Medicine for People in Chronic Pain",
      "source": "News Source",
      "date": "2025-10-09T14:29:58.210Z"
    }
  ],
  "timestamp": 1760020198211
}