{
  "newsItems": [
    {
      "title": "Hamas military leader in Gaza objects to ceasefire plan, BBC understands",
      "url": "https://www.bbc.com/news/articles/c708v2q5r09o?utm_source=valyu.network&utm_medium=referral&utm_campaign=ai_pilot&utm_content=ai_query",
      "image_url": {
        "0": "https://ichef.bbci.co.uk/news/1024/branded_news/1793/live/e66c1350-9fa8-11f0-b741-177e3e2c2fc7.jpg",
        "1": "https://static.files.bbci.co.uk/bbcdotcom/web/20250919-090805-05e5ba0164-web-2.30.1-2/grey-placeholder.png",
        "2": "https://ichef.bbci.co.uk/news/480/cpsprodpb/a9ef/live/db851280-a029-11f0-92db-77261a15b9d2.jpg.webp",
        "3": "https://ichef.bbci.co.uk/news/480/cpsprodpb/6756/live/6498a8e0-9ede-11f0-928c-71dbb8619e94.jpg.webp",
        "4": "https://ichef.bbci.co.uk/news/480/cpsprodpb/cd67/live/8c368e00-9eff-11f0-bf4d-3be239c29483.jpg.webp"
      },
      "content": "# Hamas military leader in Gaza objects to ceasefire plan, BBC understands\n\nMediators have made contact with the head of Hamas's military wing in Gaza, who has indicated he does not agree to the new US ceasefire plan, the BBC understands.\n\nIzz al-Din al-Haddad is thought to believe the plan was designed to finish Hamas, whether the group accepts it or not, and so is determined to fight on.\n\nUS President Donald Trump's 20-point framework to end the war - which has already been accepted by Israel - stipulates that Hamas disarm and have no future role in governing Gaza.\n\nIt is thought that some of Hamas's political leadership in Qatar are open to accepting it with adjustments - but have found their influence limited as they do not have control of the hostages held by the group.\n\nThere are believed to be 48 hostages still being held in the Palestinian territory by the armed group, only 20 of whom are thought to be alive.\n\nAnother stumbling block for some in Hamas is that the plan requires them to hand over all of the hostages over the first 72 hours of the ceasefire - giving away their only bargaining chip.\n\nEven with Trump's guarantee that Israel would abide by the terms, there is a lack of trust within the group that Israel would not resume its military operations once it had received the hostages - particularly after it attempted to assassinate the Hamas leadership in Doha in an air strike last month, in defiance of the US.\n\n## Israel 'tightens siege' of Gaza City as Hamas reviews Trump peace plan\n\n## Bowen: Momentum is the strength of Trump's Gaza plan, but lack of detail is its weakness\n\n## Trump peace plan 'ignores interests of Palestinian people', Hamas official tells BBC\n\nSome Hamas leaders are also thought to object to the deployment by the US and Arab states of what the plan describes as \"a temporary International Stabilisation Force\" to Gaza, which they view as a new form of occupation.\n\nAdditionally, a map of the proposed phased Israeli troop withdrawals from Gaza shared by the Trump administration shows what it refers to as a \"security buffer zone\" along Gaza's borders with Egypt and Israel.\n\nIt is unclear how this would be administered, but if Israel is involved it is also likely to be a point of contention.\n\nFurther, since agreeing to the plan on Monday evening, Israeli Prime Minister Benjamin Netanyahu has appeared to push back on several of the terms.\n\nIn a video shared on X, he insisted that the Israeli military would be able to remain in parts of Gaza and that Israel said it would \"forcibly resist\" a Palestinian state.\n\nThis goes against the terms of the US framework, which stipulates that Israeli forces would withdraw completely \"save for a security perimeter presence that will remain until Gaza is properly secure from any resurgent terror threat\".\n\nIt also says that once the plan is complete there may be a \"credible pathway to Palestinian self-determination and statehood\".\n\nHamas has previously said it would not disarm until a sovereign Palestinian state is established.\n\nThe Israeli military launched a campaign in Gaza in response to the Hamas-led attack on southern Israel on 7 October 2023, in which about 1,200 people were killed and 251 others were taken hostage.\n\nAt least 66,225 people have been killed in Israeli attacks in Gaza since then, according to the territory's Hamas-run health ministry.\n\n## What is Hamas and why is it fighting with Israel in Gaza?\n\n## Israel and the Palestinians: History of the conflict explained",
      "source": "News Source",
      "date": "2025-10-03T10:12:41.107Z"
    },
    {
      "title": "Greta Thunberg among activists detained as Israel intercepts Gaza flotilla",
      "url": "https://www.bbc.com/news/articles/c0lk292jww4o?utm_source=valyu.network&utm_medium=referral&utm_campaign=ai_pilot&utm_content=ai_query",
      "image_url": {
        "0": "https://ichef.bbci.co.uk/news/1024/branded_news/0952/live/0af28640-9f7d-11f0-b741-177e3e2c2fc7.jpg",
        "1": "https://static.files.bbci.co.uk/bbcdotcom/web/20250919-090805-05e5ba0164-web-2.30.1-2/grey-placeholder.png",
        "2": "https://ichef.bbci.co.uk/news/480/cpsprodpb/d505/live/f5376b20-9ee3-11f0-98b1-59d49dad95e6.jpg.webp",
        "3": "https://ichef.bbci.co.uk/news/480/cpsprodpb/cd67/live/8c368e00-9eff-11f0-bf4d-3be239c29483.jpg.webp"
      },
      "content": "# Israel intercepts Gaza flotilla and detains activists including Greta Thunberg\n\nHundreds of activists, including Swedish climate campaigner Greta Thunberg, have been detained by Israeli forces after a flotilla carrying aid bound for Gaza was intercepted.\n\nIsrael's Foreign Ministry said those involved in the Global Sumud Flotilla (GSF) were being transferred to an Israeli port to be deported.\n\nThe first boats were stopped about 70 nautical miles off the Gaza coast in international waters and others closer. Israel has been policing this area but does not have jurisdiction there.\n\nIsrael said its navy told the boats to change course as they were \"approaching an active combat zone and violating a lawful naval blockade\", while the GSF described the interceptions as \"illegal\".\n\nThe group said Israel's response was \"not an act of defence\", but \"a brazen act of desperation\".\n\nIt estimated 443 people were detained from the boats and alleged that many were assaulted with water cannon. Israel said all those detained were \"safe and in good health\".\n\nA growing number of countries have expressed concern over the incident, criticising Israel for staging the interception in international waters.\n\nColombian President Gustavo Petro has expelled all remaining Israeli diplomats from the country in response, and denounced the interception as an \"international crime by [Israel's Prime Minister] Netanyahu\".\n\nPetro also terminated Colombia's free trade agreement with Israel, in place since 2020, and called for the release of two Colombians who were aboard the flotilla.\n\nAmnesty International's Secretary General, Agnès Callamard, said Israel's blockade on Gaza was \"unlawful\" and that the \"decades-long impunity for Israel's blatant violations of international law must end\".\n\nHowever, Italy's Prime Minister Giorgia Meloni criticised the attempt to reach Gaza, saying: \"I continue to believe that all this brings no benefit to the Palestinian people.\"\n\nIsrael's Foreign Ministry posted footage from the interception showing Thunberg sitting on the deck of a boat, being handed water and a jacket by a member of the Israeli military. Detained activists are being taken to the port of Ashdod, Israel said.\n\n\"Greta and her friends are safe and healthy,\" the Israeli government said.\n\nIsrael has described the flotilla as \"provocation yachts\" and contends that it was justified in stopping the vessels before they entered the naval blockade of the waters that border Gaza.\n\nIt said one boat remained \"at a distance\" and would be intercepted if it approached the blockade.\n\nThat boat appeared to be the Marinette, which the GSF said was still in communication and carrying six people on board. The flotilla's tracking system showed it sailing in international waters a long distance from Gaza's coastline on Thursday afternoon.\n\nIsrael said none of the boats entered the blockade area, though the GSF tracking suggests one of its boats, the Mikeno, may have entered Gaza's territorial waters, but remains out of contact.\n\nA member of the legal team working with the GSF said there will be a further attempt to breach Israel's blockade \"in the coming days\".\n\nCaoimhe Butterly, who is aboard a vessel providing legal support and acting as an observer to the GSF, said: \"There is the expectation that it will be up to 13 vessels, ships and boats and that it will follow a similar route to Gaza.\"\n\nThis will be organised by a separate group, the Freedom Flotilla Coalition, which launched two previous attempts that were both intercepted.\n\nPeople have gathered in Greece, Italy, Germany, Tunisia and Turkey to protest against Israel's interception of the flotilla. Its actions have also drawn criticism from Pakistan, Bolivia and Malaysia.\n\nIn Italy, spontaneous rallies took place in some cities on Wednesday evening. Its main trade union CGIL confirmed it was backing a general strike on Friday in solidarity with Gaza and in response to what it said was the \"abandonment\" of Italian workers \"in open international waters\" by the Italian government.\n\nThe flotilla had been accompanied by Italian and Spanish naval vessels following alleged drone attacks and communications jamming of unclear origin, but these peeled away well before the interception began.\n\nThe UN High Commissioner for Human Rights, Volker Türk, called for Israel to \"urgently lift the blockade on Gaza and allow the entry of life-saving material through all means possible\", adding in a statement that it must agree to facilitate impartial humanitarian relief schemes \"without hindrance\".\n\nThe UK Foreign Office said it had been in contact with the families of the British nationals aboard the boats, adding that it had contacted Israeli authorities to \"make clear we expect the situation to be resolved safely\".\n\nIrish Deputy Prime Minister Simon Harris called the reports \"concerning\" and said he expects Israel to uphold international law, with at least seven Irish citizens among the detained, including Sinn Féin Senator Chris Andrews.\n\nThe flotilla left Spain a month ago, with more than 40 ships and around 500 people aboard, including European parliamentarians, lawyers and activists, with the stated intention of taking aid directly into Gaza.\n\nIsrael has already blocked two attempts by activists to deliver aid by ship to Gaza, in June and July.\n\nWhile the Israeli government has characterised the flotilla as a \"selfie yacht\", Thunberg has pushed back against that criticism, telling the BBC on Sunday: \"I don't think anyone would risk their life for a publicity stunt.\"\n\nInternational aid agencies have been attempting to get food and medicine into the Palestinian territory but say Israel is restricting the flow of supplies.\n\nIsrael claims it is attempting to stop those supplies falling into the hands of Hamas. It and the US have backed an alternative food distribution system, the Gaza Humanitarian Foundation (GHF), which the UN has branded unethical and \"inherently unsafe\".\n\nThe Integrated Food Security Phase Classification (IPC), a UN-backed group considered an impartial expert body, confirmed last month that there was famine in Gaza, and the UN's humanitarian chief said it was the direct result of Israel's \"systematic obstruction\" of aid entering the territory.\n\nNetanyahu has called this an \"outright lie\", rejecting the evidence presented by the IPC.\n\n## Gaza doctors are starving while fighting to save lives, evacuated medic tells BBC\n\n## Bowen: Momentum is the strength of Trump's Gaza plan, but lack of detail is its weakness\n\n## Killed seeking food - Jeremy Bowen on Abdullah's shooting and Gaza's lethal aid system",
      "source": "News Source",
      "date": "2025-10-03T10:12:41.107Z"
    },
    {
      "title": "Israel stops 41 boats in aid flotilla with one ‘still sailing strong’ | Gaza | The Guardian",
      "url": "https://www.theguardian.com/world/2025/oct/02/israel-intercepts-aid-flotilla-but-one-ship-reported-to-have-got-through-blockade?utm_source=valyu.network&utm_medium=referral&utm_campaign=ai_pilot&utm_content=ai_query",
      "image_url": {
        "0": "https://i.guim.co.uk/img/media/5c0ec8acd5679debb7d0deb279e59ed8121d6139/285_0_1338_1071/master/1338.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&precrop=40:21,offset-x50,offset-y0&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=dd0ec9fe965bbda769741cdc2f47c1a4",
        "1": "https://i.guim.co.uk/img/media/5c0ec8acd5679debb7d0deb279e59ed8121d6139/285_0_1338_1071/master/1338.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&precrop=40:21,offset-x50,offset-y0&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&s=a6239e9f288f2d438ab057bef7c819eb",
        "2": "https://i.guim.co.uk/img/media/a0b8074d9e5fd0858788be430ed9341b8fe856b4/0_0_2048_1152/2048.jpg?width=465&dpr=1&s=none&crop=none",
        "3": "https://i.guim.co.uk/img/media/9eef3590af34db17572ac0efe51cd5749dda634b/391_0_4811_3849/master/4811.jpg?width=445&dpr=1&s=none&crop=none",
        "4": "https://i.guim.co.uk/img/media/d87ce8ccc13ae2053153d9b710d45ee53b426e6d/272_0_3320_2656/master/3320.jpg?width=445&dpr=1&s=none&crop=none"
      },
      "content": "2:21How the Israeli navy intercepted the Global Sumud flotilla – video\n\n# Israel stops 41 boats in aid flotilla with one ‘still sailing strong’\n\nActivists from Global Sumud flotilla including Greta Thunberg arrested as final boat is presumed intercepted in Palestinian waters\n\nIsrael says it has stopped a pro-Palestinian flotilla carrying aid from reaching Gaza, with its navy intercepting all but one of the vessels trying to breach the blockade.Of the 42 vessels being tracked online by the Global Sumud flotilla (GSF), 41 were listed as having been confirmed or assumed to have been stopped by Israeli forces.On Thursday evening GSF started a live stream on Instagram showing a video of a vessel named Marinette which was still navigating.“Marinette is still sailing strong,” said the GSF, though it appeared to be farther offshore and parallel to the coast of Egypt.Earlier the Israeli foreign ministry, describing the flotilla’s mission as a provocation, said “all passengers are safe and in good health” and that “they are being safely transported to Israel, and from there they will be deported to Europe”.Vessels from the flotilla, carrying about 500 parliamentarians, lawyers and activists including the Swedish climate campaigner Greta Thunberg, were boarded late on Wednesday by Israeli forces about 75 miles off the coast of Gaza.The goal of the flotilla, which was carrying symbolic humanitarian aid, was to breach the Gaza blockade and establish a maritime corridor into Gaza.A video from the Israeli foreign ministry showed Thunberg sitting on a deck surrounded by soldiers on the flotilla’s lead vessel, the Alma.In a video posted on Instagram shortly before the interception, Thunberg said: “My name is Greta Thunberg. I am onboard the ship Alma. We are about to be intercepted by Israel.”Thunberg and other activists were arrested and taken into custody at the Israeli port of Ashdod.While some of the vessels were boarded by Israeli soldiers, others sailed on towards the Gaza Strip before being intercepted.It was the first time since Israel imposed a naval blockade on Gaza’s waters in 2009 that an unauthorised humanitarian mission has reached closer than 70 nautical miles from the territory.The flotilla put out several videos on Telegram with messages from individuals onboard the various boats, some holding their passports, stating that they had been abducted and taken to Israel against their will and reiterating that their mission was a nonviolent humanitarian cause.Footage broadcast by Sky Italia showed activists on deck being hit by powerful jets of water. Those onboard said they heard loud bangs near several of the boats, believed to be stun grenades dropped from drones.View image in fullscreenA vessel of the Global Sumud flotilla arrives at Ashdod port after being intercepted by the Israeli authorities while carrying aid to Gaza. Photograph: Atef Safadi/EPAOne boat, named Mikeno, appeared to have escaped the maritime blockade and to have stopped inside Palestinian territorial waters near Gaza’s coast before being intercepted.Crew members on other vessels in the flotilla said they received a radio message from the Mikeno in which the ship’s captain declared: “We see land.”Ramazan Tunç, a member of the Turkish delegation of the flotilla, told the Anadolu news agency that the Mikeno had entered Gaza’s territorial waters, thereby breaking the blockade.“I want to share with you the joy that we have managed to bring our ship into Gaza,” he said, describing it as an achievement that many had deemed impossible under the heavy restrictions imposed by land and sea.The vessel was reported to be idling about 9 nautical miles off Gaza, where it had been stationary for some time before being stopped.Members of the flotilla will be handed over to the police before being transferred to Ketziot prison, a large facility in the Negev desert. Those who refuse deportation will be tried by a special court of interior ministry officials, rather than a regular court, for illegal entry.Those arrested include nine Irish citizens, including the Sinn Féin senator Chris Andrews, at least two Italian MPs, the French MEP Emma Fourreau, Franciszek Sterczewski, an MP from Poland’s ruling coalition, and a former RAF pilot, Malcolm Ducker, 72, who piloted one of the flotilla’s vessels, called All In.In a phone interview with the Guardian, Ducker’s daughter, Clare Azzougarh, said she was concerned about her father being detained in Ketziot, also known as Ansar III, a high-security prison used primarily to hold Palestinian security prisoners, many of whom Israel accuses of involvement in militant or terrorist activities.“Early in the morning I saw the video of the Israeli commandos coming on to the boat to arrest all the members of my father’s boat and that’s the last I saw him,” Azzougarh said.‘‘My dad joined the flotilla because he was so upset and frustrated about what was happening in Gaza and seeing that no government or international community was really going to take any meaningful action and he couldn’t stand to see all the death, but crucially all the children being starved, and felt that he had to do something.”She added: “I’m very very impressed with how he handled himself yesterday. I know it’s the honour of his lifetime to serve in this mission. He wanted to uphold international law because it’s an illegal blockade.”View image in fullscreenDemonstrators clash with police during a protest in Naples after Israel’s raid on the flotilla. Photograph: Ciro De Luca/ReutersSpontaneous protests broke out across Italy in response to the raid. Protests were also reported in Brussels, Athens, Buenos Aires and Berlin, while the Spanish government called on Israel to protect the safety and rights of activists.Spain’s labour minister and deputy prime minister, Yolanda Díaz, described the attack on the flotilla as “a crime against international law” and demanded that Israel immediately release those it had detained. Writing on Bluesky, she said: “The EU needs to break off relations with Israel right now.”The British government was “very concerned” about Israel’s interception of an international aid flotilla bound for Gaza, the Foreign Office said on Thursday, adding that it had made clear to Israel that the situation should be resolved safely.Turkey’s foreign ministry said the Israeli “attack” on the flotilla was “an act of terror” that endangered the lives of civilians.Israel imposed the naval blockade in 2009, an intensification of its 2007 blockade of Gaza in response to Hamas seizing control of the territory. The UN has condemned the blockade on numerous occasions, calling it “a direct contravention of international human rights and humanitarian law”.The flotilla argued it was a civilian, unarmed group and that the passage of humanitarian aid was guaranteed in international law.Previous attempts by activists to break the naval blockade on Gaza were stopped by force by the Israeli military. In 2010, 10 Turkish activists were killed by Israeli commandos who raided the Mavi Marmara ship as it led an aid flotilla towards Gaza.\n\nExplore more on these topics\n\n- [Gaza](https://www.theguardian.com/world/gaza) - [Israel](https://www.theguardian.com/world/israel) - [Palestine](https://www.theguardian.com/world/palestinian-territories) - [Middle East and north Africa](https://www.theguardian.com/world/middleeast) - [Greta Thunberg](https://www.theguardian.com/environment/greta-thunberg) - [news](https://www.theguardian.com/tone/news)\n\nShareReuse this content\n\nMore on this story\n\n## More on this story\n\n- Hamas to demand key revisions to Trump Gaza plan before accepting, sources say - Moment IDF soldiers board Gaza aid flotilla vessels – video - Gaza aid flotilla: what we know so far about Israel’s interception of boat convoy - Israel says ‘last opportunity’ for Gaza City residents to leave - Israel’s Gaza flotilla interception triggers protests, diplomatic expulsions and calls for strikes - Trump’s peace plan is everything Israelis dreamed of. But it’s a fantasy - Full StoryIs the Trump plan for Gaza designed to fail? – Full Story podcast - Once again, Netanyahu has outplayed Trump\n\nMost viewed\n\n## Most viewed",
      "source": "News Source",
      "date": "2025-10-03T10:12:41.107Z"
    },
    {
      "title": "Israel intercepts last Gaza Sumud flotilla vessel: What we know so far | Israel-Palestine conflict News | Al Jazeera",
      "url": "https://www.aljazeera.com/news/2025/10/1/israel-intercepts-gaza-sumud-flotilla-vessels-what-we-know-so-far?utm_source=valyu.network&utm_medium=referral&utm_campaign=ai_pilot&utm_content=ai_query",
      "image_url": {
        "0": "https://www.aljazeera.com/wp-content/uploads/2025/10/2025-10-01T200210Z_254592667_RC273HAWSAU7_RTRMADP_3_ISRAEL-PALESTINIANS-FLOTILLA-GREECE-1759360619.jpg?resize=1920%2C1440",
        "1": "https://www.aljazeera.com/wp-content/uploads/2025/10/2025-10-01T200210Z_254592667_RC273HAWSAU7_RTRMADP_3_ISRAEL-PALESTINIANS-FLOTILLA-GREECE-1759360619.jpg?resize=730%2C410&quality=80",
        "2": "https://www.aljazeera.com/wp-content/uploads/2020/09/image-1-1-1727085849.jpg?resize=96%2C96&quality=80",
        "3": "https://www.aljazeera.com/wp-content/uploads/2025/10/INTERACTIVE-Tracking-the-Global-Sumud-Flotilla-to-Gaza-map-light-October-1-2025-1759294629.png?w=770&resize=770%2C962&quality=80",
        "4": "https://www.aljazeera.com/wp-content/uploads/2025/09/AA-20250914-39114681-39114675-BOATS_JOIN_GLOBAL_SUMUD_FLOTILLA_FROM_GREECE_TO_GAZA-1757916338.jpg?w=770&resize=770%2C513&quality=80"
      },
      "content": "Israel intercepts last Gaza Sumud flotilla vessel: What we know so far | Israel-Palestine conflict News | Al Jazeera\n\nToggle PlayIsrael begins to intercept Global Sumud Flotilla vessels\n\nBy Elizabeth MelimopoulosPublished On 1 Oct 20251 Oct 2025|Updated: an hour agoUpdated: an hour agoClick here to share on social mediashare2SharefacebooktwitterwhatsappcopylinkSave\n\nIsraeli forces have boarded and taken control of the Marinette, the final vessel headed towards Gaza as part of the [Global Sumud Flotilla](https://www.aljazeera.com/news/liveblog/2025/9/2/live-geta-thunberg-once-more-on-board-sumud-flotilla-sailing-for-gaza) (GSF), one of the largest aid missions to attempt to break Israel’s blockade of the enclave.\n\nThe flotilla, made up of at least 44 civilian boats carrying some 500 activists, was first intercepted late on Wednesday, with boats boarded and volunteers detained and taken to Israel. By noon on Thursday (09:00 GMT), the military said all but one vessel had been secured.\n\n## Recommended Stories\n\nlist of 3 items\n\n- list 1 of 3[Gaza Sumud flotilla: How Israel breaks international maritime law](https://www.aljazeera.com/news/2025/10/1/gaza-sumud-flotilla-how-israel-breaks-international-maritime-law) - list 2 of 3[Global Sumud Flotilla sails into ‘high-risk zone’ near Gaza](https://www.aljazeera.com/video/newsfeed/2025/10/1/global-sumud-flotilla-sails-into-high-risk-zone-near-gaza) - list 3 of 3[Israel begins to intercept Global Sumud Flotilla vessels](https://www.aljazeera.com/video/newsfeed/2025/10/1/israel-begins-to-intercept-global-sumud-flotilla-vessels-2)\n\nend of list\n\nOn Friday morning, a livestreamed video showed Israeli forces forcing their way on board the Polish-flagged Marinette, which reportedly has a crew of six, and was the last remaining operational vessel of the flotilla.\n\nThe flotilla organisers posted on X: “Marinette, the last remaining boat of the Global Sumud Flotilla, was intercepted at 10:29am local time, approximately 42.5 nautical miles from Gaza.”\n\nIsrael has enforced a blockade on Gaza since Hamas took control in 2007. Gaza’s residents have largely been trapped in the Palestinian territory since then, with the entry of food, goods, and aid [strictly controlled](https://www.aljazeera.com/news/2021/3/14/a-guide-to-the-gaza-strip) by Israel.\n\nHere is what we know.\n\n## What happened to the flotilla?\n\nIsrael has intercepted all the vessels in the Global Sumud Flotilla, a convoy carrying humanitarian aid to Gaza, organisers said.\n\nThe country had vowed to stop the flotilla, claiming the volunteers were trying to “breach a lawful naval blockade”, but organisers say international law is clear that humanitarian aid should be let through.\n\nAdvertisement\n\nOrganisers reported that naval forces had first boarded several boats about 70 nautical miles (130 km) off Gaza’s coast, cutting communications and jamming signals as the flotilla neared the enclave. At least 13 vessels were seized on Wednesday. Activists on the boats also described tense encounters with unlit boats and drones shadowing the convoy on Wednesday. The group also said Israeli naval vessels had deliberately damaged ship communications to block distress signals and disrupt livestreams of the boarding.\n\nFlotilla spokesperson Saif Abukeshek said people from 37 countries were taking part in the flotilla, including 30 from Spain, 22 from Italy, 21 from Turkiye and 12 from Malaysia.\n\nThe flotilla’s voyage has drawn global attention, and the detention of activists has triggered protests in cities including Rome, Buenos Aires and Istanbul. Those held included climate activist Greta Thunberg, former Barcelona mayor Ada Colau, and European Parliament member Rima Hassan.\n\nIn a statement on Friday, the International Committee to Break the Siege of Gaza said some of the detainees from the Global Sumud Flotilla had begun a hunger strike after being detained by Israeli forces.\n\nWhile the flotilla carried only a symbolic amount of humanitarian aid, organisers said their mission was to establish a maritime corridor into Gaza, where nearly two years of war have left the population facing an acute humanitarian crisis.\n\n## How did Israel respond?\n\nIsrael’s Foreign Ministry released a video on Wednesday of a navy officer warning the flotilla that it was approaching a restricted zone and that any aid must go “through established channels”.\n\nIsraeli UN ambassador Danny Danon said activists would be deported after Yom Kippur ends on Thursday.\n\n“Those detained would normally go through a legal process, but Israel is currently under near-total shutdown because of the Yom Kippur holiday,” Al Jazeera’s Nida Ibrahim, reporting from Doha, said.\n\n“That means courts and prisons are not functioning, creating a limbo for the activists if they are detained.”\n\nAnother ministry video showed climate activist Greta Thunberg surrounded by soldiers on a boat deck. “Several vessels of the Hamas-Sumud flotilla have been safely stopped and their passengers are being transferred to an Israeli port,” the ministry said on X, adding, “Greta and her friends are safe and healthy.”\n\n> Already several vessels of the Hamas-Sumud flotilla have been safely stopped and their passengers are being transferred to an Israeli port. Greta and her friends are safe and healthy. pic.twitter.com/PA1ezier9s > — Israel Foreign Ministry (@IsraelMFA) October 1, 2025\n\nAdvertisement\n\nSince 2009, Israel has formally enforced a naval blockade it says is necessary to prevent weapons from being smuggled in. Israeli authorities have also alleged that some flotilla organisers are connected to Hamas, a claim the activists strongly reject as unfounded. Israel has yet to present any evidence to prove its claims.\n\n## Has this happened before?\n\nVessels and convoys have attempted to break the blockade of Gaza since 2010. A few [of those](https://www.aljazeera.com/news/2025/6/9/freedom-flotillas-a-history-of-attempts-to-break-israels-siege-of-gaza) include:\n\n**2010 –** **The Mavi Marmara incident:** Israeli commandos boarded the Turkish ship Mavi Marmara, part of the Gaza Freedom Flotilla. Clashes broke out, and 10 activists were killed, drawing global condemnation and straining Israel-Turkiye relations.\n\nIsrael apologised for “operational mistakes” in the raid in 2013. A compensation deal is still being negotiated between the two countries. Israeli soldiers and officials who took part in the attack are being tried in absentia in Turkiye for war crimes.\n\n**2011-18 –** **Smaller flotillas stopped:** Several subsequent flotillas, including in 2011, 2015, and 2018. Israel typically diverted the ships to Ashdod port, detained activists and confiscated cargo. In 2018, activists were arrested, and some reported they were tasered and beaten.\n\n**2024 –** **Flotilla attempts:** Activist groups continued organising flotillas, but Israel either prevented them from leaving ports abroad or intercepted them before they could approach Gaza.\n\n**2025 –** **The Madleen:** Several flotilla missions set sail to challenge Israel’s naval blockade. One such mission in June involved the [ship Madleen](https://www.aljazeera.com/news/2025/6/12/explainer-how-is-israel-treating-the-eight-flotilla-activists), which departed from Catania, Sicily, with food, medical supplies, baby formula and other essential goods. It also carried activists, including Thunberg. In the early hours of June 9, the Israeli navy intercepted and boarded the Madleen in international waters, using a chemical irritant spray. It seized the vessel and detained the 12 people on board. The activists were deported after being processed in Israel.\n\n## What else do we know about the current flotilla?\n\nThe[Global Sumud Flotilla](https://www.aljazeera.com/opinions/2025/9/7/why-we-are-sailing-to-gaza-on-the-global-sumud-flotilla) set sail in late August 2025, departing from ports in Spain and Italy before stopping in Greece and Tunisia as it made its way across the Mediterranean.\n\nThe mission began with more than 50 vessels representing at least 44 countries, carrying hundreds of international volunteers, activists and lawmakers. Among them are 24 Americans, including several military veterans, according to the organisers.\n\nOn board were symbolic yet significant amounts of humanitarian cargo, including food, medical supplies and other essentials for Gaza’s starved population.\n\nSupporters gather at the port in Syros, Greece, waving Palestinian flags as boats depart to join the Global Sumud Flotilla sailing towards Gaza [File: Ayhan Mehmet/Anadolu]\n\nActivists reported several hostile encounters at sea, including suspected drone attacks near Malta and Crete, which left some vessels damaged and forced them to withdraw. By the time the flotilla neared the eastern Mediterranean, 44 boats remained in the convoy.\n\nAdvertisement\n\nInternational attention grew as the flotilla pressed on. Spain and Italy deployed naval vessels to monitor its progress and offer assistance if required, while governments across Europe and beyond urged restraint from all parties.\n\n## Have other governments responded to Israel’s arrest of flotilla activists?\n\nMultiple countries have condemned Israel’s actions.\n\n- **Malaysian Prime Minister** Anwar Ibrahim condemned in the “strongest terms” Israel’s “intimidation and coercion” of vessels carrying “unarmed civilians and life-saving humanitarian supplies for Gaza”. Israel, he said in a post on X, had shown “utter contempt not only for the rights of the Palestinian people but also for the conscience of the world”. At least 12 Malaysian nationals were on the boats intercepted by Israel so far. - **Ireland’s Foreign Minister** Simon Harris said he had spoken to his counterparts of the European Union member states that were represented in the flotilla after the Israeli forces’ raid and the activists’ detention. He called the Israeli action “very concerning”, describing the flotilla as “a peaceful mission to shine a light on a horrific humanitarian catastrophe”. Ireland’s Department of Foreign Affairs and Trade said its embassy in Tel Aviv was speaking with Israeli authorities. “Our focus now is on assisting citizens immediately impacted and their families. This will be the priority for our team over the coming hours,” it said. - **Colombia’s President**Gustavo Petro has expelled Israeli diplomats from the South American country in response to the detention of flotilla activists, including two Colombian nationals. In a post on X, Petro also said a free trade agreement between Colombia and Israel had been “denounced immediately”. He added, in a separate post: “Here Netanyahu demonstrates his worldwide hypocrisy and why he is a worldwide criminal who must be captured.” - **Venezuela’s Foreign Minister** Yvan Gil said on Telegram that Israel’s move to stop the boats from getting to Gaza “exposes, once again, the criminal nature of the Zionist regime”. He added, “The blockade of humanitarian aid is a tool of deliberate war, the continuation of genocide by other means, seeking to annihilate the population by starvation to complement their indiscriminate bombings.” - **Turkiye’s Ministry of Foreign Affairs** condemned Israel’s naval interception of the flotilla. It called Israel’s actions a “terrorist” act. - **Germany**, a key ally of Israel, urged Israel to guarantee the safety of all those on the flotilla. “We were in contact with the Israeli government and called on them to comply with their obligations under international law and to act with proportionality. We also called for the protection of all those on board to be guaranteed; to our knowledge, this has been done,” said a spokesperson. The German embassy in Israel said it was trying to establish contact with any German nationals involved. - **Kuwait’s Foreign Minister**Abdullah Ali al-Yahya said the country was closely watching for news of its detained nationals on board the GSF vessel, the Spectre, which was intercepted by the Israeli navy, and that his ministry “is exerting all possible efforts to ensure the safety of the citizens and is working for their immediate release”. According to the flotilla tracker, three Kuwaiti nationals took part in the aid convoy. - **Italian Prime Minister**Giorgia Meloni repeated earlier criticism of the flotilla but said the country was working to ensure 22 Italians who had been detained were returned home. “Obviously, we will do everything we can to ensure these people can return to Italy as soon as possible,” she told reporters at a European Union meeting in Denmark. “I continue to believe that all this brings no benefit to the Palestinian people.”\n\nAdvertisement",
      "source": "News Source",
      "date": "2025-10-03T10:12:41.107Z"
    },
    {
      "title": "Trump officials push claim that US in ‘armed conflict’ with drug cartels | Donald Trump | The Guardian",
      "url": "https://www.theguardian.com/us-news/2025/oct/02/trump-administration-caribbean-drug-cartels?utm_source=valyu.network&utm_medium=referral&utm_campaign=ai_pilot&utm_content=ai_query",
      "image_url": {
        "0": "https://i.guim.co.uk/img/media/b6e16c1c91aa3f917c815100914be1bb254c6530/418_0_4164_3333/master/4164.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&precrop=40:21,offset-x50,offset-y0&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=8d26d71527b2043efff788f7faa5ee99",
        "1": "https://i.guim.co.uk/img/media/b6e16c1c91aa3f917c815100914be1bb254c6530/418_0_4164_3333/master/4164.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&precrop=40:21,offset-x50,offset-y0&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&s=8a271274660053cefa9efb4c01cc5680",
        "2": "https://i.guim.co.uk/img/media/b6e16c1c91aa3f917c815100914be1bb254c6530/0_0_5000_3333/master/5000.jpg?width=465&dpr=1&s=none&crop=none"
      },
      "content": "Donald Trump speaks in the Oval Office earlier this week. Photograph: Bloomberg/Getty ImagesView image in fullscreenDonald Trump speaks in the Oval Office earlier this week. Photograph: Bloomberg/Getty Images\n\n# Trump officials push claim that US in ‘armed conflict’ with drug cartels\n\nAdministration attempts to justify strikes on alleged Venezuelan drug boats by claiming US under ‘armed attack’\n\nThe Trump administration is trying to justify strikes on alleged Venezuelan drug boats by advancing a novel legal theory that the US is now in a “non-international armed conflict”, according to a person familiar with a notification to Congress.The notification was provided by senior Pentagon officials as part of an attempt to explain the Trump administration’s legal arguments for the strikes, including a classified briefing to members of the Senate armed services committee on Wednesday.It comes after the US military conducted strikes on three boats in the Caribbean last month that killed 17 people and triggered widespread international outrage.Judge denies Kilmar Ábrego García’s bid for asylum in the USRead moreThe administration is required by law to report to Congress the US government’s use of armed forces.The New York Times reported that the administration’s memo cites that statute, and also repeats its past justifications that the strikes were conducted in self-defense and accusing the boats of containing members of a Venezuelan drug gang.But the memo also reportedly goes further, and frames the US military’s attacks on the boats to be part of a sustained conflict.The memo also reportedly states that Trump has deemed cartels engaged in smuggling drugs as “non-state armed groups” whose actions “constitute an armed attack against the United States”.The Trump administration has been increasing its military presence in the Caribbean in recent months, deploying a number of ships and military personnel to Puerto Rico. It has justified the military action as a necessary escalation to stem the flow of drugs into the US. But some lawmakers and human rights groups have questioned the legality of the attacks.The notice to Congress represents an aggressive escalation in the US government’s attempts to stop the flow of narcotics. The US government’s drug war in recent years has increasingly focused on political targets, and this latest escalation may be seen as an attempt by the administration to further place pressure on the Venezuelan government.On Thursday, Venezuelan officials said they discovered five US fighter jets flying about 46 miles (74km) from its Caribbean coast, CNN reported, citing the country’s government and defense minister, Vladimir Padrino.Earlier this year, the Trump administration determined several criminal groups to be “terrorist” organizations. The designation by the administration included a number of Mexican cartels, the MS-13 gang, the Venezuelan gang Tren de Aragua and the Venezuelan so-called Cartel de los Soles.For years, the US government has accused the Venezuelan government of Nicolás Maduro of being involved in drug trafficking. The Trump administration earlier this year accused Maduro of directing the activities of Tren de Aragua, and used it as a justification to expel hundreds of immigrants to a notorious Salvadorian prison under the Alien Enemies Act.Intelligence assessments have determined there is little proof of Maduro’s links to Tren de Aragua.Maduro and members of his cabinet and military also stand accused by the US of running the Cartel de los Soles and seeking to traffic cocaine to the US. The infrastructure of the cartel has been disputed, with drug trafficking analysts and experts saying that the Cartel de los Soles is a loose network of lower-ranking military officials without a strict hierarchical structure.Earlier this year, the US government raised its bounty for Maduro to $50m. There is an active indictment in a Manhattan federal court related to the Cartel de los Soles case. A co-defendant and former top Venezuelan military intelligence chief pleaded guilty earlier this year to narco-terrorism crimes.The three vessels that were targeted by the US in recent weeks were traversing through the Caribbean. Trump administration officials, without proof, have said the vessels were carrying members of Tren de Aragua with drugs destined for the US.The administration has been adamant in escalating its fight against fentanyl trafficking into the US. However, fentanyl typically arrives across the southern US border from Mexico.\n\nExplore more on these topics\n\n- [Donald Trump](https://www.theguardian.com/us-news/donaldtrump) - [Trump administration](https://www.theguardian.com/us-news/trump-administration) - [Americas](https://www.theguardian.com/world/americas) - [Caribbean](https://www.theguardian.com/world/caribbean) - [US politics](https://www.theguardian.com/us-news/us-politics) - [Drugs](https://www.theguardian.com/society/drugs) - [US foreign policy](https://www.theguardian.com/us-news/us-foreign-policy) - [news](https://www.theguardian.com/tone/news)\n\nShareReuse this content\n\nMost viewed\n\n## Most viewed",
      "source": "News Source",
      "date": "2025-10-03T10:12:41.107Z"
    },
    {
      "title": "Greta Thunberg removed from Gaza aid flotilla after 'attack' by Israel in international waters | World News | Sky News",
      "url": "https://news.sky.com/story/israel-removes-greta-thunberg-from-gaza-aid-flotilla-but-says-she-is-safe-and-healthy-13442505?utm_source=valyu.network&utm_medium=referral&utm_campaign=ai_pilot&utm_content=ai_query",
      "image_url": {
        "0": "https://e3.365dm.com/25/10/1600x900/skynews-greta-thunberg-gaza_7038661.jpg?20251002010230",
        "1": "https://e3.365dm.com/25/10/768x432/skynews-greta-thunberg-gaza_7038661.jpg?20251002010230",
        "2": "https://e3.365dm.com/25/10/768x432/skynews-greta-thunberg-gaza_7038548.png?20251001222630",
        "3": "https://e3.365dm.com/25/10/768x432/skynews-gaza-aid-flotilla-sumud-global-flotilla_7038465.png?20251001202016",
        "4": "https://e3.365dm.com/25/10/192x108/skynews-colombia-medellin-drugs_7039141.jpg?20251002142145"
      },
      "content": "Greta Thunberg removed from Gaza aid flotilla after 'attack' by Israel in international waters\n\nThe flotilla ignored requests to turn back, and organisers claim Israel's interception is illegal as it happened in \"international waters\" around 80 miles off the coast.\n\nThursday 2 October 2025 12:33, UK\n\nPlease use Chrome browser for a more accessible video player 0:30 Moment Israel detains Greta Thunberg\n\n[Why you can trust Sky News](https://news.sky.com/info/policies-and-standards)\n\nSeveral boats from a large aid flotilla trying to reach Gaza have been boarded by Israeli authorities - with campaigner Greta Thunberg among those removed.\n\nThe Global Sumud Flotilla is made up of more than 40 civilian boats with an estimated 500 people onboard, and is trying to break Israel's sea blockade.\n\nBut the attempt appears to have been thwarted - at least for now - by about 20 Israeli ships.\n\nIsrael's foreign ministry said \"several vessels\" had been \"safely stopped\", with passengers being taken to an Israeli port.\n\n\"Greta and her friends are safe and healthy,\" a spokesperson added.\n\nImage: A livestream showed some of the boats in the flotilla as the incident unfolded\n\nA video showed **Thunberg** sitting on deck while being handed a water bottle and raincoat.\n\nIt's so far unclear how many boats have been intercepted.\n\n### More from World\n\n- [Inside Pablo Escobar's home city where drugs are readily available to a traffic jam of cars](https://news.sky.com/story/colombia-is-high-on-trumps-troublemaker-list-but-coca-farmers-will-keep-producing-to-match-us-demand-13442883) - [Trump's declared war on drug cartels. Thousands of miles away, Ecuador is taking action](https://news.sky.com/story/this-is-what-trumps-war-on-drug-cartels-looks-like-13442140) - [Gaza latest: Protests erupt around world after Israel detains Greta Thunberg on aid flotilla](https://news.sky.com/story/gaza-israel-greta-thunberg-aid-flotilla-hamas-war-netanyahu-latest-trump-tony-blair-13440749)\n\nThe flotilla ignored requests to turn back and organisers said the interception was illegal as it happened in \"international waters\" around 80 miles off the coast.\n\nGreg Stoker, a US veteran who's involved, said water cannon had been used on some of the boats.\n\nPlease use Chrome browser for a more accessible video player 0:42 Gaza-bound flotilla 'aggressively circled' by warship\n\nThe flotilla, which set off from Barcelona and was scheduled to arrive this morning, had been flanked by NATO warships for part of the journey.\n\nThe attempt has received a lot of attention, with Nelson Mandela's grandson, a former Barcelona mayor and several European legislators taking part.\n\n**Israel** said the mission was violating a lawful blockade and is only intended to provoke. The country also claimed it had offered a way to deliver any aid peacefully through safe channels.\n\nOrganisers said the night-time interception was the second time the flotilla had been approached on Wednesday, after \"warships\" earlier encircled two of its boats.\n\nImage: The flotilla set off from Barcelona on 31 August and later stopped in Sicily\n\nLast week, drones also reportedly dropped stun grenades and itching powder on some vessels.\n\nIsrael didn't comment, but has said it will use any means to stop the boats getting to **Gaza**.\n\nProtests erupted around the world after Israel's interception of the flotilla.\n\nImage: Students in Madrid protest in support of Palestinians in Gaza and to condemn Israel's interception of the flotilla. Pic: Reuters\n\nPeople took to the streets in solidarity with the flotilla in countries including Italy, Spain, Colombia and Argentina.\n\nItaly's largest union has called a general strike tomorrow, saying the \"attack on civilian vessels carrying Italian citizens represents an extremely serious matter\".\n\nTurkey's foreign ministry called Israel's interception an \"attack\" and \"an act of terror\" that endangered lives of those on board.\n\nGaza has been dealing with severe food shortages due to the ongoing war.\n\nImage: Thunberg and activist Saif Abukeshek. Pic: Reuters/Nacho Doce\n\nAgencies such as the UN accused Israel of deliberately slowing the delivery of supplies - something it denies.\n\nHowever, the aid being carried by the flotilla is said to only be a symbolic amount of food and medicine.\n\nAn aid boat carrying Thunberg was also intercepted near Gaza in June, with **the Swede deported alongside others**.\n\nIsrael brought in a sea blockade when Hamas took control of the territory in 2007 and there have been several attempts to break it since then.\n\nSome of those involved in the latest campaign have said they will start a hunger strike if they're detained.\n\n**Read more:Hamas's first reaction to peace plan is tellingWhat Sky correspondents make of Trump plan**\n\nPlease use Chrome browser for a more accessible video player 30:03 Will Trump's Gaza plan bring peace?\n\nMeanwhile, all eyes remain on Hamas and whether it will accept **Donald Trump's peace plan** to end the two-year war, sparked by the group's terror attack on Israel.\n\nThe 20-point proposal was unveiled alongside Israeli Prime Minister **Benjamin Netanyahu** in the White House this week.\n\nBe the first to get Breaking News Install the Sky News app for free\n\nHamas said it would study the plan and consult with other factions, but didn't give an indication of when it would deliver its verdict.\n\n**Mr Trump** said on Tuesday he would **give the group \"three or four days\"** to respond.\n\nfooter",
      "source": "News Source",
      "date": "2025-10-03T10:12:41.107Z"
    },
    {
      "title": "2 killed in terrorist stabbing at UK synagogue, 3 in custody: Officials - ABC News",
      "url": "https://abcnews.go.com/International/uk-police-respond-suspected-stabbing-shoot-suspect-synagogue/story?id=126144273&utm_source=valyu.network&utm_medium=referral&utm_campaign=ai_pilot&utm_content=ai_query",
      "image_url": {
        "0": "https://i.abcnewsfe.com/a/efd2abf5-29c4-48f1-9da1-f70f51769651/manchester-1-rt-gmh-251002_1759409907679_hpMain_16x9.jpg?w=1600",
        "1": "https://i.abcnewsfe.com/a/efd2abf5-29c4-48f1-9da1-f70f51769651/manchester-1-rt-gmh-251002_1759409907679_hpMain_16x9.jpg?w=992",
        "2": "https://i.abcnewsfe.com/a/26473c44-9c73-41c6-839c-0ff2b6ac4769/bomb-embed_1759407113486_hpEmbed_23x15.jpg",
        "3": "https://i.abcnewsfe.com/a/d7905d79-1052-4ede-896b-e2df914a07a5/embed-new_1759404851891_hpEmbed_19x12.jpg",
        "4": "https://i.abcnewsfe.com/a/efd2abf5-29c4-48f1-9da1-f70f51769651/manchester-1-rt-gmh-251002_1759409907679_hpMain.jpg"
      },
      "content": "# 2 killed in terrorist stabbing at UK synagogue, 3 in custody: Officials\n\nThe attack was on Yom Kippur, the holiest day of the year in Judaism.\n\nLONDON -- Two men were killed and three were wounded in a terrorist incident outside a synagogue in Manchester, England, on the Jewish holiday of Yom Kippur, officials said.\n\nOne suspect drove a car into a group of worshippers and then attacked people with a knife outside the Heaton Park Hebrew Congregation Synagogue on Thursday morning, Manchester police said.\n\nResponding police shot and killed that suspect, preliminarily identified as 35-year-old Jihad Al-Shamie, a British citizen of Syrian descent, police said. He was wearing a vest with \"the appearance of an explosive device,\" police said, adding that the vest was later \"deemed not to be viable.\"\n\nThree other suspects -- two men in their 30s and a woman in her 60s -- have been arrested on suspicion of commission, preparation and instigation of acts of terrorism, police said.\n\nThe two victims killed have only been identified by police as men.\n\nThe three wounded, also men, are in the hospital with serious injuries, police said.\n\nThe attack came as worshippers were gathered to mark Yom Kippur, which is considered the holiest day of the year in Judaism.\n\nBritish Prime Minister Keir Starmer said, \"A vile individual committed a terrorist attack that attacked Jews because they are Jews.\"\n\nHe noted that in Britain \"Jewish buildings, synagogues, even schools, require round the clock protection ... because of the daily threat of anti-Semitic hatred.\"\n\n## 1 injured after Delta regional jets collide at LaGuardia Airport, airline says\n\n- Oct 1, 11:23 PM\n\n## US is engaged in formal 'armed conflict' with 'terrorist' drug cartels, Trump says\n\n- Oct 2, 6:12 PM\n\n## Charlotte train stabbing: Newly released 911 calls show shock over unprovoked attack\n\n- Oct 1, 5:31 PM\n\n\"To every Jewish person in this country ... I know how much fear you will be holding inside of you. I really do,\" Starmer said. \"And so on behalf of our country, I express my solidarity, but also my sadness that you still have to live with these fears. ... So I promise you that I will do everything in my power to guarantee you the security that you deserve, starting with a more visible police presence protecting your community. I promise you that over the coming days, you will see the other Britain, the Britain of compassion, of decency, of love. And I promise you that this Britain will come together to wrap our arms around your community and show you that Britain is a place where you and your family are safe, secure and belong.\"\n\nStarmer, who was in Denmark for a summit with European leaders when the attack occurred, said he was returning to the U.K. and would be chairing an emergency \"COBRA\" meeting -- a gathering of senior officials to discuss and respond to national emergencies.\n\nLondon Mayor Sadiq Khan said in a post to X he was \"horrified by the violent attack.\"\n\nKhan said he had spoken with his counterpart in Manchester and Home Secretary Shabana Mahmood, \"and would like to reassure Londoners that the Met Police are stepping up patrols in Jewish communities and synagogues across London.\"\n\nKing Charles III and his wife, Queen Camilla, said in a statement they were \"deeply shocked and saddened to learn of the horrific attack in Manchester, especially on such a significant day for the Jewish community.\"\n\n\"Our thoughts and prayers are with all those affected by this appalling incident and we greatly appreciate the swift actions of the emergency services,\" the statement said.\n\nIsraeli Prime Minister Benjamin Netanyahu also spoke out, saying, \"Israel grieves with the Jewish community in the U.K. after the barbaric terror attack in Manchester. Our hearts are with the families of the murdered, and we pray for the swift recovery of the wounded. As I warned at the [United Nations]: weakness in the face of terrorism only brings more terrorism. Only strength and unity can defeat it.\"\n\nThe Israeli Embassy in the U.K. also condemned the attack, saying in a statement, \"That such an act of violence should be perpetrated on the holiest day of the Jewish calendar, in a place of prayer and community, is abhorrent and deeply distressing. ... The thoughts and prayers of the people of Israel are with the victims, their families, and the entire Jewish community at this difficult time.\"\n\nABC News' Victoria Beaule and Zoe Magee contributed to this report.\n\n- United Kingdom\n\n## Sponsored Content by Taboola\n\n## 1 injured after Delta regional jets collide at LaGuardia Airport, airline says\n\n- Oct 1, 11:23 PM\n\n## US is engaged in formal 'armed conflict' with 'terrorist' drug cartels, Trump says\n\n- Oct 2, 6:12 PM\n\n## Government shutdown updates: Senate to reconvene Friday, as shutdown enters 3rd day\n\n- 18 minutes ago\n\n## Charlotte train stabbing: Newly released 911 calls show shock over unprovoked attack\n\n- Oct 1, 5:31 PM\n\n### ABC News Live\n\n24/7 coverage of breaking news and live events",
      "source": "News Source",
      "date": "2025-10-03T10:12:41.107Z"
    },
    {
      "title": "How the world is responding to Israel’s interception of the Gaza flotilla | Israel-Palestine conflict News | Al Jazeera",
      "url": "https://www.aljazeera.com/news/2025/10/2/how-the-world-is-responding-to-israels-interception-of-the-gaza-flotilla?utm_source=valyu.network&utm_medium=referral&utm_campaign=ai_pilot&utm_content=ai_query",
      "image_url": {
        "0": "https://www.aljazeera.com/wp-content/uploads/2025/10/2025-10-01T221220Z_543277985_RC293HAMEAP2_RTRMADP_3_ISRAEL-PALESTINIANS-FLOTILLA-ARGENTINA-1759374749_ef8c31-1759377656.jpg?resize=1200%2C630&quality=80",
        "1": "https://www.aljazeera.com/wp-content/uploads/2025/10/2025-10-01T221220Z_543277985_RC293HAMEAP2_RTRMADP_3_ISRAEL-PALESTINIANS-FLOTILLA-ARGENTINA-1759374749.jpg?resize=770%2C513&quality=80",
        "2": "https://www.aljazeera.com/wp-content/uploads/2020/09/Al-Jazeera-Erin-1-1754975994.jpg?resize=96%2C96&quality=80",
        "3": "https://www.aljazeera.com/wp-content/uploads/2025/09/Faisal-Ali-Headshot-1756804692.jpg?resize=96%2C96&quality=80",
        "4": "https://www.aljazeera.com/wp-content/uploads/2025/10/2025-10-01T214358Z_1821733855_RC293HAQLD9G_RTRMADP_3_ISRAEL-PALESTINIANS-FLOTILLA-ITALY-1759374971.jpg?w=770&resize=770%2C512&quality=80"
      },
      "content": "How the world is responding to Israel’s interception of the Gaza flotilla | Israel-Palestine conflict News | Al Jazeera\n\nA Pro-Palestinian demonstrator holds a flare during a rally in solidarity with the Global Sumud Flotilla and Gaza, in Buenos Aires, Argentina, on October 1, 2025 [Pedro Lazaro Fernandez/Reuters]\n\nBy Erin Hale, Faisal Ali and News AgenciesPublished On 2 Oct 20252 Oct 2025Click here to share on social mediashare2SharefacebooktwitterwhatsappcopylinkSave\n\nIsrael has intercepted the [Global Sumud Flotilla](https://www.aljazeera.com/news/liveblog/2025/9/2/live-geta-thunberg-once-more-on-board-sumud-flotilla-sailing-for-gaza) (GSF) while en route to Gaza, leading to swift criticism from global leaders as protesters gather in cities around the world, including Istanbul, Athens, Buenos Aires, Rome, Berlin, and Madrid, to condemn the raid.\n\nAt least 44 countries were represented in the 500-person flotilla, including the United States, the United Kingdom, Belgium, Spain, Malaysia, Turkiye and Colombia.\n\n## Recommended Stories\n\nlist of 4 items\n\n- list 1 of 4[Ethiopia church scaffolding collapse kills 36 during religious festival](https://www.aljazeera.com/news/2025/10/1/ethiopia-church-scaffolding-collapse-kills-36-during-religious-festival) - list 2 of 4[Israel kills journalist Yahia Barzaq known for his newborn baby portraits](https://www.aljazeera.com/video/newsfeed/2025/10/1/israel-kills-journalist-yahia-barzaq-known-for-his-newborn-baby-portraits) - list 3 of 4[Israeli forces board Gaza-bound aid flotilla, detain activists](https://www.aljazeera.com/news/2025/10/1/israeli-forces-board-gaza-flotilla-detain-greta-thunberg-other-activists) - list 4 of 4[Israel intercepts Gaza Sumud flotilla vessels: What we know so far](https://www.aljazeera.com/news/2025/10/1/israel-intercepts-gaza-sumud-flotilla-vessels-what-we-know-so-far)\n\nend of list\n\nReactions from world leaders have ranged from outright condemnation to calls for Israel to provide their detained citizens with access to consular services.\n\nHere are some of the responses so far:\n\nPro-Palestinian demonstrators take part in a protest to condemn the interception of the vessels of the Global Sumud Flotilla, in Rome, Italy, on October 1, 2025 [Yara Nardi/Reuters]\n\n## Palestine\n\nThe Palestinian Foreign Ministry said it “condemns Israel’s attack and aggression against the Global Sumud Flotilla” in a post on X. “The Global Sumud Flotilla has the right of free passage in international waters, and Israel must not interfere with its freedom of navigation, long recognised under international law”, it added.\n\n## Turkiye\n\nTurkiye’s Ministry of Foreign Affairs called Israel’s intervention “an act of terrorism” that violated international law and endangered the lives of innocent civilians.\n\nThe ministry said Israel’s actions also demonstrated that “the fascist and militarist policies pursued by the genocidal Netanyahu government — which has condemned Gaza to famine — are not limited to Palestinians”.\n\nAdvertisement\n\nLater, President Recep Tayyip Erdoğan said Israel was engaged in “banditry” for targeting the flotilla, adding: “Türkiye supports all passengers of hope aboard the flotilla. We are taking measures to protect activists, our citizens aboard the flotilla.”\n\n## Malaysia\n\nPrime Minister Anwar Ibrahim called for the immediate release of Malaysian citizens. In a statement on X, he said it would take “all lawful and legally grounded measures to hold Israel accountable”.\n\nIsrael was not only disregarding “the basic rights of the Palestinian people but has also trampled on the conscience of the global community”, he said.\n\n## South Africa\n\nSouth Africa’s President Cyril Ramaphosa has called for the immediate release of the participants of the flotilla and confirmed that those detained include Nelson Mandela’s grandson, Nkosi Zwelivelile “Mandla” Mandela.\n\nThe statement added: “South Africa calls on Israel to ensure that the life-saving cargo transported by this flotilla reaches the people of Gaza, as the flotilla represents solidarity with Gaza, not confrontation with Israel.”\n\n## Colombia\n\nPresident Gustavo Petro announced on X that his government was expelling Israeli diplomats and cancelling Colombia’s free trade agreement in light of Israel’s actions.\n\nHe said Colombia “must pursue all the appropriate demands, including through Israeli courts” to ensure the return of its citizens.\n\nPeople protest to condemn the interception of GSF vessels, in front of the US embassy in Ankara, Turkiye, October 1, 2025 [Efekan Akyuz/Reuters]\n\n## Italy\n\nItalian Foreign Minister Antonio Tajani told local media Israel had assured him there would be “no violent actions” against the flotilla.\n\nItalian unions separately called for a general strike on Friday to show their solidarity with the GSF and Gaza, following a strike in September by Unione Sindacale di Base and other protests at Italian ports.\n\nThe country’s prime minister, Giorgia Meloni, said her government would “do everything we can to ensure these people can return to Italy as soon as possible” but [criticised the flotilla and subsequent protests](https://www.aljazeera.com/amp/news/2025/10/1/israeli-forces-board-gaza-flotilla-detain-greta-thunberg-other-activists) organised by Italy’s largest trade union in solidarity with the activists as bringing no benefit to the Palestinian people.\n\n## United Kingdom\n\nThe UK government has said that it is “very concerned” about Israel’s interception of the flotilla and added that it is in “touch with the families of a number of British nationals involved.”\n\n“The aid carried by the flotilla should be turned over to humanitarian organisations on the ground to be delivered safely into Gaza.”\n\nAdvertisement\n\n## Germany\n\nThe foreign ministry spokesperson has called on Israel to “comply with their obligations under international law and to act with proportionality”. Berlin added: “We also called for the protection of all those on board to be guaranteed, to our knowledge, this has been done.”\n\n## Spain\n\nMadrid released a statement on Wednesday demanding the “physical integrity and rights of Spanish citizens be respected” and said its consular teams were monitoring the situation from Nicosia and Jerusalem. Spain’s Prime Minister, Pedro Sánchez, told reporters on the sidelines of the EU Summit that his government was extending diplomatic protection to all Spanish citizens aboard the flotilla.\n\n## Greece\n\nGreece issued a joint statement with Italy earlier this week, calling for Israel “to ensure the safety and security of the participants and to allow for all consular protection measures”.\n\n## Ireland\n\nIrish President Michael D Higgins said Israel was preventing essential aid from reaching Gaza. “The safety and protection of those involved in this humanitarian exercise is a concern for all of us and all of the nations from which the people come,” he said in a statement.\n\n## Pakistan\n\nPrime Minister Shehbaz Sharif has condemned what he called a “dastardly attack” by Israeli forces on the flotilla, saying that he was praying for the safe release of those detained. Sharif said: “This barbarity must end. Peace must be given a chance and humanitarian aid must reach those in need.”\n\n## Belgium\n\nBelgium’s Foreign Minister Maxime Prevot urged the Israeli government to respect international law in a statement on X. He said his top priority was to ensure “the rights of our compatriots are respected, that their safety is guaranteed, and that they can return home as quickly as possible”.\n\nA pro-Palestinian demonstrator takes part in a march in Mexico City, Mexico, October 1, 2025 [Quetzalli Nicte-Ha/Reuters]\n\n## France\n\nThe Ministry for Europe and Foreign Affairs called on Israel to grant the French citizens participating in the flotilla access to consular services and “allow them to return to France without undue delay”.\n\nThe France Unbowed party, which had close to half a dozen of its parliamentarians participating, accused Israel of carrying out an act of “piracy against the Global Sumud Flotilla”. Jean-Luc Mélenchon, the party’s leader, called France’s foreign minister, Jean-Noël Barrot, an “incompetent fool”, accusing him of siding with Netanyahu. “He brings shame to our country,” he said on X.\n\n## United States\n\nEarlier this week, 20 Democratic legislators urged the White House to take action to protect the flotilla.\n\nCouncil on American-Islamic Relations (CAIR), the US largest Muslim advocacy group said Israel’s move on the flotilla show it would “kidnap humanitarian activists and engage in piracy in international waters”.\n\nThe organsations Deputy Executive Director, Edward Ahmed Mitchell, said: “Every nation that pays lip service to international law should condemn this illegal attack on the Global Sumud Flotilla and take their own steps to forcibly break the siege of Gaza.”\n\nAdvertisement\n\n## United Nations\n\nWhile the UN itself has not responded yet to the arrests of the activists, Francesca Albanese, the UN special rapporteur on Palestine, said the Israeli intervention against the flotilla highlighted the West’s inaction towards Prime Minister Benjamin Netanyahu’s government.\n\n“As I watch Israel’s illegal abduction of the only humans who have risked their lives to break Israel’s unlawful blockade, my thoughts are with the people of Gaza, trapped in Israel’s killing fields,” Albanese wrote on X.\n\n“Shame on Western governments first and foremost, and their complicit inaction.”",
      "source": "News Source",
      "date": "2025-10-03T10:12:41.107Z"
    },
    {
      "title": "Manchester synagogue attacker named as Jihad Al-Shamie",
      "url": "https://www.bbc.com/news/articles/cpd93x0ql0do?utm_source=valyu.network&utm_medium=referral&utm_campaign=ai_pilot&utm_content=ai_query",
      "image_url": {
        "0": "https://ichef.bbci.co.uk/news/1024/branded_news/3d24/live/ee9ed3b0-9fa2-11f0-92db-77261a15b9d2.jpg",
        "1": "https://static.files.bbci.co.uk/bbcdotcom/web/20250919-090805-05e5ba0164-web-2.30.1-2/grey-placeholder.png",
        "2": "https://ichef.bbci.co.uk/news/480/cpsprodpb/3d24/live/ee9ed3b0-9fa2-11f0-92db-77261a15b9d2.jpg.webp",
        "3": "https://ichef.bbci.co.uk/news/480/cpsprodpb/b325/live/0a20ddc0-9fd2-11f0-b741-177e3e2c2fc7.png.webp",
        "4": "https://ichef.bbci.co.uk/news/480/cpsprodpb/bd71/live/4a751920-9f7a-11f0-928c-71dbb8619e94.png.webp"
      },
      "content": "# Police name Manchester attacker who killed two at synagogue\n\nA man who carried out an attack at a synagogue in Manchester on Thursday which left two Jewish people dead and three others injured has been named by police as Jihad Al-Shamie.\n\nAl-Shamie, a 35-year-old British man of Syrian descent, drove a car at people outside the Heaton Park Hebrew Congregation Synagogue before attacking bystanders with a knife. He was shot dead by police at the scene.\n\nGreater Manchester Police (GMP) said three further people had been arrested as part of the investigation and declared it a \"terrorist incident\".\n\nPrime Minister Sir Keir Starmer condemned the attack, which took place on Yom Kippur - the holiest day in the Jewish calendar.\n\n- How the Manchester synagogue attack unfolded\n\n- Watch: Armed police at the scene of Manchester synagogue attack\n\n- What we know about Manchester synagogue attack\n\n- Starmer vows to protect Jewish communities after Manchester attack\n\nSir Keir said that \"additional police assets\" would be deployed at synagogues across the country, while London Mayor Sir Sadiq Khan said that \"high visibility\" policing in and around synagogues in the capital would also be \"stepped up\".\n\nChief Rabbi Sir Ephraim Mirvis said the attack in Crumpsall, north Manchester, was the \"tragic result\" of an \"unrelenting wave of Jew hatred on our streets, campuses, on social media and elsewhere\".\n\n\"This is the day we hoped we would never see, but which deep down, we knew would come,\" he added.\n\nThe three injured men include one who was stabbed, a second who was struck by the vehicle and a third who later went to hospital with an injury \"that may have been sustained as officers stopped the attacker\", GMP says.\n\nGMP said that two men in their 30s and a woman in her 60s had been arrested on suspicion of the commission, preparation and instigation of acts of terrorism.\n\nA spokesman for the force added that a suspicious device worn by the attacker during the incident had been assessed and found not to be a viable explosive.\n\nHe added that no referrals related to Al-Shamie had been made to Prevent - the government's anti-radicalisation scheme.\n\nIt is understood that Al-Shamie entered the UK as a young child, and was granted British citizenship in 2006 as a minor.\n\nPolice responded to reports of a car driving at members of the public at 09:31 on Thursday morning, after which officers quickly declared a major incident.\n\nEyewitnesses describe how security staff prevented the attacker from getting into the synagogue.\n\nVideo footage from the scene shows armed officers pointing their weapons at a man on the ground, warning people the man has \"a bomb on him\" and urging bystanders to back away.\n\nAt 09:38, as the man tries to get up, officers shoot him - just seven minutes after the initial call to the police.\n\nOfficers, synagogue security and rabbi Daniel Walker were commended by the prime minister for preventing a worse tragedy.\n\nSir Keir returned to the UK early from a summit of European leaders in Denmark in response to the incident, and later visited an unnamed synagogue.\n\nSpeaking from Downing Street after a Cobra emergency committee meeting, Sir Keir condemned the \"terrorist attack\", adding the suspect \"attacked Jews because they are Jews\".\n\nAddressing the Jewish community in the UK, he said: \"I promise you that I will do everything in my power to guarantee you the security that you deserve, starting with a more visible police presence, protecting your community.\n\n\"I promise you that over the coming days, you will see the other Britain, the Britain of compassion, of decency, of love.\"\n\nRobin Simcox, commissioner for countering extremism, told the BBC's Newsnight programmne that there was an \"early indicator\" that the attack was \"Islamist\" because of the dummy suicide vest the suspect was wearing.\n\nHe added: \"Something pretty fundamental has changed in the UK over the past couple of years, where Jews are now openly saying they don't feel safe and they're not sure if they see a future for themselves in the United Kingdom.\"\n\nA witness at the scene says prayers had started when the attack happened but Rabbi Daniel Walker, who was leading the service, remained calm as he and others led the congregation to safety.\n\nA woman, who described herself as a religious Jew who lives next door to the synagogue, says that as soon as the suspect got out of the car he \"started stabbing anyone near him\".\n\nShe told the Daily Mail: \"Rabbi Walker was incredibly calm, he shut the doors to the synagogue to stop him getting inside.\n\n\"He barricaded everyone inside. He is a hero, this could have been even worse.\"\n\nGMP chief constable Sir Stephen Watson said there had been many worshippers inside the synagogue at the time of the incident.\n\nHe praised security staff and worshippers who had shut the attacker out, saying that thanks to the \"immediate bravery of security staff and the worshippers inside, as well as the fast response of the police, the attacker was prevented from gaining access\".\n\nGreater Manchester Mayor Andy Burnham said: \"Tonight, our first thoughts are with the families of those people who died, those injured and those traumatised by this, an horrific antisemitic attack on our Jewish friends and neighbours. We condemn it outright.\n\n\"Greater Manchester will never stand aside when one of our communities is attacked.\"\n\nOn Thursday evening, a GMP spokesman said crime scenes remained in place on White House Avenue, Crumpsall and Langley Crescent, Prestwich, which were linked to the arrests made earlier.\n\nListen to the best of BBC Radio Manchester on Sounds and follow BBC Manchester on Facebook, X, and Instagram. You can also send story ideas via Whatsapp to 0808 100 2230.\n\n## Eyewitnesses describe Manchester synagogue attack\n\n## What we know about Manchester synagogue attack",
      "source": "News Source",
      "date": "2025-10-03T10:12:41.107Z"
    },
    {
      "title": "Morocco GenZ 212 demonstrations: Police say two shot dead in 'self-defence'",
      "url": "https://www.bbc.com/news/articles/cgrqpekyxpvo?utm_source=valyu.network&utm_medium=referral&utm_campaign=ai_pilot&utm_content=ai_query",
      "image_url": {
        "0": "https://ichef.bbci.co.uk/news/1024/branded_news/56aa/live/c7c27130-9f7e-11f0-8978-23dd7eb26e73.jpg",
        "1": "https://static.files.bbci.co.uk/bbcdotcom/web/20250919-090805-05e5ba0164-web-2.30.1-2/grey-placeholder.png",
        "2": "https://ichef.bbci.co.uk/news/480/cpsprodpb/56aa/live/c7c27130-9f7e-11f0-8978-23dd7eb26e73.jpg.webp",
        "3": "https://ichef.bbci.co.uk/news/480/cpsprodpb/0a19/live/7c722dc0-089d-11ef-b9d8-4f52aebe147d.jpg.webp",
        "4": "https://ichef.bbci.co.uk/news/480/cpsprodpb/3c01/live/ea219560-9ea4-11f0-b741-177e3e2c2fc7.jpg.webp"
      },
      "content": "# First killings in Morocco since Gen Z protests erupted\n\nAt least two people have been killed in Morocco after police opened fire to prevent protesters from storming a police station in Lqliaa, near the coastal city of Agadir, state media says.\n\nThese are the first deaths reported since huge youth-led protests broke out across Morocco on Saturday as anger grew over the government's decision to build football stadiums for the 2030 Fifa World Cup rather than improving public services and tackling the economic crisis.\n\n\"Stadiums are here, but where are the hospitals?\" is a popular chant among the Gen Z protesters.\n\nOne demonstrator told BBC Newsday that the hospital in his city, Oujda, on the border with Algeria, was like a \"jail\".\n\nIt was dirty, and patients had to bribe security officers and nurses to see a doctor, said the protester, who spoke on condition of anonymity as he feared reprisals.\n\nThe protests have been happening at night, with police saying they were forced to open fire \"in legitimate self-defence\" on Wednesday evening to repel the \"attack\" in Lqliaa, the state-owned news agency reported.\n\nEarlier on Wednesday, the interior ministry said the right of people to protest within the law would be upheld.\n\nOrganisers of the youth-led protest movement known as GenZ 212 - the number referring to Morocco's international dialling code - have distanced themselves from the violence. They have been rallying mainly through social media, and do not have a formal leadership structure.\n\nOfficial statistics show that Morocco's unemployment rate stands at 12.8%, with youth unemployment soaring to 35.8% and 19% among graduates, news agency Reuters reports.\n\nProtests have also hit the capital, Rabat, the main commercial city, Casablanca, and the port city of Tangier - the arrival point for tourists going to Morocco by ferry from Spain.\n\nMorocco's tourist hub, Marrakesh, was also hit by violence, with protesters burning a police station, according to local media.\n\nInterior ministry spokesman Rachid El Khalfi said that 409 people have been detained across Morocco following the unrest.\n\nMore than 260 police officers and 20 protesters have been injured, while 40 police vehicles and 20 private cars have been torched, he was quoted as saying.\n\nThe uprising follows similar youth-led, large scale demonstrations this summer in Nepal, Indonesia, the Philippines and Madagascar.\n\nThe uprising in Nepal led to the prime minister resigning, while Madagascar's president dissolved his government on Monday in an attempt to placate the protesters there.\n\nMorocco's governing coalition issued a statement on Tuesday expressing willingness to engage in dialogue with the youth \"within institutions and public spaces to find realistic solutions\".\n\nIt also praised what it called \"the balanced reaction of security authorities in line with relevant legal procedures\".\n\n## You may also be interested in:\n\n- The Gen Z uprising in Asia shows social media is a double-edged sword\n\n- Politicians get rich while we suffer - so I helped bring down our government in 48 hours\n\n- Madagascar police fire tear gas as president fails to placate protesters\n\nGo to BBCAfrica.com for more news from the African continent.\n\n## Focus on Africa\n\n## This Is Africa",
      "source": "News Source",
      "date": "2025-10-03T10:12:41.107Z"
    },
    {
      "title": "Eiffel Tower closes amid strikes held across France against austerity - ABC News",
      "url": "https://abcnews.go.com/International/wireStory/eiffel-tower-closed-nationwide-strikes-held-france-austerity-126152581?utm_source=valyu.network&utm_medium=referral&utm_campaign=ai_pilot&utm_content=ai_query",
      "image_url": {
        "0": "https://i.abcnewsfe.com/a/e3c8a286-3538-4831-83b3-4b70d09739ae/wirestory_6e229da30e2dbe51bdb00b1416cb4a91_16x9.jpg?w=1600",
        "1": "https://s.abcnews.com/assets/dtci/images/ios-2022.png",
        "2": "https://s.abcnews.com/assets/dtci/images/android-2022.png",
        "3": "https://i.abcnewsfe.com/a/e3c8a286-3538-4831-83b3-4b70d09739ae/wirestory_6e229da30e2dbe51bdb00b1416cb4a91_16x9.jpg?w=992",
        "4": "https://i.abcnewsfe.com/a/d8e42500-3995-474f-aa7a-763f6ad7657d/maine-election-ballot-ap-jef-251002_1759411828636_hpMain_square.jpg?w=208"
      },
      "content": "# Eiffel Tower closes amid strikes held across France against austerity\n\nProtesters have taken to the streets in Paris and over 200 other locations across France to denounce spending cuts and demand higher taxes on the wealthy\n\nPARIS -- Protesters took to the streets of more than 200 towns and cities across France on Thursday to denounce spending cuts and demand higher taxes on the rich.\n\nIn Paris, thousands of workers, retirees and students started marching on Thursday afternoon from Place d'Italie. The Eiffel Tower informed visitors in a statement it was closed due to the strike.\n\nThe nationwide strike, called by France’s major unions, was the latest of a series of protests that started last month amid political turmoil and heated budget talks.\n\nUnions are urging Prime Minister Sébastien Lecornu to abandon draft budget measures proposed by his predecessor, which include social welfare freezes and austerity measures that many say will further erode the purchasing power of low-paid and middle-class workers. They also call for higher taxes on the wealthy.\n\nLecornu, appointed last month, has not yet unveiled the details of his budget plans and has yet to appoint his government ministers, which is expected in the coming days. The deeply divided parliament is to debate the budget bill by the end of the year.\n\nSophie Binet, head of the CGT union, said Thursday: “It’s true, it’s the first time that there are three days of strikes and protests in a month without a government or budget. It shows the level of social anger.”\n\nSpeaking on BFM TV news broadcaster, she was asked about the timing of the latest action: “Why are we protesting now? Because we feel that it’s now that the decisions are being made, and we want to be heard.”\n\n## Woman claims Amazon delivery box came stuffed with hundreds of blank ballots\n\n- Oct 2, 3:03 PM\n\n## Vatican's Swiss Guards have a new uniform — but don't worry, the iconic one remains\n\n- Oct 2, 11:48 AM\n\n## Actress Lori Loughlin and Mossimo Giannulli separate, rep confirms\n\n- Oct 2, 7:19 PM\n\nThe French Interior Ministry said 85 000 protesters had taken to the street by midday outside Paris.\n\nSNCF, the national rail company, said high-speed train services were running normally Thursday while some regional lines were affected by partial disruptions. In Paris, metro traffic was close to normal but many commuting trains were running at reduced capacity.\n\nSome teachers and health care workers have also joined the strike, but overall, early figures appeared to show less people responded to the unions’ call than last month.\n\nOn Sept. 18, more than 500,000 demonstrators marched in France’s small towns and big cities, including Paris, according to figures from police and interior ministry. Unions reported more than 1 millions strikers and protesters nationwide.\n\nThe week before, a day of anti-government action across France saw streets choked with smoke, barricades in flames and volleys of tear gas amid the “Block Everything” campaign.\n\n- France\n\n## Sponsored Content by Taboola\n\n## Former Des Moines superintendent who was detained by ICE federally charged\n\n- Oct 2, 5:49 PM\n\n## Vatican's Swiss Guards have a new uniform — but don't worry, the iconic one remains\n\n- Oct 2, 11:48 AM\n\n## Actress Lori Loughlin and Mossimo Giannulli separate, rep confirms\n\n- Oct 2, 7:19 PM\n\n## Woman claims Amazon delivery box came stuffed with hundreds of blank ballots\n\n- Oct 2, 3:03 PM\n\n### ABC News Live\n\n24/7 coverage of breaking news and live events",
      "source": "News Source",
      "date": "2025-10-03T10:12:41.107Z"
    },
    {
      "title": "Russia-Ukraine war: List of key events, day 1,316 | News | Al Jazeera",
      "url": "https://www.aljazeera.com/news/2025/10/2/russia-ukraine-war-list-of-key-events-day-1316?utm_source=valyu.network&utm_medium=referral&utm_campaign=ai_pilot&utm_content=ai_query",
      "image_url": {
        "0": "https://www.aljazeera.com/wp-content/uploads/2025/10/AFP__20251001__77DF9T3__v1__HighRes__UkraineRussiaConflictWar-1759388000.jpg?resize=1920%2C1440",
        "1": "https://www.aljazeera.com/wp-content/uploads/2025/10/AFP__20251001__77DF9T3__v1__HighRes__UkraineRussiaConflictWar-1759388000.jpg?resize=770%2C513&quality=80",
        "2": "https://www.aljazeera.com/wp-content/uploads/2020/09/Al-Jazeera-Erin-1-1754975994.jpg?resize=96%2C96&quality=80"
      },
      "content": "Russia-Ukraine war: List of key events, day 1,316 | News | Al Jazeera\n\nUkraine's President Volodymyr Zelenskyy holds a flag insignia as a serviceman pays his respect during a ceremony marking Defenders Day, October 1, 2025 [Handout/Ukrainian Presidential Press Service via AFP]\n\nBy Erin HalePublished On 2 Oct 20252 Oct 2025Click here to share on social mediashare2SharefacebooktwitterwhatsappcopylinkSave\n\nHere is how things stand on Thursday, October 2, 2025:\n\n## Fighting\n\n- Russia’s military seized 447 square kilometres (172.6 square miles) of territory from Ukraine in September. Analysis by the United States-based Institute for the Study of War shows that it’s slowing down from a recent peak in July when it seized 634sq km (244.8 square miles). - Russian shelling near the town of Slavutych cut external power to the decommissioned Chornobyl power plant on Wednesday. - Ukrainian President Volodymyr Zelenskyy accused Russia of trying to orchestrate a nuclear incident, as external power is also needed for a new containment unit. - The shelling also led to more than 3,000 people losing power in the nearby Chernihiv region.\n\n## Politics and Diplomacy\n\n- Zelenskyy will meet 50 heads of state, government and European Union leaders in Copenhagen on Thursday. - Russian Defence Minister Andrei Belousov met his North Korean counterpart, No Kwang Chol, on Wednesday, according to Russian state media. - French navy personnel boarded an oil tanker linked to Russia’s shadow fleet and arrested two senior crew members. The vessel was previously linked to drone flights over Denmark. - The US will supply Ukraine with intelligence to hit long-range targets inside Russia, according to a report in The Wall Street Journal citing US officials. Washington has asked NATO allies to do the same. - Danish Prime Minister Mette Frederiksen said Europe is facing the greatest security challenge since the end of World War II, and it must step up its response to Russian hybrid warfare during a meeting with EU leaders. - A Polish court said a Ukrainian national arrested in connection with the Nord Stream gas pipeline explosion must stay in custody until a decision can be made about his transfer to Germany, where he is wanted for suspected sabotage.\n\nAdvertisement\n\n## Economy\n\n- European leaders on Wednesday discussed whether to use frozen Russian assets to fund a new 140 billion euros ($164bn) loan to Kyiv. Most of the assets are frozen in Belgium. - Russian regulators have again blocked the sale of Austria’s Raiffeisen Bank International, the largest lender still operating in Russia without sanctions, the Reuters news agency reported, citing two people familiar with the matter. - The Group of Seven says it will put pressure on countries that continue to buy Russian oil or help Moscow to circumvent restrictions. - Hungarian Prime Minister Viktor Orban said US President Donald Trump had not told him to stop buying Russian oil, as demanded by the latter from NATO members.",
      "source": "News Source",
      "date": "2025-10-03T10:12:41.107Z"
    },
    {
      "title": "Ukraine-Russia war latest: Putin says ‘impossible to believe’ ...",
      "url": "https://www.independent.co.uk/news/world/europe/ukraine-russia-war-live-trump-putin-zelensky-missiles-drones-b2836998.html?utm_source=valyu.network&utm_medium=referral&utm_campaign=ai_pilot&utm_content=ai_query",
      "image_url": {
        "0": "https://static.independent.co.uk/2025/10/03/4/09/RUSSIA-POLITICS-PUTIN-5r5frk5y.jpeg?width=1200&height=800&crop=1200:800",
        "1": "https://static.independent.co.uk/2025/09/26/16/28/Russia-Putin-pid6n4yu.jpeg?quality=75&width=230&crop=3%3A2%2Csmart&auto=webp",
        "2": "https://static.independent.co.uk/2024/03/12/18/Russia_Ukraine_War_Military_Aid_81770.jpg?quality=75&width=230&crop=3%3A2%2Csmart&auto=webp",
        "3": "https://static.independent.co.uk/2025/09/19/20/19195459-fc8dd895-c745-4870-8623-cfc70a98b620.jpg?width=1200&height=800&crop=1200:800",
        "4": "https://static.independent.co.uk/2025/09/16/05/Russia_Belarus_Military_Drills_83642.jpg?width=1200&height=800&crop=1200:800"
      },
      "content": "Zelensky warns Europe of drone attacks after 'treacherous' Ukraine strikes\n\nRussian president Vladimir Putin has said it is ‘impossible to believe” that [Moscow](https://www.independent.co.uk/topic/moscow) wants a war with [Nato](https://www.independent.co.uk/topic/nato) nations.\n\nPutin said that while [Europe](https://www.independent.co.uk/topic/europe)’s “ruling elites” have warned a war with [Russia](https://www.independent.co.uk/topic/russia) is near, it is “impossible to believe” as it will run against Russia’s security interests. He was speaking yesterday at the Valdai Discussion Club, a forum of Russia experts, in the city of Sochi.\n\nPutin has also warned [Donald Trump](https://www.independent.co.uk/topic/donald-trump) that if he provides [Ukraine](https://www.independent.co.uk/topic/ukraine) with [Tomahawk](https://www.independent.co.uk/topic/tomahawk) missiles it would be a “new stage of escalation”.\n\n[US](https://www.independent.co.uk/topic/us) vice president [JD Vance](https://www.independent.co.uk/topic/jd-vance) said on Sunday that [Washington](https://www.independent.co.uk/topic/washington) was considering a Ukrainian request to obtain long-range Tomahawks that could reach targets deep into Russia, including Moscow.\n\n\"Using Tomahawks without the direct participation of American military personnel is impossible. This would mark a completely new, qualitatively new stage of escalation, including in relations between Russia and the United States,” Putin said.\n\nIt comes as the US is set to provide [Ukraine](https://www.independent.co.uk/topic/ukraine)with intelligence to carry out long-range strikes on energy infrastructure targets inside [Russia](https://www.independent.co.uk/topic/russia), according to reports.\n\nRecommended\n\n- [Russia ‘using deadly new missile upgrade’ to bypass Ukraine’s Patriot air defence systems](https://www.independent.co.uk/news/world/europe/russia-ballistic-missiles-ukraine-patriot-air-defence-b2837982.html) - [Putin says Charlie Kirk’s ‘disgusting’ murder is proof of a ‘deep rift’ in America](https://www.independent.co.uk/news/world/americas/us-politics/putin-charlie-kirk-murder-american-rift-b2838365.html) - [‘I think she’s dead’: Frantic 911 calls moments after Ukraine refugee’s fatal stabbing released](https://www.independent.co.uk/news/world/americas/crime/iryna-zarutska-charlotte-ukraine-911-call-b2837912.html) - [Europe mulls using frozen Russian assets to fund loan to Ukraine](https://www.independent.co.uk/news/world/europe/eu-ukraine-russian-assets-loan-b2837444.html)\n\n### Washington weighs $51mn in arms sales to Ukraine: Kyiv Post\n\nThe Trump administration this week formally notified congress of a $51mn arms sale to Ukraine and its allies, two sources told the Kyiv Post.\n\nAn official told the outlet the step ‘signals a sustained US commitment to supplying Kyiv’, despite concern that a government shut down could disrupt the flow of aid to Europe.\n\nOne of the reported shipments was said to be a $1mn package for firearms, parts, and components for Ukraine.\n\nThe other was described as a wider $50mn package ‘in defense articles, including technical data and defense services’ for Ukraine, the UK and Belgium, the outlet reported.\n\nJames Reynolds3 October 2025 11:05\n\n### Ukraine strikes Russian chemical plant 1,700km from frontlines\n\nUkrainian drones struck a Russian chemical plant some 1,700 kilometres from the frontlines overnight, according to local officials.\n\nRegional Governor Dmitry Makhonin said that Ukraine had hit the Azot chemical plant in Perm Krai on Thursday into Friday.\n\nThe plant is one of Russia’s largest nitrogen fertiliser producers and supplies chemicals for both agriculture and explosives.\n\nJames Reynolds3 October 2025 10:28\n\n### Russia is trying to jam UK military satellites 'weekly', head of Space Command says\n\nRussian forces are regularly attempting to jam UK military satellites, the head of UK Space Command has revealed.\n\nMajor General Paul Tedman told the BBC that these efforts to disrupt UK-based military activities occur \"weekly\", with Russia also closely monitoring the country’s space assets.\n\n\"We’re seeing our satellites being jammed by the Russians on a reasonably persistent basis,\" Maj Gen Tedman stated.\n\nRead the full article:\n\n### Space command boss warns Russia is targeting UK satellites on a ‘weekly’ basis\n\nThe UK and the US conducted their first co-ordinated satellite manoeuvre in space last month\n\nJames Reynolds3 October 2025 10:01\n\n### Russia detains suspect 'recruited by Ukraine for attacks on infrastructure'\n\nRussia’s FSB security service claimed to have detained a 53-year-old Russian man alleged to have been recruited by Ukraine for acts of “sabotage and terrorism”, the Russian TASS news agency reported on Friday.\n\nThe suspect was alleged to have been recruited “to gather intelligence regarding military installations on the peninsula and to prepare acts of sabotage and terrorism,” the FSB told the agency.\n\nThe FSB said the suspect had taken components of an IED from a cache and sent photos of the deployment of two S-300 air defence systems in Crimea and their coordinates to the Ukrainian special service by WhatsApp.\n\nThe FSB claimed he had confessed and been remanded in custody.\n\nJames Reynolds3 October 2025 09:30\n\n### What do we know about the Munich airport shutdown?\n\nMunich airport was shut down temporarily late on Thursday following a string of reported drone sightings in the area, the airport said.\n\nOfficials said that 17 flights were unable to take off, affecting almost 3,000 passengers. Fifteen arriving flights were diverted to three other airports in Germany and one in Austria.\n\nAmid heightened concern over recent drone sightings and incursions attributed to Russia, European authorities and foreign media have expressed concerns that Russia could be behind the incident in Munich.\n\nThere was no immediate confirmation of where the drones came from. The airport has since reopened.\n\nCopenhagen and Oslo airports were recently forced to shut after drones were sighted near airports and military airspaces. Russian authorities rejected claims of involvement in recent drone incidents in Denmark.\n\nDanish authorities said there was no evidence Russia was involved.\n\nJames Reynolds3 October 2025 09:00\n\n### Putin says ‘impossible to believe’ Moscow wants a war with Nato\n\nRussian president Vladimir Putin has said it is ‘impossible to believe” that Moscow wants a war with Nato nations.\n\nPutin said that while Europe’s “ruling elites” have warned a war with Russia is near, it is “impossible to believe” as it will run against Russia’s security interests. He was speaking yesterday at the Valdai Discussion Club, a forum of Russia experts, in the city of Sochi.\n\nHe also said Europeans are sceptical as they “don’t know what is so bad about Russia and why they should tighten their belts to counter Russia”.\n\nRussian president Vladimir Putin answers questions during a meeting with foreign policy experts at the Valdai Discussion Club in the Black Sea resort of Sochi (AP)\n\nArpan Rai3 October 2025 08:00\n\n### Russia ‘using deadly new missile upgrade’ to bypass Ukraine’s Patriot air defence systems\n\nRussia appears to have upgraded its ballistic missiles in use against Ukraine to bypass US-made Patriot air defence systems, according to a report.\n\nThe upgrades likely involve Russia’s Iskander-M and Kinzhal missiles, which have ranges of up to 500km and 480km respectively. These missiles follow a standard flight path before suddenly diving steeply, making interception by Patriot systems difficult, Ukrainian and Western officials told the Financial Times.\n\nOne former Ukrainian official described it as a “game-changer for Russia”.\n\nUkraine’s missile interception rate has dropped sharply in recent months, from 37 per cent in August to just 6 per cent in September, the FT reported, citing Ukrainian Air Force data.\n\n### Russia ‘using deadly new missile upgrade’ to bypass Ukrainian air defence systems\n\nA former Ukrainian official described it as a ‘game-changer for Russia’\n\nArpan Rai3 October 2025 07:49\n\n### Putin warns Trump of escalation if US gives Kyiv Tomahawk missiles\n\nVladimir Putin has warned Donald Trump that if he provides Ukraine with Tomahawk missiles it would be a “new stage of escalation”.\n\nUS vice president JD Vance said on Sunday that Washington was considering a Ukrainian request to obtain long-range Tomahawks that could reach targets deep into Russia, including Moscow.\n\nSpeaking at the Valdai Discussion Club, a forum of Russia experts, in the city of Sochi, he said: \"Using Tomahawks without the direct participation of American military personnel is impossible. This would mark a completely new, qualitatively new stage of escalation, including in relations between Russia and the United States.\"\n\nIn recent weeks Mr Trump has sharply shifted how he talks about the war in Ukraine, suggesting Kyiv could retake all the land Russia has seized and calling the Russian military a \"paper tiger.\"\n\nArpan Rai3 October 2025 07:44\n\n### Russia tracking British military satellites, says UK space command chief\n\nRussia is tracking British military satellites using its own satellites, the head of the UK space command has said.\n\n\"They're interested in what we're doing and flying relatively close,\" he said,” Maj Gen Paul Tedman told BBC.\n\nThe UK operates approximately six dedicated military satellites for communications and surveillance, which Maj Gen Tedman said were equipped with counter-jamming technology.\n\n\"They've got payloads on board that can see our satellites and are trying to collect information from them,” he said, sharing the level of interference from Moscow against British space-based assets.\n\nGen Paul said Russia had also been trying to jam the UK's military satellites with ground-based systems every week.\n\nBetween 4 September and 12 September, a US satellite was repositioned in orbit to inspect a UK satellite and confirm it was functioning properly.\n\nThe test was part of Operation Olympic Defender, a joint military framework aimed at improving satellite defence and resilience.\n\n“Expertly executed with US Space Command, I could not be more pleased or proud of the rapid progress we are making with our allies,” Maj Gen Tedman said.\n\n### Russia targeting UK satellites on ‘weekly’ basis, UK Space Command boss says\n\nThe UK operates approximately six dedicated military satellites for communications and surveillance.\n\nArpan Rai3 October 2025 07:31\n\n### US Tomhawk missile shipments to Ukraine unlikely\n\nThe Trump administration's desire to send long-range Tomahawk missiles to Ukraine might not be viable because current inventories were committed to the US navy and other uses, a US official and three sources said.\n\nUS vice president JD Vance said Washington was considering a Ukrainian request to obtain Tomahawks that could create havoc deep inside Russia, including Moscow.\n\nOn Wednesday, Reuters reported the US would provide Ukraine with intelligence on long-range energy infrastructure targets inside Russia.\n\nBut a US official and sources familiar with Tomahawk missile training and supplies questioned the feasibility of providing them to Kyiv. The cruise missiles have a a range of 2,500km.\n\nThe official said the US could look into allowing European allies to buy other long-range weapons and supply them to Ukraine, but Tomahawks were unlikely to be sent.\n\nArpan Rai3 October 2025 07:03\n\n[Newer](https://www.independent.co.uk/?page=1)[Older](https://www.independent.co.uk/?page=2)",
      "source": "News Source",
      "date": "2025-10-03T10:12:41.107Z"
    },
    {
      "title": "2027 European Green Cities winners announced - Environment",
      "url": "https://environment.ec.europa.eu/news/2027-european-green-cities-winners-announced-2025-10-02_en?utm_source=valyu.network&utm_medium=referral&utm_campaign=ai_pilot&utm_content=ai_query",
      "image_url": {
        "0": "https://environment.ec.europa.eu/sites/default/files/styles/ewcms_metatag_image/public/2025-10/GettyImages-1478924207.jpg?h=3c8d7bc7&itok=TgDZ4j5l",
        "1": "https://environment.ec.europa.eu/sites/default/files/styles/oe_theme_medium_no_crop/public/2025-10/GettyImages-1478924207.jpg?itok=tqNf9hTb",
        "2": "https://environment.ec.europa.eu/sites/default/files/styles/embed_large/public/2025-10/egl-egc-sm-maps-winners-2027.jpg?itok=sGKDWVZ-"
      },
      "content": "- News article\n\n- 2 October 2025\n\n- Directorate-General for Environment\n\n- 4 min read\n\n# Winners of 2027 European Green Cities Awards announced in Vilnius\n\nHeilbronn, Germany, won the European Green Capital Award, and the European Green Leaf prizes went to Assen in the Netherlands and Siena, Italy.\n\nThe winners of the two most prestigious European Green Cities Awards for 2027 were announced today (2 Oct) in Vilnius during a festive ceremony held at the Lithuanian National Art Gallery.\n\nIn 2027, Heilbronn (Germany) will be the European Green Capital, and the European Green Leaf Awards - for smaller cities - will go to Assen (the Netherlands) and Siena (Italy).\n\nSpeaking on the issue, Commissioner for Environment, Water Resilience and a Competitive Circular Economy Jessika Roswall said:\n\n“The European Green Capital and European Green Leaf awards, each year, recognise cities that strive to be at the forefront of urban and environmental sustainability. Cities that – simply put – lead by example.\n\nI am delighted to congratulate Heilbronn, Assen and Siena for having been awarded these titles for 2027. This is both a recognition and responsibility – you are our new ambassadors of the green transition.”\n\nThe jury awarded Heilbronn the title of European Green Capital 2027 based on top scores that the city received in air quality, water, noise, climate change adaptation and the circular economy.\n\nHeilbronn demonstrates a successful intersectoral collaboration of noise, climate and air pollution into its ‘Landscape Plan 2030’ and the city’s ‘Mobility Concept’. Citizen engagement is central, with participatory platforms, awareness campaigns, and protection for quiet areas.\n\nThe jury also recognised the city’s ambitious targets for 2035, as well as the regional collaborations that Heilbronn has built to further improve air quality and noise reduction.\n\nHeilbronn will succeed 2025 titleholder Vilnius (Lithuania) and 2026 titleholder Guimarães (Portugal).\n\nBoth Green Leaf Award winners, Assen and Siena, impressed the jury with their exemplary approaches to engaging their communities in the green transition.\n\nMembers of the jury were impressed with Assen’s strong commitment to circularity and climate change mitigation. Its innovative waste management policies, including enhanced PMD (Plastic, Metal, and Drink cartons) collection and initiatives such as Repair Cafés, showcase reducing residual waste and promoting material recovery, which drive forward the circular economy.\n\nThe city has achieved significant CO₂ reductions through building retrofits, decarbonisation of municipal operations, and innovative projects like the Energy Garden.\n\nThe cycling highway to Groningen is an example of a sustainable mobility project that further highlights Assen’s efforts to reduce emissions.\n\nSiena impressed the jury with its green areas and sustainable land use, as well as effective waste management systems.\n\nThe total area of public green areas in Siena has increased thanks to public investment. New urban parks have been created, resulting in an average of 28m2 of public green spaces per capita.\n\nThe city recycled an impressive 61.4% of its municipal waste and reduced landfill to just 1%. The jury also recognised the public engagement programs in Siena, which promote reuse, repair, and circular economy practices.\n\nHeilbronn will be granted a financial prize of €600,000. The money will contribute to the city’s effort to implement measures of sustainability and participation to enhance its environmental sustainability as European Green Capital 2027.\n\nSimilarly, Assen and Siena, as European Green Leaf 2027 award winners, will receive a financial prize of €200,000 each.\n\nA total of 20 cities from 11 European countries competed for the awards in this edition. An international panel of seven independent urban sustainability experts evaluated each application and proposed a shortlist of seven finalist cities.\n\nAll seven finalists were interviewed by a jury comprised of representatives from the Commission, the European Committee of the Regions, the European Environment Agency (EEA), the EU Covenant of Mayors for Climate and Energy, and the European Environmental Bureau (EEB).\n\nThe jury also commends the Green Capital finalists Debrecen (Hungary) and Klagenfurt on Lake Wörthersee (Austria) and the Green Leaf finalists Benidorm (Spain) and Saint-Quentin (France) for their outstanding performances. All finalists have shown an impressive commitment to further urban sustainability in their communities.\n\n#### Background\n\nThe EU recognises that cities play a crucial role in delivering a low-carbon, resource-efficient, clean, sustainable and resilient society. With over 70% of Europeans living in urban areas, cities play an important role in the environmental and economic transformation.\n\nThe European Green Capital Award was launched in 2010 by the Commission to encourage cities to become greener and cleaner, and thereby to improve the quality of life for their citizens.\n\nThe Award recognises cities that are committed to achieving the European Green Deal’s ambitious goals and more specifically the Zero Pollution Action Plan, the Circular Economy Action Plan, the Biodiversity Strategy, the EU Adaptation Strategy and the EU goals on climate neutrality.\n\nThe European Green Leaf Award was established to recognise the environmental efforts and achievements of smaller towns and cities (20,000 – 100,000 inhabitants).\n\nBeing a European Green Capital or a European Green Leaf city brings many benefits, from increasing the city’s profile to building new alliances. Winning also creates a spirit of optimism, attracting investments and building a better quality of life for citizens.\n\nMore background information can be found in our press kit.\n\nDiscover more about the European Green Cities Award, as well as the current and previous winners.\n\nSustainable cities: Seven finalists for the 2027 European Green Capital and Green Leaf Awards | European Commission\n\n## Details\n\n## EU Environment newsletter\n\nEU Environment newsletters deliver the latest updates about the European Commission’s environmental priorities straight to your inbox.\n\nShare this page",
      "source": "News Source",
      "date": "2025-10-03T10:12:41.107Z"
    },
    {
      "title": "Hungarian vetoes eclipse back-to-back summits of European leaders | Euronews",
      "url": "https://www.euronews.com/my-europe/2025/10/02/hungarian-vetoes-eclipse-back-to-back-summits-of-european-leaders?utm_source=valyu.network&utm_medium=referral&utm_campaign=ai_pilot&utm_content=ai_query",
      "image_url": {
        "0": "https://static.euronews.com/articles/stories/09/49/39/72/1200x675_cmsv2_d76a10f5-6ed8-5e85-901e-e4658e4d31af-9493972.jpg",
        "1": "https://images.euronews.com/articles/stories/09/49/46/80/189x106_cmsv2_f41d4997-70ca-509f-9b3c-6fbe2e286831-9494680.jpg",
        "2": "https://images.euronews.com/articles/stories/09/47/26/61/189x106_cmsv2_8ec31d67-79c5-59e4-a3ab-2e8e915087bd-9472661.jpg",
        "3": "https://images.euronews.com/articles/stories/09/49/46/82/189x106_cmsv2_b906ab43-599c-55a2-9bfd-1adf0d15fc64-9494682.jpg",
        "4": "https://images.euronews.com/articles/stories/09/49/43/30/189x106_cmsv2_08510634-2677-53cb-95ae-ff149d6fb124-9494330.jpg"
      },
      "content": "By Jorge Liboreiro Published on 02/10/2025 - 18:49 GMT+2\n\n## \"I will not allow one country, and I will certainly not allow Mr Orbán, to take decisions upon the entire European future,\" Danish Prime Minister Mette Frederiksen said at the end of a leaders' summit.\n\nADVERTISEMENT European leaders concluded two days of back-to-back summits in Copenhagen that were marked by the obstructions of Hungarian Prime Minister Viktor Orbán, whose vetoes have hindered collective support for Ukraine and challenged unity at a precarious time when Russia ramps up its bombardment and the United States steps away. Despite pleas from other heads of state and government, Orbán flat-out refused to lift his veto on Ukraine's membership bid to join the European Union, which has also prevented Moldova from advancing in the negotiations. Enlargement is entirely dependent on unanimity. An attempt by European Council President António Costa to tweak the voting rules and switch to a qualified majority was quickly shot down by the Hungarian leader. \"This plan is dead,\" he said. Orbán also rejected a groundbreaking initiative to issue a €140 billion loan to Ukraine using the immobilised assets of the Russian Central Bank, despite his Belgian counterpart, Bart De Wever, making a passionate case for sharing the risks. Belgium is home to Euroclear, the central securities depository that holds the bulk of the Russian assets, making it the chief target of the Kremlin's potential retaliation. \"I want the maximum of legal certainty. I want solidarity,\" De Wever said on Thursday morning. \"I don't think this is an unreasonable position.\" At the end of the summit, Orbán offered his reply. \"Belgium needs the mutualisation of the responsibility. No way. We're not part of the deal,\" he said, calling De Wever's arguments \"very educative\". \"If the European Union decides to touch and take away the money of somebody else, we will not be part of that (deal), so we don’t have any responsibility in the future.\" The lack of unanimity threatens to complicate what is already shaping up to be a complicated scheme. Without the backing of the 27 member states, the European Commission would not be able to use the EU budget as the ultimate guarantor. The Commission is also trying to amend how sanctions are renewed to make the freezing of assets more predictable. But that, too, would also require unanimity. Danish Prime Minister Mette Frederiksen aired her frustration with Orbán's obstructionism at the closing press conference in Copenhagen. \"I think we have to stick to strategy, and enlargement of the European Union is a part of our strategy. And it's a question for the entire European Union and actually the entire European continent. And we have to build a strong Europe as possible, which in my world means (to) enlarge the European Union,\" Frederiksen said. \"I will not allow one country, and I will certainly not allow Mr Orbán, to take decisions upon the entire European future,\" she added. Frederiksen suggested Kyiv could advance its technical work while it waits for the veto to be lifted and the first cluster of accession talks (\"Fundamentals\") to be opened. Earlier this week, the European Commission announced that Ukraine had completed the screening of its legislation for all six clusters \"at record speed\". \"If we are not able to convince Viktor Orbán, then I simply think we just have to move on with all the work that has to be done between Ukraine and the European Commission,\" Frederiksen said. By her side, Ukrainian President Volodymyr Zelenskyy accused Orbán of electioneering. The Hungarian leader has been in power for 15 uninterrupted years and faces his most formidable challenge in opposition leader Péter Magyar, who has taken a commanding lead in opinion polls. The country will hold elections in April 2026. \"Yes, we have problems with Hungary. We can openly speak about it because Viktor Orbán has elections. And I think it's not smart because he has elections, that's why he's blocking a big 40 million (people) nation on their way to the EU,\" Zelenskyy said. \"Because, by the way, Russia began this war because (of) our will and our choice, our choice to go directly to Europe. Because we feel the same and share the same values with all other European countries,\" he added, referring to the 2014 Maidan Revolution. As the accession deadlock persists and the work on the €140 billion begins, Brussels is keeping an eye on the 19th package of sanctions, which Bratislava threatens to veto.\n\nGo to accessibility shortcuts\n\n## Read more\n\n### Hungary’s Orbán claims 'EU has decided to go to war' and calls for petition against Brussels\n\n### 'Can we eat the chicken?' Belgian PM demands answers on Russian frozen assets\n\n### EU leaders give 'broad support' for drone wall and using frozen Russian assets to aid Ukraine\n\n- [Mette Frederiksen](https://www.euronews.com/tag/mette-frederiksen) - [Hungary](https://www.euronews.com/tag/hungary) - [European Union](https://www.euronews.com/tag/european-union) - [Volodymyr Zelenskyy](https://www.euronews.com/tag/volodymyr-zelensky) - [Ukraine](https://www.euronews.com/tag/ukraine) - [Viktor Orbán](https://www.euronews.com/tag/viktor-orban)",
      "source": "News Source",
      "date": "2025-10-03T10:12:41.107Z"
    },
    {
      "title": "Russia's Vladimir Putin Mocks NATO Countries Over Recent Drone Incursions: Follow Live - Newsweek",
      "url": "https://www.newsweek.com/russia-nato-ukraine-drones-war-live-updates-10816334?utm_source=valyu.network&utm_medium=referral&utm_campaign=ai_pilot&utm_content=ai_query",
      "image_url": {
        "0": "https://assets.newsweek.com/wp-content/uploads/2025/10/Untitled-design-2025-10-02T115155.751.png?w=1200crop=1",
        "1": "https://assets.newsweek.com/wp-content/uploads/2025/08/2496877-amanda-castro.png?w=128&quality=75&webp=1",
        "2": "https://assets.newsweek.com/wp-content/uploads/2025/08/2347171-shanecroucher.png?w=128&quality=75&webp=1",
        "3": "https://assets.newsweek.com/wp-content/uploads/2025/08/2502611-hannah-parry-headshot.png?w=128&quality=75&webp=1",
        "4": "https://assets.newsweek.com/wp-content/uploads/2025/09/2719420-donald-tusk.jpg?w=1600&quality=75&webp=1"
      },
      "content": "- NationNewsPoliticsTechFact CheckPersonal FinanceAutomotiveSportsBetter Workplaces\n\n- WorldRussia-UkraineMiddle EastChina And AsiaBetter PlanetAll World News\n\n- LifestyleFamily & ParentingEntertainmentTravelPetsRelationshipsScienceHealth\n\n- OpinionMy TurnAll Opinion\n\n- RankingsHealthFinanceProductsEducationWorkplacesCorporate ResponsibilityAll Rankings\n\n- ConnectNewslettersFacebookInstagramYouTubeTikTokTwitter/XRedditAnnouncements\n\n- MoreUnconventionalEventsPodcastsVantageReaders ChoiceNewsweek.AI\n\n+1\n\nRussian President Vladimir Putin has mocked NATO nations' claims of Russian drone incursions in their air space.\n\n“I won’t do it anymore — to France, Denmark, Copenhagen, Lisbon — wherever they could reach,” Putin joked, as he addressed a forum of foreign policy experts in Russia's Black Sea resort of Sochi. Putin described the most recent accusations of Russian drone flights over Denmark as part of NATO efforts to “inflame tensions to boost the defense spending.” At least ten European countries, including Poland, Germany and France, have accused Russia of flying drones into their territories in recent months, while the European Union has launched a drone wall initiative to bolster its eastern flank.\n\nMeanwhile, European leaders are sounding the alarm over escalating Russian provocations across the Baltic region. Polish Prime Minister Donald Tusk declared \"this is war\" on Thursday as he urged NATO to abandon “illusions” and confront what he called a “new type of war.” The remarks came during a high-level summit in Copenhagen focused on bolstering continental defense amid a wave of suspected sabotage and drone activity.\n\nWhat to Know:\n\n- Tusk said Poland shot down Russian drones violating its airspace in early September.\n\n- He warned that incidents near Polish infrastructure—including ports and pipelines—are happening “almost every day.”\n\n- Danish Prime Minister Mette Frederiksen called the situation a “hybrid war” targeting NATO allies.\n\n- German forces raided the Russian vessel Scanlark, uncovering evidence of drone launches and sabotage.\n\n- French commandos arrested crew members of the suspected “shadow fleet” tanker Borocay in Saint-Nazaire.\n\n- Polish authorities detained a GRU suspect accused of burying explosive-packed cans in Łódź cemeteries.\n\n- Drone disruptions in Denmark, Norway, and Germany remain under investigation, with Russia as the prime suspect.\n\n- Russia denies all allegations and claims it does not seek conflict with Europe.\n\n- Tusk emphasized Ukraine’s role in the broader conflict: “If Ukraine loses, it will mean our defeat.”\n\nNewsweek's live coverage has ended.\n\nOct 02, 2025 at 07:56 PM EDT\n\n## Ukraine could destroy Russian oil refineries, military bases using US intel and missiles, say experts\n\nUkraine would be able to decimate critical Russian oil refineries and military bases if the U.S. provides intelligence and missiles.\n\nCiting unnamed officials, The Wall Street Journal said that President Donald Trump had allowed the Pentagon and intelligence agencies to help Kyiv attack the sites that generate revenue for Vladimir Putin’s war machine.\n\nUkrainian President Volodymyr Zelensky has also requested Tomahawk cruise missiles, which are capable of reaching targets 1,500 miles away.\n\nGeorge Barros, of the Washington-based Institute for the Study of War, told the New York Post that the combination of intelligence sharing and long range missiles would allow Ukraine to fire more precise and devastating attacks, further into Russian territory than ever before.\n\n“Russia has always been protected by the tyranny of distance, but with tomahawks and precise intelligence from the West, you have the payload plus the distance to take out big targets that Ukrainian systems just haven’t been able to hit,\" he said.\n\nUkraine has hit Russian refineries, including one in Volgograd in August, but have been unable to completely destroy any site. Volgograd was back up and running just one month after the attack.\n\n“A 100-kilogram (220-pound) warhead can cause some damage like what we’ve seen so far, but a 1,000-kilogram warhead would put Russian equipment out of commission for good,” Barros said.\n\nOct 02, 2025 at 07:40 PM EDT\n\n## Russia-Tehran strategic treaty takes effect today\n\nThe strategic partnership treaty between Moscow and Tehran officially came into force on Thursday.\n\nIt was signed in Moscow back in January, by Iranian President Masoud Pezeshkian and Russian President Vladimir Putin. It was later ratified by Iran's parliament in May.\n\nThe 20-year pact is aimed at improving bilateral relations between Russia and Iran, raising them to a \"new level of broad strategic partnership\".\n\nIt cites previous treaties and cooperation between Iran and the USSR and Russia as the foundation for the latest pact.\n\nOct 02, 2025 at 07:19 PM EDT\n\n## Poland reports Russian fishing boat acting suspiciously near gas pipeline\n\nPolish border guards reported spotting a Russian fishing boat acting suspiciously near a gas pipeline in Polish waters on Wednesday, Reuters reports.\n\nThe boat slowed down and came within 300 meters of the Petrobaltic pipeline in Polish waters near the town of Wladyslawowo, before sailing away after a radio alert, the guards said on Thursday.\n\nThe sighting has raised concerns about a potential sabotage operation in the Baltic Sea.\n\nNATO countries have been increasing its efforts to protect underwater cables and pipelines after a series of alleged sabotage incidents which much of the West has blamed on Russia.\n\nOct 02, 2025 at 07:07 PM EDT\n\n## WATCH: Moment Trump called Russia a ‘paper tiger’\n\nOct 02, 2025 at 07:00 PM EDT\n\n## EU vows to support Ukraine ‘for as long as it takes’\n\nEuropean Commission president Ursula von der Leyen pledged the European Union's support for Ukraine, for “today, tomorrow, and for as long as it takes”.\n\n\"Our goal remains a strong and free Ukraine,\" von der Leyen said in a post on X. \"Russia needs to know that the EU and its partners have the will and the means to continue supporting Ukraine until a just and lasting peace is achieved.\"\n\nThe European Commissioner teased a new program to \"give Ukraine the tech edge it needs on the battlefield.\"\n\nShe also reaffirmed the EU's commitment to making Ukraine a Member State.\n\n\"This is what we mean when we say: today, tomorrow, and for as long as it takes,\" she said.\n\nLoading twitter content...\n\nOct 02, 2025 at 06:32 PM EDT\n\n## Vladimir Putin links Charlie Kirk’s killing to America’s ‘deep split’\n\nRussian President Vladimir Putin on Thursday called the killing of U.S. conservative activist Charlie Kirk a “heinous crime” and said it reflected what he described as a “deep split” in American society, even as he issued new warnings to Washington over Ukraine and praised President Donald Trump’s efforts to negotiate peace.\n\nSpeaking at a forum of foreign policy experts in the Black Sea resort of Sochi, Putin devoted part of his remarks to U.S. politics, describing Kirk as a “hero” who was targeted for defending conservative values. He likened Kirk to Michael Gloss, the son of a senior CIA official who joined the Russian military and was killed in Ukraine last year. Putin said he posthumously awarded Gloss a medal, which was delivered to Trump envoy Steve Witkoff during his recent visit to Moscow.\n\n“He gave his life while defending those values as a Russian soldier, and Kirk gave his life while fighting for the same values in the United States,” Putin said. He added that Kirk’s assassination revealed “a deep split” within America and underscored how ideological divides are shaping political violence.\n\nRead in full from Gabe Whisnant on Newsweek.\n\nOct 02, 2025 at 06:20 PM EDT\n\n## Moscow reacts to France seizing ship suspected to be part of Russia’s shadow fleet\n\nThe Kremlin has slammed France’s seizure of a tanker suspected of being part of Russia's so-called shadow fleet as \"hysteria.\"\n\nKremlin spokesman Dmitry Peskov warned that France's actions could have a knock-on effect effect on the international energy industry.\n\nPeskov said that France did not know whether the oil in the tanker even belonged to Moscow.\n\n\"I don't know what kind of oil, what is the origin of this oil,\" Peskov told reporters. \"What if it's not Russian oil? What if France is going to create enormous problems for all the ways of international energy sources - what is going to happen?\n\n\"So I think it's all part this hysteria I mentioned before.\"\n\nOct 02, 2025 at 05:55 PM EDT\n\n## ‘Then what is NATO?’ Putin fires back at Trump’s ‘paper tiger’ remark\n\nRussian President Vladimir Putin fired back at President Donald Trump's comments that Russia was just a “paper tiger.\"\n\n“A paper tiger. What follows then? Go and deal with this paper tiger,” Putin said on Thursday.\n\n“Well if we are fighting with the entire NATO bloc, we are moving, advancing, and we feel confident, and we are a ‘paper tiger’, then what is NATO itself?”\n\nPutin promised a \"significant\" response to \"Europe's militarization\" and further provocation, telling a foreign policy forum that Russia, \"will never show weakness or indecisiveness.\"\n\nOct 02, 2025 at 05:33 PM EDT\n\n## Putin says he’s ‘comfortable’ talking to Trump\n\nRussian President Vladimir Putin said he feels \"comfortable\" speaking with President Donald Trump as he praised his peacekeeping efforts during their Alaskan summit in August.\n\n“It was good that we made an attempt to search for and find possible ways to settle the Ukrainian crisis,” he said.\n\nPutin said that both the U.S. and Russia had shared goals, including nuclear arms control and a wish to end the war.\n\nOct 02, 2025 at 05:03 PM EDT\n\n## Vladimir Putin Mocks NATO Countries Over Recent Drone Incursions\n\nRussian President Vladimir Putin has mocked European countries' claims of Russian drone incursions in their air space.\n\n“I won’t do it anymore — to France, Denmark, Copenhagen, Lisbon — wherever they could reach,” Putin joked, as he addressed a forum of foreign policy experts in Russia's Black Sea resort of Sochi.\n\nPutin described the drone accusations as part of NATO efforts to “inflame tensions to boost the defense spending.”\n\nOct 02, 2025 at 04:53 PM EDT\n\n## Putin comments on Charlie Kirk’s killing\n\nRussian President Vladimir Putin has commented on the assassination of Charlie Kirk.\n\nPutin praised the podcaster as a hero who was killed for promoting the same \"traditional\" conservative values shared by Russia.\n\nThe Russian leader branded his fatal shooting a “heinous crime” that reflected a “deep split\" in American society.\n\nPutin compared Kirk to Michael Gloss, an American and the son of a deputy CIA chief, who joined the Russian military and was killed fighting in Ukraine in 2024.\n\n\"He gave his life while defending those values as a Russian soldier, and Kirk gave his life while fighting for the same values in the United States,” he said Thursday.\n\nMoscow has awarded Gloss a medal for his contribution, which Putin said he gave to Trump's envoy Steve Witkoff during his visit to Moscow.\n\nOct 02, 2025 at 04:09 PM EDT\n\n## U.S. faces inventory limits on proposed Tomahawk missile transfer to Ukraine\n\nThe Trump administration’s plan to supply Ukraine with long-range Tomahawk missiles may be hindered by limited availability, according to a U.S. official and multiple sources cited by Reuters.\n\nCurrent stockpiles are primarily allocated to the U.S. Navy and other strategic uses, raising doubts about the feasibility of the transfer.\n\nOct 02, 2025 at 04:02 PM EDT\n\n## Putin blames NATO for escalation, warns Ukraine over nuclear plant strikes\n\nRussian President Vladimir Putin accused NATO countries of fueling the war in Ukraine through “constant escalation,” claiming they are now openly involved in combat operations by supplying weapons and intelligence. He said this approach has obstructed efforts to reach peace.\n\nSpeaking on Thursday, Putin praised U.S. President Donald Trump for his diplomatic engagement, noting they discussed a potential settlement and restoring bilateral ties during an August summit in Alaska. “Trump is a person who can listen,” Putin said.\n\nPutin also issued a warning to Ukraine over strikes near the Russian-occupied Zaporizhzhia Nuclear Power Plant, suggesting Moscow could retaliate against Ukrainian nuclear facilities. The plant has been running on emergency generators for over a week, with both sides trading blame for the power cutoff and shelling.\n\nDespite calls for negotiation, Moscow continues to demand that Kyiv abandon NATO ambitions and cede territory—positions Ukraine has rejected.\n\nOct 02, 2025 at 03:47 PM EDT\n\n## Putin dismisses NATO attack claims, warns of response to European militarization\n\nRussian President Vladimir Putin rejected Western concerns about a potential Russian attack on NATO, calling the notion “nonsense” and accusing European leaders of fueling hysteria to justify increased defense spending. Speaking at a foreign policy forum in Sochi, Putin warned that Russia would respond decisively to what he described as Europe’s growing militarization.\n\nHe cited Germany’s ambition to build the strongest army in Europe as a signal Moscow is closely monitoring. “Russia will never show weakness or indecisiveness,” Putin said, adding that the Kremlin “cannot ignore what is happening.”\n\nAmid heightened tensions following drone incursions in Denmark, Estonia, and Poland, Putin denied any intent to expand the conflict beyond Ukraine and urged European leaders to “calm down” and focus on domestic issues.\n\nOct 02, 2025 at 03:30 PM EDT\n\n## Putin warns U.S. against pressuring Russia’s Energy Partners\n\nRussian President Vladimir Putin criticized U.S. efforts to push India and China away from energy trade with Moscow, warning that such pressure could trigger global economic consequences.\n\nSpeaking at a forum of Russian policy experts on Thursday, Putin argued that imposing higher tariffs on Russia’s partners would inflate global prices and compel the U.S. Federal Reserve to maintain elevated interest rates.\n\nSuch a scenario, he said, would ultimately slow down the American economy.\n\nOct 02, 2025 at 03:17 PM EDT\n\n## EU’s proposed ‘drone wall’ faces pushback amid security debate\n\nThe European Commission’s plan to build a “drone wall” along the EU’s eastern border has met resistance from member states without direct exposure to Russian threats. At an informal summit in Copenhagen, leaders broadly acknowledged the need for stronger defenses. Still, countries like Italy and Spain questioned the fairness of investing in measures that primarily benefit the eastern flank.\n\nFrench President Emmanuel Macron expressed skepticism, calling for more sophisticated systems such as long-range deterrents and counter-drone capabilities. German Chancellor Friedrich Merz also demanded clarity on the initiative’s structure.\n\nThe proposed “drone wall” would integrate radar, acoustic sensors, and countermeasures across EU states to respond collectively to aerial threats. Ukraine, seen as a key contributor due to its battlefield experience, has begun sharing expertise with European partners.\n\nDespite the lack of consensus, officials emphasized the urgency of addressing drone incursions linked to Russia. Formal talks will continue in Brussels on October 15, with funding discussions tied to the €1.5 billion European Defense Industrial Programme.\n\nOct 02, 2025 at 03:06 PM EDT\n\n## Ukraine says Moscow preparing to connect occupied Zaporizhzhia nuclear plant to its own grid\n\nUkraine has accused Russia of deliberately cutting power to the occupied Zaporizhzhia nuclear power plant, in Enerhodar, Ukraine, to in preparation of connecting it to its own grid.\n\nThe plant, Europe’s largest, has relied on emergency diesel generators for the past week.\n\nOct 02, 2025 at 03:04 PM EDT\n\n## France seizes Russian-linked tanker in crackdown on sanctions evasion\n\nFrench authorities have detained the oil tanker Boracay, suspected of operating within Russia’s so-called “shadow fleet,” as part of a broader European strategy to curb revenue fueling Moscow’s war in Ukraine. President Emmanuel Macron confirmed the move, calling it a step toward obstructing illicit energy trade and pressuring Russia to return to negotiations.\n\nThe vessel, already under EU and UK sanctions, was intercepted by French Navy commandos off the western coast. Its route coincided with recent drone incursions near Danish airports, prompting speculation about a possible link, though Macron said no evidence has yet confirmed the connection.\n\nThe Boracay had loaded 100,000 tonnes of Urals crude from Russia’s Primorsk port and was en route to India. French prosecutors are investigating inconsistencies in the ship’s documentation, and its Chinese captain faces charges for non-compliance.\n\nRussia dismissed the seizure as “hysteria,” warning it could disrupt global energy routes. NATO allies are expected to announce further measures targeting Russia’s fleet of aging tankers used to bypass sanctions.\n\nOct 02, 2025 at 02:52 PM EDT\n\n## Putin rebukes Trump’s ‘paper tiger’ remark, warns NATO of swift response\n\nAt the Valdai Discussion Group in Sochi, Russian President Vladimir Putin pushed back against U.S. President Donald Trump’s recent characterization of Russia as a “paper tiger.” Putin questioned NATO’s credibility, asserting that if Russia is advancing while facing the entire alliance, then “what is NATO itself?”\n\nPutin dismissed Western fears of a Russian attack on NATO as “impossible to believe” and warned that any provocation would trigger rapid countermeasures. He claimed Russian forces are progressing along the Ukrainian front and reiterated that Moscow views the war as a turning point in its relations with the West.\n\nCalling on NATO to “cool down” and focus on domestic issues, Putin said Ukraine faces manpower shortages and should consider negotiations. He stated that Russia now controls significant portions of eastern and southern Ukraine, including most of Luhansk and large parts of Donetsk, Zaporizhzhia, and Kherson.\n\nOct 02, 2025 at 02:39 PM EDT\n\n## Putin warns of European militarization, calls for restored U.S. ties at Valdai Forum\n\nRussian President Vladimir Putin delivered a sweeping address at the Valdai Discussion Club in Sochi, warning that Europe’s military buildup poses a “dangerous” threat and pledging that Russia’s response will be “very convincing.” He cited Germany’s ambition to lead militarily in Europe as a key concern.\n\nPutin also commented on U.S. policy, expressing support for President Donald Trump’s Gaza peace proposal and asserting that Russia seeks to restore relations with Washington. While echoing Trump’s claim that the Ukraine war would not have occurred under his leadership, Putin criticized a recent Truth Social post mocking Russia’s military performance, calling it a “paper tiger” jab.\n\nThe Russian leader dismissed fears of a NATO confrontation as “impossible to believe,” and reiterated claims that the conflict in Ukraine stems from European efforts to expand influence. He also praised BRICS as “natural partners” and invoked Russian history to frame his geopolitical stance, quoting Pushkin and lauding the Soviet role in defeating Nazism.\n\nOct 02, 2025 at 02:25 PM EDT\n\n## Zelensky, NATO’s Mark Rutte discuss ‘countering Russia provocations’ during meeting\n\nUkrainian President Volodymyr Zelensky met with NATO Secretary General Mark Rutte on Thursday to discuss \"countering Russian provocations\" and the military alliance's support for the PURL initiative to provide weapons and equipment to Ukraine.\n\n\"We agreed on our next steps in the framework of Ukraine–NATO cooperation and discussed the upcoming Ramstein meeting, which will be held at the level of defense ministers,\" Zelensky wrote on X, referring to the October 15 meeting of the Ukraine Defense Contact Group, known as the Ramstein meeting, at NATO Headquarters in Brussels.\n\n\"I thank Mark personally and NATO member states for their support of Ukraine. Together we are stronger,\" he added.\n\nOct 02, 2025 at 02:24 PM EDT\n\n## Zelensky and Cyprus president discuss peace, defense, and EU priorities\n\nUkrainian President Volodymyr Zelensky held talks with Cypriot President Nikos Christodoulides to strengthen cooperation on infrastructure and defense. The leaders also aligned their diplomatic positions ahead of Cyprus’s upcoming presidency of the Council of the European Union in early 2026.\n\nZelensky expressed gratitude for Cyprus’s military and humanitarian aid, as well as its role in the Coalition of the Willing—a group supporting efforts to secure a lasting peace in Ukraine.\n\nOct 02, 2025 at 02:11 PM EDT\n\n## Ukraine accuses Russia of severing power to Zaporizhzhia nuclear plant\n\nUkraine has accused Russia of intentionally disconnecting the Zaporizhzhia nuclear power plant from external power sources and preparing to link it to Russia’s energy grid.\n\nThe facility, Europe’s largest, has been operating on emergency diesel generators for more than a week, raising concerns about safety and energy independence.\n\nKyiv warned that the move could further entrench Russian control over the occupied site and undermine international oversight.\n\nOct 02, 2025 at 02:01 PM EDT\n\n## Russia says its not in Cold War with the West – it’s in a ‘fiery’ conflict\n\nMoscow officials dismissed the suggestion that the war in Ukraine had triggered a new Cold War with the West, because Russia was already engaged in a \"fiery\" conflict.\n\n\"I would disagree with the comparison with the Cold War,\" Russian Foreign Ministry spokeswoman Maria Zakharova said when asked if there was a new Cold War with Europe.\n\n\"We are already in another form of conflict. There has been no cold here for a long time; there is already fire here.\"\n\nZakharova has accused Europe and NATO of lying about Russia's drone incursions and provocation in Europe to justify their military spending.\n\n\"All their statements indicate - first, that they are preparing a chain of provocations. Second, that they need to justify their military budgets,\" Zakharova told Reuters.\n\nOct 02, 2025 at 01:58 PM EDT\n\n## Putin warns of global uncertainty, urges readiness and responsibility\n\nSpeaking at the Valdai plenary session, Russian President Vladimir Putin emphasized the need for preparedness amid a rapidly shifting global landscape. He warned that the pace and intensity of change demand heightened individual and national responsibility.\n\n“We live in a time when everything is changing very quickly, and these changes are often dramatic,” Putin said, adding that while the future remains unpredictable, it is essential to be ready for any development. He underscored that the stakes are “extremely high,” not only for personal destinies but for the future of nations and the world at large.\n\nOct 02, 2025 at 01:44 PM EDT\n\n## Ukrainian drone strikes deepen Russia’s fuel crisis and economic strain\n\nA fire at the Yaroslavl refinery—Russia’s oldest and fifth largest—has intensified a growing fuel crisis triggered by months of Ukrainian drone strikes. While local officials blamed the blaze on a technical fault, it marks the latest in a series of attacks that have disabled at least 16 of Russia’s 38 refineries since August.\n\nThe strikes have slashed refining capacity by nearly 40 percent, with 70 percent of that attributed to Ukrainian operations. Fuel shortages are now widespread, with rationing in Crimea, long queues in the Volga region, and limits even in Moscow and St. Petersburg. Lukoil has banned jerry cans to curb panic buying.\n\nExperts say the crisis stems from both structural weaknesses in Russia’s refining sector and Ukraine’s targeted strategy, which has overwhelmed air defenses and delayed repairs. The Kremlin has responded by banning petrol exports, considering diesel restrictions, and redirecting crude to Belarus.\n\nThe economic fallout is mounting. Wholesale fuel prices have surged, and Russia’s finance ministry projects a budget deficit of 2.6 percent of GDP. Growth forecasts have been slashed, and the country is now in a technical recession.\n\nWhile the strikes haven’t crippled military operations, they are eroding public confidence. With mobile outages and rising costs, ordinary Russians are feeling the war’s impact at home—challenging President Putin’s promise of domestic insulation from the conflict.\n\nOct 02, 2025 at 01:39 PM EDT\n\n## Putin vows to respond swiftly if provoked by Europe\n\nPresident Vladimir Putin pledged to respond quickly if he feels Europe is provoking Russia.\n\n\"The elites of united Europe continue to whip up hysteria,\" he said on Thursday, at the Valdai Discussion Group in the Black Sea resort of Sochi.\n\n\"It turns out that war with the Russians is almost on the threshold. They repeat this nonsense, this mantra over and over again.\"\n\nPutin urged the NATO alliance to \"cool down... and take care of your own problems,\" as he dismissed the idea of Russia attacking a member nation as \"impossible to believe\".",
      "source": "News Source",
      "date": "2025-10-03T10:12:41.107Z"
    },
    {
      "title": "Macron, Meloni argue for caution in responding to Russian ‘provocations’ | Russia-Ukraine war News | Al Jazeera",
      "url": "https://www.aljazeera.com/news/2025/10/1/danish-pm-warns-that-russia-is-waging-hybrid-war-on-europe?utm_source=valyu.network&utm_medium=referral&utm_campaign=ai_pilot&utm_content=ai_query",
      "image_url": {
        "0": "https://www.aljazeera.com/wp-content/uploads/2025/10/AFP__20251001__77CD34R__v1__HighRes__DenmarkEuPoliticsDiplomacyEconomy-1759343488.jpg?resize=1920%2C1440"
      },
      "content": "Macron, Meloni argue for caution in responding to Russian ‘provocations’ | Russia-Ukraine war News | Al Jazeera\n\nFrance's President Emmanuel Macron, second right, speaks at the EU summit in Copenhagen, alongside European Commission President Ursula von der Leyen, Denmark’s Prime Minister Mette Frederiksen and Poland's Prime Minister Donald Tusk [Ludovic Marin/AFP]\n\nBy Federica Marsi and News AgenciesPublished On 1 Oct 20251 Oct 2025|Updated: 2 Oct 2025 03:02 AM (GMT)Updated: 2 Oct 2025 03:02 AM (GMT)Click here to share on social mediashare2SharefacebooktwitterwhatsappcopylinkSave\n\nDanish Prime Minister Mette Frederiksen has called on Europe to arm itself to respond to Russia’s hybrid warfare, but other major continental leaders have argued for caution against getting trapped in a tit-for-tat cycle of escalation with Moscow.\n\n“I hope that everybody recognises now that there is a hybrid war and one day it’s Poland, the other day it’s Denmark, and next week it will probably be somewhere else that we see sabotage or we see drones flying,” Frederiksen told reporters on Wednesday.\n\n## Recommended Stories\n\nlist of 3 items\n\n- list 1 of 3[Moldova’s pro-EU party takes lead in election as vote counting under way](https://www.aljazeera.com/news/2025/9/28/moldovas-pro-eu-party-takes-lead-in-election-as-vote-counting-under-way) - list 2 of 3[Moldova’s pro-EU party wins election hit by Russian interference claims](https://www.aljazeera.com/news/2025/9/29/moldovas-pro-eu-party-wins-election-hit-by-russian-interference-claims) - list 3 of 3[Russian attacks keep “pushing the limits” of NATO countries](https://www.aljazeera.com/video/quotable/2025/9/29/russian-attacks-keep-pushing-the-limits-of-nato-countries)\n\nend of list\n\nShe made the comments while hosting a summit of European leaders as they discussed joint efforts for better deterrence and defence.\n\nFrench President Emmanuel Macron, also at the summit, however, urged the European Union to proceed with circumspection.\n\n“I think we all have to be very cautious because we are in a time of confrontation with a lot of hybridity,” Macron said on Wednesday on the sidelines of the summit in Copenhagen.\n\n“This is why we have to be strong to deter any aggressions, but we have to remain very cautious and avoid any escalation,” he added.\n\nItalian Prime Minister Giorgia Meloni also warned against overreacting.\n\n“Despite everything, I think we have to think calmly. I think we shouldn’t respond to provocations. We have to equip ourselves; that certainly is true,” she said.\n\nHybrid warfare involves the use of conventional methods, such as tanks and missiles, as well as nonconventional ones, such as cyberattacks and internet disinformation.\n\nRussia has been “a very aggressive player” for several years, the French president said, citing cyberattacks during elections, its war against Ukraine, the use of nuclear threats and recent airspace violations.\n\nAdvertisement\n\nThe heads of state and prime ministers of the EU countries were meeting in Denmark’s capital following a series of [drone incidents near the country’s airports and military bases](https://www.aljazeera.com/news/2025/9/27/denmark-reports-new-drone-sightings-overnight-at-military-sites) over the last week.\n\nBefore the meeting, a special radar system was set up at Copenhagen airport to help keep watch. Unidentified drones forced the closure of the airfield a week ago, causing major disruptions.\n\nFrance, Germany, the Netherlands, Sweden and the United Kingdom also sent aircraft, ships and air defence systems to Denmark in advance of the talks.\n\nWhile the Danish authorities have not identified those believed to be responsible, Frederiksen said, “there is only one country that is willing to threaten us, and it is Russia, and therefore we need a very strong answer back”.\n\nThe Danish prime minister appealed for rearmament in the face of growing threats.\n\n“I want us to rearm. I want us to buy more capabilities. I want us to innovate more, for example, on drones,” she said. “When I look at Europe today, I think we are in the most difficult and dangerous situation since the end of the Second World War.”\n\n## Airspace violations\n\nSerious airspace violations have been recorded in Europe over the last month, but not all nations in the bloc agree on how to respond.\n\nAfter Russia was blamed for drone incursions into NATO members Poland and Romania, Macron last week said the alliance’s response would have to “go up a notch” in the case of “new provocations” from Moscow.\n\nMacron did not rule out downing a Russian fighter jet if it were to breach European airspace.\n\n“In accordance with the doctrine of strategic ambiguity, I can tell you that nothing is ruled out,” he said in an interview with German daily newspaper Frankfurter Allgemeine Zeitung.\n\nLast month, Poland said it had [shot down Russian drones](https://www.aljazeera.com/news/2025/9/10/poland-downs-drones-during-airspace-intrusion-as-russia-strikes-ukraine) that violated its airspace as Moscow launched a barrage against Ukraine, while Romania’s Ministry of National Defence said [the country’s airspace had been breached](https://www.aljazeera.com/news/2025/9/14/romania-reports-drone-incursion-during-russian-attack-on-ukraine) by a drone during a Russian attack on infrastructure in neighbouring Ukraine.\n\nOn Wednesday, Macron also alleged that an oil tanker off the French coast had committed “very serious wrongdoings” and linked it to Russia’s shadow fleet, which is avoiding Western sanctions over Moscow’s war in Ukraine.\n\nThe tanker was sailing off the coast of Denmark last week and was cited by European naval experts as possibly being involved in drone flights over the Nordic country.\n\nAfter Russia’s invasion of Ukraine, leaders and intelligence services believed that Russia could mount an assault elsewhere in Europe in three to five years, and that President Vladimir Putin is intent on testing NATO amid doubts about United States President Donald Trump’s commitment to the organisation.\n\nAdvertisement\n\nOther defence experts, however, question the readiness of Russia’s military for another large-scale war.",
      "source": "News Source",
      "date": "2025-10-03T10:12:41.107Z"
    },
    {
      "title": "'Everybody needs to wake up': Europe lacks defences to protect itself against Russia, expert says | World News | Sky News",
      "url": "https://news.sky.com/story/europe-lacks-the-defences-to-protect-itself-against-russia-counter-drone-expert-warns-13442506?utm_source=valyu.network&utm_medium=referral&utm_campaign=ai_pilot&utm_content=ai_query",
      "image_url": {
        "0": "https://e3.365dm.com/25/10/1600x900/skynews-drone-bunkall_7038665.jpg?20251002031024",
        "1": "https://e3.365dm.com/25/10/768x432/skynews-drone-bunkall_7038665.jpg?20251002031024",
        "2": "https://e3.365dm.com/25/06/75x75/skynews-alistair-bunkall_6949372.png?20250624111444",
        "3": "https://e3.365dm.com/25/10/768x432/skynews-drone-denmark_7038626.jpg?20251001230953",
        "4": "https://e3.365dm.com/25/10/768x432/skynews-drones-bunkall_7038664.jpg?20251002031003"
      },
      "content": "'Everybody needs to wake up': Europe lacks defences to protect itself against Russia, expert says\n\nThe warning comes as European leaders gather in the Danish capital Copenhagen to discuss a response to numerous recent Russian incursions into the region's airspace.\n\nAlistair Bunkall Europe correspondent @AliBunkallSKY\n\nThursday 2 October 2025 10:58, UK\n\nPlease use Chrome browser for a more accessible video player 2:45 How will Europe defend itself against drones?\n\n[Why you can trust Sky News](https://news.sky.com/info/policies-and-standards)\n\nThe head of a leading counter-drone manufacturer has warned that Europe lacks the defences to protect itself against Russia and will need thousands of systems to build a proposed \"drone wall\" across the continent.\n\nSky News visited the factory in the northern Danish city of Aalborg, one of the cities **targeted by suspected Russian drones** last week, which caused airspace to close for several hours.\n\n\"The number of installations that you need to have in order to protect is high and today, what is already installed is very, very low,\" explained Dan Hermansen, chief executive of MyDefence.\n\n\"It depends on how long you need to make the 'wall', but take a typical airport, you'll need an installation of say 10 [detection systems] to cover it, then you can have jamming equipment on top of that, so you're into the many thousands [of devices needed].\"\n\nTheir counter-drone technology is already being used by Ukrainian troops on the frontline to defend against Russian drones.\n\nThe equipment can track incoming drones, hijack the signal, and forcibly divert them back to their origin. They can also detect the make and model of the drone and triangulate the location of the controller.\n\nIn recent days, foreign governments have enquired about buying the sensors.\n\n### More from World\n\n- [Inside Pablo Escobar's home city where drugs are readily available to a traffic jam of cars](https://news.sky.com/story/colombia-is-high-on-trumps-troublemaker-list-but-coca-farmers-will-keep-producing-to-match-us-demand-13442883) - [Trump's declared war on drug cartels. Thousands of miles away, Ecuador is taking action](https://news.sky.com/story/this-is-what-trumps-war-on-drug-cartels-looks-like-13442140) - [Gaza latest: Protests erupt around world after Israel detains Greta Thunberg on aid flotilla](https://news.sky.com/story/gaza-israel-greta-thunberg-aid-flotilla-hamas-war-netanyahu-latest-trump-tony-blair-13440749)\n\n\"Airports around the world have gone to sleep with regards to this threat. Nobody has really cared about it for years, so it has not been a high-value thing to invest in, and suddenly you have airports that are super vulnerable to this threat, and now everybody is scrambling to get stuff to happen,\" Mr Hermansen told us.\n\n\"Everybody needs to wake up and say okay, this has to be a sustainable way of protecting critical infrastructure going forward.\"\n\nImage: Sky News visited one of the world's leading counter-drone manufacturers\n\nPlease use Chrome browser for a more accessible video player 2:51 Are we already in World War Three?\n\nThe warning comes as European leaders gather in the Danish capital Copenhagen to discuss a response to numerous recent Russian incursions into European airspace.\n\n\"When I look at Europe today, I think we are in the most difficult and dangerous situation since the end of the Second World War, not the Cold War anymore,\" Denmark's Prime Minister Mette Frederiksen told reporters on the eve of the meeting.\n\n\"I hope that everybody recognizes now that there is a hybrid war, and one day it's Poland, the other day it's Denmark, and next week it will probably be somewhere else that we see sabotage or we see drones flying.\n\n\"There are many different kinds of episodes. So I see this from a European perspective. There is only one country that is willing to threaten us, and it is Russia, and therefore we need a very strong answer back.\"\n\nAlthough Danish security officials haven't publicly blamed Russia, some European countries have already pointed the finger at Moscow, as the incidents happened shortly after Russian drones were flown into Polish and Romanian airspace.\n\nThere were further sightings of drones flying near and over military bases in northern Germany last week too, and Sky News has learned that more potential incursions have been detected and averted since new counter-drone equipment was installed in Copenhagen in recent days.\n\nPolice and intelligence agencies are now working on a theory that the drones could have been launched and controlled from a Russian ship disguised as a cargo vessel in the waters close by.\n\n**Read more from Sky News:Zelenskyy sounds alarm over Russian-held nuclear plantThe supercommuters taking 24-hour journeys to the office**\n\nOn Wednesday afternoon, French forces intercepted and boarded a tanker called the Boracay off the northwestern coast of France.\n\nIt's suspected of changing names and refusing to cooperate with officials. It was monitored sailing around Denmark under a different name, Pushpa, around the time of the **drone incursions last week**.\n\nSecurity is tight in Copenhagen as the meeting gets under way - drones are banned from flying nationwide, Danish warships are patrolling off the coast, and counter-drone technology can be seen at the country's main international airport.\n\nImage: A sign warning about the use of drones\n\nA number of**NATO** militaries have flown in equipment to help protect the gathering.\n\nThere is a sense that NATO countries are playing catch-up somewhat - responding to new Russian threats, as and when they happen.\n\nRight now, its drone incursions. But Moscow will almost certainly adapt, change tactics, and find a new way to test Europe's defences.\n\nfooter",
      "source": "News Source",
      "date": "2025-10-03T10:12:41.107Z"
    },
    {
      "title": "Home | Euractiv",
      "url": "https://www.euractiv.com/?utm_source=valyu.network&utm_medium=referral&utm_campaign=ai_pilot&utm_content=ai_query",
      "image_url": {
        "0": "https://www.euractiv.com/content/uploads/sites/2/2025/10/image-1000x700-1.png",
        "1": "https://www.euractiv.com/content/uploads/sites/2/2025/10/GettyImages-2238498530.jpg",
        "2": "https://www.euractiv.com/content/uploads/sites/2/2025/10/GettyImages-1581554075-1182x788.jpg",
        "3": "https://www.euractiv.com/content/uploads/sites/2/2025/10/GettyImages-1265271202.jpg",
        "4": "https://www.euractiv.com/content/uploads/sites/2/2025/10/GettyImages-2238341201.jpg"
      },
      "content": "### Policy areas\n\n- Economy\n\n- Politics\n\n- Agrifood\n\n- Health\n\n- Tech\n\n- Energy, Environment & Transport\n\n- Defence\n\n- euractiv.com\n\n- euractiv.fr\n\n- euractiv.de\n\n- euractiv.gr\n\n- euractiv.pl\n\n- euractiv.cz\n\n- euractiv.sk\n\n- euractiv.it\n\n- euractiv.es\n\n## TOP STORIES\n\n#### Postcard from Gastein: Europe’s health Davos in the Alps\n\nHealth\n\n##### Babiš poised for a comeback\n\nPolitics\n\n##### Munich airport resumes flights after drone sightings trigger closure\n\nEnergy, Environment & Transport\n\n##### EU fishers net another trade fight, this time over tuna with Thailand\n\nAgrifood\n\n##### Czech populists split on future of key Ukraine ammo initiative\n\nDefence\n\n##### Don't delay EU deforestation rules, food giants tell Brussels\n\n##### Hamas official says group still needs time to study Trump's Gaza plan\n\n##### Spain moves to enshrine abortion as constitutional right\n\n## Opinions\n\n##### The Brief – Dare we touch Russia's golden goose?\n\nOpinion\n\n##### Where is Europe's economic drone wall?\n\n##### The Brief – The lessons of Kosovo: Why Gaza needs more than a protectorate\n\n## Economy\n\n##### Belgian PM De Wever leaves door open for Ukraine reparation loan\n\nEconomy\n\n##### Russian threats to confiscate EU assets show ‘sanctions are working’, says Brussels\n\n##### Brussels to ‘streamline’ EU budget rules\n\n##### HARVEST: Cinnamon warning\n\n##### EU fishers net another trade fight, this time over tuna with Thailand\n\n##### Don't delay EU deforestation rules, food giants tell Brussels\n\n##### FIREPOWER: Military mobility next in simplification crusade\n\n##### Czech populists split on future of key Ukraine ammo initiative\n\n##### French army declares readiness to down drones entering its airspace\n\n## Across Europe\n\n##### Spain moves to enshrine abortion as constitutional right\n\n##### Munich airport resumes flights after drone sightings trigger closure\n\n##### Babiš leads before Czech vote but smaller parties hold keys to government\n\n##### Anti-EU online disinformation floods Czechia before elections\n\n## Advocacy Lab content\n\n##### Media Partnership - Clear Standards for Clean Steel: The Role of LESS in Developing European Lead Markets\n\n##### Can Europe future proof chemical testing and seize the shift away from animal models?\n\n##### Tech titans are emerging from Europe’s energy companies\n\n##### Grappling with accelerating climate risks - Is it time to explore research into Solar Radiation Modification?\n\n##### FIRST AID: EU health chief faces pushback over fast-tracked Biotech proposal\n\n##### Treat dementia with the same ambition as cancer, says MEP Vautmans\n\n##### Drugmakers divided over Poland’s new pharma litigation rules\n\n##### VOLTAGE: Green groups unsettled as EU executive hears industry call for environmental deregulation\n\n##### Munich airport resumes flights after drone sightings trigger closure\n\n##### Industry 'laggards' tell commissioner to go for environmental deregulation\n\n## Promoted content\n\n##### From Blind Spot to Priority: Building a Water-Smart EU Budget for 2028–2034\n\n##### Beyond the Institutions: How Associations Keep Europe Connected\n\n##### Turning CO₂ Waste into a Resource: The ICO2NIC Project\n\n##### Europe’s Water Framework Directive and the Nickel Environmental Quality Standard risks undermining its Green Ambitions\n\n## Tech\n\n##### THE HACK: DSA failure amid Czechia election drama\n\nTech\n\n##### Anti-EU online disinformation floods Czechia before elections\n\n##### EU countries back Commission plan to tackle sovereign washing by US clouds\n\n## Euractiv's Pro newsletters\n\n##### FIREPOWER: Europe's defence ministers 'junior' no more\n\n##### HARVEST: Mending the ties that politics has severed\n\n##### THE HACK: Commission's quantum rules paradox\n\n##### FIRST AID: Biotech industry urges incentives in Commission’s regime proposal\n\n##### VOLTAGE: German and Spanish electricity grids in the spotlight again\n\n## The Rapporteur\n\n##### Babiš poised for a comeback\n\n##### Big hybrid threats, small EU steps\n\n##### Omnibus, omni-blame\n\n##### Brussels' desperate measures for Ukraine",
      "source": "News Source",
      "date": "2025-10-03T10:12:41.107Z"
    },
    {
      "title": "Latest News in EL PAÍS English",
      "url": "https://english.elpais.com/latest-news/?utm_source=valyu.network&utm_medium=referral&utm_campaign=ai_pilot&utm_content=ai_query",
      "image_url": {
        "0": "https://images.english.elpais.com/resizer/vf9Osm0ICEGR8hFZvQdXaZ1Sask=/200x200/cloudfront-eu-central-1.images.arcpublishing.com/prisa/WPQVX7BCBRHEPF6ES56RRQTEPI.jpg",
        "1": "https://imagenes.elpais.com/resizer/v2/BVZNMXQK75B5HHOG4KZ4RBSIHI.jpg?auth=9ada136b399fc06377439431a1f191ad9dc620b93d3dec194b02f391b90b2b93&width=414&height=233&smart=true",
        "2": "https://imagenes.elpais.com/resizer/v2/M2I6NPTSSBPHJE7XZTIVKY6ZCY.jpg?auth=70d44c85828ae882b0c75677e51386da4dc3107cde942b0214c4f740b33ba7ed&width=414&height=233&smart=true",
        "3": "https://imagenes.elpais.com/resizer/v2/2RWTXHVYOZHX7GJSQQQ5EWDJWU.jpg?auth=c3a7750cda8a41f375dce4ac2137ac2804e3e7e0c2f8143e04af6239b863d339&width=414&height=233&focal=1038%2C1656",
        "4": "https://imagenes.elpais.com/resizer/v2/XJJQAP72KBCEZOEJ4AQYZ52VZQ.jpg?auth=300b72bd1eac872ec72ed3070ccba3e16de1e943052cf8718323f97e06dce6b5&width=414&height=233&focal=1601%2C2546"
      },
      "content": "Photographer Mauricio Morales began his journey in Barcelona and stopped in Greece a few days before the civilian maritime mission he was participating in was attacked by the Israeli army\n\nAfter winning a Latin Grammy for her debut album, the Mexican singer is nominated again for a single from her second album, ‘Como un pájaro’\n\nThe government understands that the US warships anchored in the Caribbean Sea are not focusing on alleged drug shipments as much as they are on President Maduro and his closest aides\n\nThe warning comes after Trump sent a confidential notice to Congress stating that the United States is in a ‘noninternational armed conflict’ with drug cartels\n\nThe series, in which a hilarious quartet of women shared a home and the challenges of middle age, brought to the table debates unthinkable for a family show, from AIDS to sex and loneliness\n\nThe global diva and a celebrated photographer forged a legendary visual collaboration. Benjamin Lindbergh recalls what the star meant to his dad\n\nThe singer, who keeps dropping hints about her 12th studio release, has a busy schedule: she will release her songs on Friday, show a documentary about it, and appear on three television programs\n\nThe European body has halted the convening of its executive committee, while the international federation has not included the possible sanction in its council meeting Thursday\n\nDepartment of Homeland Security advisor Corey Lewandowski said in a podcast that he finds it ‘shameful’ that the Puerto Rican artist will play the halftime show\n\nPatients with this disorder use a strange way to ask for attention: they pretend to be sick\n\nDominick Skinner is dedicated to tracking the identities of immigration officials. Hundreds of volunteers have participated in his project, and in the last 30 days alone, his website has received nearly a million visits\n\nA group of about 1,000 people are walking north from Tapachula with the goal of staying in Mexico City instead of crossing the border into American territory\n\nThe research, which followed dozens of siblings for nearly half a century, found that physical activity in midlife showed a modest positive association with verbal fluency, but not with other cognitive functions\n\nThe city awoke on Wednesday to a Sunday vibe, with very little traffic and tourist attractions closed ‘until further notice’ due to the lack of agreement between Republicans and Democrats\n\nThe Israeli military boarded at least 21 of the 44 boats sailing to the Strip with aid, including the ‘Captain Nikos,’ on which EL PAÍS was traveling. Among those detained was Swedish activist Greta Thunberg\n\nMembers of the flotilla, which includes an EL PAÍS journalist, had spotted around 20 vessels nearby earlier. The flotilla had already entered the exclusion zone established by the Israeli military\n\nShe revolutionized science since the 1960s with her innovative methods and fascinating discoveries about wild chimpanzees\n\nAccording to a survey, Mexicans approve of the president thanks to her social support programs\n\nThe Mexican poet describes the chatbot learning process and defends its use to further develop and promote the language\n\nAna María Quispe tells EL PAÍS that the Church is obstructing payment for her psychologist, and that an accused priest is escaping accountability by leaving the clergy. Pope Leo speaks out for the first time: ‘There has been a lot of manipulation of the case’\n\nTrump’s anti-immigration narrative has shaped the dynamics of the border even though the number of returnees has fallen and the deportee camp is operating below capacity\n\nNATO allies send anti-aircraft systems and reinforcements to Copenhagen after drone incursion\n\nGovernor Castro is considering vetoing the measure, which was in effect in the 1990s and is being reintroduced just as police fatality rates have fallen\n\nThis Wednesday, the government is due to set the maximum refugee quota for the next fiscal year, but the current freeze in the system suggests that those with pending cases will have to keep waiting\n\nThe state has passed legislation related to mental health in prisons, AI-generated pornography, and privacy\n\nThe Mexican leader’s first year in office highlights the tension between pursuing an expansive oil policy while seeking regional leadership on environmental issues\n\nThe mission, in which EL PAÍS is traveling, reports that a Navy boat surrounded several ships and remotely disabled their communication systems\n\nThe disagreement over healthcare spending has pushed the government into a shutdown, almost seven years after the last one\n\nThe Harvard Medical School professor warns of the dangers of new technologies to enhance brain capacity, because what improves some abilities can worsen others\n\nThis preliminary work opens the door for infertile women and same-sex couples to have children with their own genetic material\n\nThe Islamist group will respond to the ceasefire proposal on Wednesday, a spokesperson told CBS News\n\nA previously unknown report alleges that the president of El Salvador cultivated a close relationship with the former US ambassador to the country and current representative in Mexico, Ronald D. Johnson, and asked him to fire a contractor who was helping to investigate senior Salvadoran officials\n\nThe families of the two hospitalized victims and the deceased face silence from the Trump administration, which is using the attack to justify its domestic military deployment\n\nThe crossfire between Los Chapitos and the faction loyal to ‘El Mayo’ Zambada has generated a spike in disappearances in the last year with a dominant pattern: male, up to 40 years old, and from Culiacán\n\nThe Prosecutor’s Office accuses him of having murdered at least five people in his home after having lured them there with false promises\n\nThe text places the Islamist party-militia between a rock and a hard place, demanding its surrender and the immediate handing over all hostages, with no compensation other than the end of the massacre and the renunciation of ethnic cleansing\n\nShutdowns force many government offices to close their doors, lay off workers, and suspend programs until funding is restored\n\nDisagreement over funding for public health services threatens to turn off the tap of public money for the first time since 2018\n\nIsraeli Prime Minister Benjamin Netanyahu has accepted the plan after meeting with his US counterpart at the White House\n\nA short but illuminating book by veteran French historian Claude Quétel examines the truths and myths surrounding the Nazi leader\n\nWaymo and Tesla already offer self-driving car rides in several US cities, while in China robotaxis are circulating in major cities\n\nOn the quarter-century anniversary of the animated series, broadcast in 150 countries, its creators highlight the importance of Latin culture amid Trump’s attacks\n\nGarcía Harfuch relies on leaders trained and seasoned in the now-defunct force to shape part of the president’s shift, sidelining the Armed Forces with seemingly good results\n\nFigures like the late Charlie Kirk and Jake and Logan Paul have something in common: they all support the Republican’s narrative and have pushed the digital conversation in his favor\n\nArgentina’s economy minister draws on his stock-trading past to make risky moves that divide opinion\n\nThe unprecedented US financial aid, hailed at the Casa Rosada as a major victory, puts the Argentine president under the Republican’s influence\n\nThe wife of the slain Trump activist has emerged as a rising public figure at the crossroads of politics and religion in US conservatism\n\nThe industry would rather not talk about this task. But tiptoeing around it and avoiding the term only fuels misinformation about a process largely shaped by regulatory demands\n\nOn the outskirts of San Salvador, a real estate company is threatening to evict the residents of the Primero de Diciembre neighborhood. This pattern is playing out across the country amid a rapid wave of land privatization and gentrification\n\nAfter exploring sex in his first books, the writer delves into illness and US social violence in his novel ‘Small Rain’\n\nDefectors from the Pyongyang regime describe the growing repression and deterioration of human rights denounced by the UN\n\nPublishers and non-profit groups in Spain, Portugal, Australia and Ireland share the same conviction: that the best writers of children’s books are the kids themselves\n\nThe risk of the National Guard deployments is that our reflexive militarism moves us, mindlessly, towards fascism\n\nThe current owners of the legendary Manhattan restaurant manage the 99-year-old establishment with respect and care, protecting it from property speculation\n\nWhile the official narrative tries to avoid the word ‘poverty,’ the inequality that the revolutionaries promised to eradicate is increasingly evident\n\nMoscow is cracking down on complaints calling for the return of troops three years after the draft that shocked Russia\n\nEU-funded researchers are cultivating fungi on agricultural waste to create smarter and greener construction materials able to adapt and react to their environment, and even repair themselves\n\nThe writer and filmmaker from Zimbabwe decries the destruction caused by colonialism in her country, and looks to rebuild an identity that has been shattered\n\nWith interest rates soaring and reserves in the red, Argentina’s far-right president is finding it increasingly difficult to keep his fiscal adjustment afloat. He is hoping a recent pledge from the White House will save him from the abyss\n\nAmericans are facing a countdown to save democracy. With the government against them, civil society will be crucial in this challenge\n\nFrom an evolutionary anthropological perspective, human beings have adapted to be able to run and work out without shoes, and biomechanics show the practice can be beneficial if adopted gradually\n\nFor 150 years, the bag has been a symbol of childhood. It is handcrafted and used throughout elementary school. The most luxurious models can cost over $1,000\n\nA lethal mix of cannabis and synthetic opioids up to 25 times more potent than fentanyl is causing dozens of deaths and has become a public health emergency in countries like Liberia and Sierra Leone",
      "source": "News Source",
      "date": "2025-10-03T10:12:41.107Z"
    },
    {
      "title": "Europe needs political will to act and cut ties with Russia, says Zelenskyy after leaders summit – as it happened | Europe | The Guardian",
      "url": "https://www.theguardian.com/world/live/2025/oct/02/epc-european-political-community-leaders-copenhagen-denmark-ukraine-russia-europe-live?utm_source=valyu.network&utm_medium=referral&utm_campaign=ai_pilot&utm_content=ai_query",
      "image_url": {
        "0": "https://i.guim.co.uk/img/media/86bda33912374d018cf93b6a6e5ae0e4f6eb303c/500_224_2066_1653/master/2066.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&precrop=40:21,offset-x50,offset-y0&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctbGl2ZS5wbmc&enable=upscale&s=d6b0a5c6aeaf29fc8c23ec6c2d2c04dc",
        "1": "https://i.guim.co.uk/img/media/86bda33912374d018cf93b6a6e5ae0e4f6eb303c/500_224_2066_1653/master/2066.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&precrop=40:21,offset-x50,offset-y0&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctbGl2ZS5wbmc&s=ccf73c7600a14d06d21e3e651d7b1e8a"
      },
      "content": "Europe live with Jakub KrupaEurope\n\n# Europe needs political will to act and cut ties with Russia, says Zelenskyy after leaders summit – as it happened\n\nComments from Ukraine’s president come after the seventh summit of the European Political Community Updated 17h agoJakub KrupaThu 2 Oct 2025 12.07 EDTFirst published on Thu 2 Oct 2025 03.59 EDTShare",
      "source": "News Source",
      "date": "2025-10-03T10:12:41.107Z"
    },
    {
      "title": "Arsenal news: European football home form analysis - BBC Sport",
      "url": "https://www.bbc.co.uk/sport/football/articles/c4gjylv78rjo?utm_source=valyu.network&utm_medium=referral&utm_campaign=ai_pilot&utm_content=ai_query",
      "image_url": {
        "0": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/2afc/live/1e35d2c0-9f96-11f0-92db-77261a15b9d2.jpg",
        "1": "https://ichef.bbci.co.uk/ace/standard/1200/cpsprodpb/ef24/live/c9c20530-9f93-11f0-928c-71dbb8619e94.png",
        "2": "https://ichef.bbci.co.uk/ace/standard/480/cpsprodpb/e80d/live/cfccc3f0-a026-11f0-928c-71dbb8619e94.jpg",
        "3": "https://ichef.bbci.co.uk/ace/standard/480/cpsprodpb/37d0/live/9be79700-9e9f-11f0-b741-177e3e2c2fc7.jpg",
        "4": "https://ichef.bbci.co.uk/ace/standard/320/cpsprodpb/496b/live/cb48f550-9f7d-11f0-b741-177e3e2c2fc7.jpg"
      },
      "content": "Image source, Getty ImagesImage caption, This graphic is about current winning streaks only\n\nByTom McCoyBBC Sport Journalist\n\nArsenal's 2-0 win against Olympiakos maintained their formidable recent record at home in the league or group phase of European competitions.The Gunners have won their past 14 such games at Emirates Stadium in either the Champions League or Europa League, keeping clean sheets in each of the previous 11. Only Liverpool, with 15 straight victories, are currently on a longer winning streak.Mikel Arteta's side do not have an unblemished home record in knockout matches during this period, having lost to Paris St-Germain in the Champions League semi-finals last term. PSV Eindhoven also escaped defeat in north London earlier this year (losing heavily on aggregate), while Sporting won on penalties there in the Europa League in 2023.But Arsenal's record in the preliminary stage is mightily impressive. They will look to extend that winning run in their next Champions League game, with Atletico Madrid the visitors on 21 October.\n\n## Related topics\n\n- [Arsenal](https://www.bbc.co.uk/sport/football/teams/arsenal) - [Football](https://www.bbc.co.uk/sport/football)",
      "source": "News Source",
      "date": "2025-10-03T10:12:41.107Z"
    },
    {
      "title": "Asia - Latest News",
      "url": "https://www.breitbart.com/asia/?utm_source=valyu.network&utm_medium=referral&utm_campaign=ai_pilot&utm_content=ai_query",
      "image_url": {
        "0": "https://media.breitbart.com/media/2025/10/AP25273371089707-640x480.jpg",
        "1": "https://media.breitbart.com/media/2025/09/Taliban-telecom-equipment-Afghanistan-420x315.jpg",
        "2": "https://media.breitbart.com/media/2025/09/Microsoft-building-in-China-supports-Censorship-420x315.jpg",
        "3": "https://media.breitbart.com/media/2025/09/AP25272576248066-420x315.jpg",
        "4": "https://media.breitbart.com/media/2025/10/china-navy-ships-getty-420x315.jpg"
      },
      "content": "# Asia - Latest News\n\nChinese Dictator Xi Jinping Calls for ‘Strict Law Enforcement’ over Religion\n\nChinese dictator Xi Jinping told his Politburo on Monday that tougher law enforcement in religious affairs was needed to complete the project of “Sinicizing” all faiths, which means making them all subordinate to the authority of the Chinese Communist Party.\n\nJohn Hayward\n\nExclusive: Protecting America Initiative Ad Highlights National Security Issues of Chinese-Made Medical Supplies\n\nHannah Knudsen\n\nTaliban Shuts Down Internet in Afghanistan to ‘Prevent Immoral Activities’\n\nJohn Hayward\n\nMicrosoft Hosts Software that Enables China’s Censorship Empire\n\nLucas Nolan\n\nKremlin Claims Putin Ready to Meet with Trump in Moscow\n\nJohn Hayward\n\nNorth Korea Takes the Stage at U.N.: ‘We Will Never Give Up Nuclear’\n\nFrances Martel\n\nChina Manipulates U.N. to Justify Invading Taiwan\n\nThe People’s Republic of China (PRC) on Tuesday published a “position paper” that twisted a United Nations resolution from 1971 into a legal justification for seizing Taiwan by force – and suggested nations attempting to defend Taiwan from such an invasion would be violating the same U.N. resolution.\n\nJohn Hayward2 Oct 2025, 4:20 PM PDT\n\nFailing to Stop Them, Russia Announces Plan to Ignore U.N. Sanctions on Iran\n\nThe government of Russia confirmed on Wednesday that it would entirely disregard United Nations “snapback” sanctions on Iran reimposed this week after the International Atomic Energy Agency (IAEA) ruled Iran in violation of international laws governing nuclear development.\n\nFrances Martel2 Oct 2025, 3:37 PM PDT\n\nColombia: Marxist President Gustavo Petro Fires Beijing Embassy Team for ‘Sabotaging’ China Outreach\n\nFar-left President Gustavo Petro purged Colombia’s diplomatic staff in China reportedly claiming they “sabotaged” his administration’s outreach to the communist regime.\n\nChristian K. Caruzo2 Oct 2025, 1:10 PM PDT\n\nAP Botches Taliban Internet Outage Story, Relying on Unconfirmed WhatsApp Message\n\nThe Associated Press (AP) on Wednesday retracted a story that incorrectly quoted a Taliban official denying that Afghanistan’s Internet access has been deliberately shut down.\n\nJohn Hayward2 Oct 2025, 10:24 AM PDT\n\nLeftist South Korean Government Fails to Silence Anti-Communist-China Protesters\n\nA court in Seoul ruled that a police attempt to silence a protest against the Chinese Communist Party was illegal.\n\nFrances Martel2 Oct 2025, 9:24 AM PDT\n\nPictures: Scores of People Dead After 6.9-Magnitude Earthquake in Philippines\n\nAt least 72 people have been killed and more than 200 others were injured after a 6.9-magnitude earthquake struck the central Philippines on Tuesday night.\n\nAlana Mastrangelo2 Oct 2025, 9:20 AM PDT\n\nChinese Dictator Xi Jinping Calls for ‘Strict Law Enforcement’ over Religion\n\nChinese dictator Xi Jinping told his Politburo on Monday that tougher law enforcement in religious affairs was needed to complete the project of “Sinicizing” all faiths, which means making them all subordinate to the authority of the Chinese Communist Party.\n\nJohn Hayward1 Oct 2025, 3:25 PM PDT\n\nExclusive: Protecting America Initiative Ad Highlights National Security Issues of Chinese-Made Medical Supplies\n\nThere is a real danger in the Chinese Communist Party’s (CCP) involvement in so many facets of American life, including making our medical supplies, as the Protecting America Initiative makes clear in a six-figure ad campaign first obtained by Breitbart News.\n\nHannah Knudsen1 Oct 2025, 6:00 AM PDT\n\nTaliban Shuts Down Internet in Afghanistan to ‘Prevent Immoral Activities’\n\nA massive Internet blackout struck Afghanistan on September 29, evidently imposed by the Taliban regime to “prevent immoral activities.”\n\nJohn Hayward30 Sep 2025, 2:51 PM PDT\n\nMicrosoft Hosts Software that Enables China’s Censorship Empire\n\nMicrosoft hosts ready-to-use political censorship software on its Azure Marketplace in China, further evidence of how the company has aided the development and implementation of the country’s repressive system of political control.\n\nLucas Nolan30 Sep 2025, 11:26 AM PDT\n\nKremlin Claims Putin Ready to Meet with Trump in Moscow\n\nKremlin spokesman Dmitry Peskov said on Sunday that Russian President Vladimir Putin is prepared to meet with U.S. President Donald Trump in Moscow, if Trump is willing to make the trip.\n\nJohn Hayward30 Sep 2025, 10:27 AM PDT\n\nNorth Korea Takes the Stage at U.N.: ‘We Will Never Give Up Nuclear’\n\nNorth Korea’s representative at the United Nations took the podium at the General Assembly on Monday to declare that Pyongyang would never give up its illicit nuclear weapons program, going as far as to credit the country’s pursuit of nuclear weapons with the peaceful status quo on the Korean Peninsula.\n\nFrances Martel29 Sep 2025, 3:49 PM PDT\n\nExclusive — Republican Leaders: China’s Opposition to Trump Energy Dominance Policies Proves America Is ‘Back’\n\nRepublican leaders in both chambers of Congress said that a Chinese government official’s opposition to the proposed repeal of a Biden-era regulation on power plants shows that China wants America to limit its domestic energy supply through self-imposed “red tape and burdensome regulations.”\n\nSean Moran29 Sep 2025, 11:29 AM PDT\n\nState Department: Latin America Turning Its Back on ‘Crappy’ Chinese Debt Trap Deals\n\nLatin America, once fertile ground for China to sign “Belt and Road” infrastructure deals with poor countries, is turning its back on “crappy” construction projects that erode the sovereignty of local governments, a senior State Department official told Breitbart News.\n\nFrances Martel28 Sep 2025, 8:31 PM PDT\n\nBeijing Leads Effort to Block U.S. from Reclaiming Bagram Air Base in Afghanistan\n\nThe South China Morning Post (SCMP) reported on Friday that China is leading the effort to prevent the United States from regaining control of Bagram air base in Afghanistan.\n\nJohn Hayward26 Sep 2025, 3:18 PM PDT\n\nChina Condemns ‘Bullying,’ Warns of Return of ‘Law of the Jungle’ at U.N.\n\nChinese Premier Li Qiang, representing totalitarian dictator Xi Jinping, told attendees at the United Nations General Assembly on Friday that the world faces the threat of returning to the “law of the jungle” and touted Xi’s “global governance initiative” as the solution.\n\nFrances Martel26 Sep 2025, 1:02 PM PDT\n\nPakistan PM Praises Trump, Rages Against India and Israel at U.N.\n\nPakistani Prime Minister Shehbaz Sharif delivered a long and frequently belligerent speech to the U.N. General Assembly on Friday, railing against India for what he described as unprovoked aggression in May, and claiming Pakistan humiliated the Indian military in response.\n\nJohn Hayward26 Sep 2025, 11:42 AM PDT\n\nFIGHT CLUB EXCLUSIVE — Peter Navarro on BRICS: India Can’t Keep Siding with China and Russia Against the U.S.\n\nPeter Navarro, senior counselor to President Donald Trump for trade and manufacturing, predicted that the government of India would soon have to choose between its alliance with the United States and profitting from business with Russia and China during a special Founders Roundtable on Breitbart Fight Club on Thursday evening.\n\nFrances Martel26 Sep 2025, 9:54 AM PDT\n\nRussia Helping China Prepare to Invade Taiwan Says London Defence Think Tank\n\nRussia is selling military equipment and technology to China that could help Beijing prepare an airborne invasion of Taiwan, says RUSI.\n\nBreitbart London26 Sep 2025, 9:07 AM PDT\n\nChina-Friendly Canadian PM Mark Carney Uses U.N. Visit to Cozy Up to Beijing\n\nCanadian Prime Minister Mark Carney met with Chinese Premier Li Qiang on the sidelines of the U.N. General Assembly (UNGA) in New York City on Tuesday.\n\nJohn Hayward26 Sep 2025, 6:55 AM PDT\n\nReport: Chinese Drone Experts Worked with Sanctioned Russian Arms Company\n\nReuters reported on Thursday that Chinese drone experts have visited Russia to work on military drones for IEMZ Kupol, a weapons manufacturer owned by the Russian government that was placed under sanctions by the U.S. government in 2023.\n\nJohn Hayward25 Sep 2025, 4:18 PM PDT\n\nAzerbaijan Thanks Trump for Brokering Peace with Armenia in U.N. Address\n\nPresident Ilham Aliyev of Azerbaijan spent much of his address to the U.N. General Assembly (UNGA) in New York City on Thursday celebrating victory in a great “patriotic war” against Armenia, which he accused of illegally occupying territory which Azerbaijan had to retake by force.\n\nJohn Hayward25 Sep 2025, 12:50 PM PDT\n\n‘Together’ Pulled from Chinese Theaters After AI Used to Make a Gay Wedding a Heterosexual One\n\nNeon has pulled its body horror film “Together” from theaters in China after a local distributor censored a same-sex wedding scene.\n\nPaul Bois25 Sep 2025, 11:56 AM PDT\n\nIndonesian President Prabowo Subianto Calls for Peace with Israel at UN\n\nIndonesian President Prabowo Subianto, who leads the world’s most populous Muslim nation, surprised observers by calling for peace and security for the Jewish state of Israel in his speech Wednesday at the opening of the United Nations General Assembly in New York.\n\nJoel B. Pollak25 Sep 2025, 2:30 AM PDT\n\nXi Jinping Visits Uyghur Genocide Region to Celebrate 70th Anniversary of Conquest\n\nChinese dictator Xi Jinping made a rare visit to Xinjiang province to celebrate the 70th anniversary of Chinese conquest.\n\nJohn Hayward24 Sep 2025, 1:40 PM PDT\n\nCongressmen Led by Dem Adam Smith Meet with Chinese Defense Minister After Threat to Attack Taiwan\n\nA House of Representatives delegation led by Rep. Adam Smith (D-WA) arrived this weekend in Beijing, China, and held a rare in-person meeting with Chinese Defense Minister Dong Jun on Monday.\n\nFrances Martel24 Sep 2025, 6:11 AM PDT\n\nLeftist South Korean President Cheers Demise of Impeached Conservative Predecessor at U.N.\n\nSouth Korean President Lee Jae-myung told the U.N. General Assembly on Tuesday that the eighty-year history of the Republic of Korea was proof that the United Nations can bring positive change to the world.\n\nJohn Hayward23 Sep 2025, 1:08 PM PDT\n\nHayward: What BRICS Has to Lose at this Year’s U.N. General Assembly\n\nThe 2025 U.N. General Assembly (UNGA) will likely be dominated by the drama over European states unilaterally declaring Palestinian independence, but it will also be an important week for the BRICS economic collective, which has positioned itself as an alternative to the post-World War II international order led by the United States and Europe.\n\nJohn Hayward22 Sep 2025, 5:22 PM PDT\n\nPrime Minister Modi Urges Indians to ‘Get Rid’ of ‘Foreign-Made Products’\n\nIndian Prime Minister Narendra Modi gave an address to the nation on Sunday in which he told his citizens to stop using “foreign made” products.\n\nJohn Hayward22 Sep 2025, 1:02 PM PDT\n\nIndonesia ‘Free School Lunch’ Program Leads to Mass Poisoning\n\nHealth experts on Monday urged the Indonesian government to suspend its program of free school meals after hundreds of children became sick from eating tainted food.\n\nJohn Hayward22 Sep 2025, 10:22 AM PDT\n\nVladimir Putin Opens Russia’s Eurovision Knockoff, ‘Intervision,’ Declaring Music Has ‘No Borders’\n\nVietnamese performer Duc Phuc won the Moscow-hosted “Intervision Song Contest” this weekend, a revival of a Cold War-era alternative to the Eurovision Song Contest that strongman Vladimir Putin hailed as a display of “respect for traditional values” and “diversity.”\n\nFrances Martel22 Sep 2025, 8:53 AM PDT\n\nNorth Korea’s Kim Has ‘Good Memories’ of Trump, Is Ready to Discuss Everything Except Nukes\n\nNorth Korea’s Kim Jong-un says he has “good personal memories” of talks with President Trump, but will not discuss denuclearization.\n\nJohn Hayward22 Sep 2025, 8:42 AM PDT\n\nExclusive: The CEO Who Wants to Make Her Bank the U.S. Gateway to Central Asia\n\nWashington, D.C. –When Umut Abakirova graduated from the American University of Central Asia, she began her career as a loan officer. Two decades later, she is one of Central Asia’s most prominent women in finance: chief executive of Bakai Bank, one of the Kyrgyz Republic’s largest private lenders.\n\nJohn Carney22 Sep 2025, 6:22 AM PDT\n\nPakistan Says Defense Pact with Saudi Arabia May Include Nuclear Program\n\nPakistani Defense Minister Khawaja Mohammad Asif on Thursday answered a lingering question about the new defense pact between his country and Saudi Arabia by confirming that Pakistan’s nuclear arsenal is covered by the agreement.\n\nJohn Hayward19 Sep 2025, 4:33 PM PDT\n\nReport: Chinese Defense Universities Help Russia Evade Sanctions\n\nThe Australian Strategic Policy Institute finds Chinese and Russian defense universities are cooperating in a way that evades sanctions.\n\nJohn Hayward19 Sep 2025, 2:53 PM PDT\n\nTaliban Rejects Trump Call to Retake Bagram Air Base\n\nA senior Taliban terrorist responded to President Donald Trump announcing on Thursday that he was working to reclaim Afghanistan’s Bagram military base by rejecting the possibility of a renewed U.S. military presence in the country.\n\nFrances Martel19 Sep 2025, 2:41 PM PDT\n\nTaliban’s Friends Pressure U.N. to Accept Jihadis at Security Council\n\nAt a U.N. Security Council (UNSC) meeting on Wednesday, several countries that share ideological interests with the Taliban, or have financial interests in Afghanistan, urged the council to “engage” with the junta despite its absolute refusal to comply with U.N. human rights standards.\n\nJohn Hayward19 Sep 2025, 2:24 PM PDT\n\n‘We Oppose Spreading False Info,’ China Says After Blaming MAGA for Charlie Kirk Assassination\n\nChinese Foreign Ministry spokesman Lin Jian on Thursday testily denied that China is spreading disinformation about the assassination of American conservative Charlie Kirk, even though Chinese, Russian, and Iranian state media have been caught doing exactly that.\n\nJohn Hayward19 Sep 2025, 11:45 AM PDT\n\nTrump Announces State Visit to China in 2026 After Call with Xi\n\nAfter a phone call with Chinese President Xi Jinping, President Donald Trump said he will visit China early next year and Xi will visit the U.S. at “an appropriate time.”\n\nNick Gilbertson19 Sep 2025, 11:32 AM PDT\n\nTaliban Attacks U.N. Secretary-General for ‘Ignorance of Sharia’\n\nThe Taliban junta in Afghanistan on Thursday condemned U.N. Secretary-General Antonio Guterres for denouncing its brutish treatment of women, claiming Guterres lacks the required credentials in Islamic sharia law to comment on the Taliban’s conduct.\n\nJohn Hayward19 Sep 2025, 8:14 AM PDT",
      "source": "News Source",
      "date": "2025-10-03T10:12:41.108Z"
    },
    {
      "title": "AJA Newsbites – October 2, 2025 - THE AsiaN",
      "url": "https://theasian.asia/archives/202732?utm_source=valyu.network&utm_medium=referral&utm_campaign=ai_pilot&utm_content=ai_query",
      "image_url": {
        "0": "https://theasian.asia/wp-content/uploads/2025/08/image-1.png",
        "1": "https://theasian.asia/wp-content/uploads/2025/06/AJA-1-357x220.png",
        "2": "https://theasian.asia/wp-content/uploads/2025/08/image-357x220.png",
        "3": "https://theasian.asia/wp-content/uploads/2025/08/image-1-357x220.png",
        "4": "https://theasian.asia/wp-content/uploads/2012/10/Military-calls-pro-NK.jpg"
      },
      "content": "AJA Newsbites is a curated roundup of major news and developments from across Asia, brought to you by members of Asia Journalist Association (AJA)\n\nLee Sang-ki, THE AsiaN, KoreaThe Korean Publishers Association has withdrawn its Special Contribution Prize, which was initially awarded jointly to Professor Park Yu-ha and publisher Jong-joo Jeong.Park, author of Comfort Women of the Empire, had fought an 11-year legal battle, culminating in a Supreme Court ruling last year that lifted the ban on her book. She was recognized for her defense of academic freedom, while Jeong was honored for his dedication to protecting freedom of publication.However, the association reversed its decision following strong opposition from civic groups, including the Korean Council for Justice and Remembrance. In response, Park expressed her gratitude that their efforts to uphold academic and publishing freedom were acknowledged, though she voiced regret that Jeong’s contributions were also nullified.The case has come to symbolize the deep tension between scholarly freedom and prevailing social and political pressures.\n\nNorila Daud, Malaysia World News, MalaysiaPrime Minister Datuk Seri Anwar Ibrahim has expressed his deep sorrow over the devastating earthquake that struck Cebu and surrounding areas in the Philippines late Tuesday.“The loss and hardship endured by so many families weigh heavily on our hearts, and Malaysia mourns with the people of the Philippines during this time of grief. On behalf of the Government and the people of Malaysia, I extend our heartfelt condolences and sympathies to the Government and people of the Philippines, especially to the families who have lost their loved ones.“Our thoughts and prayers are also with the injured, the displaced, and all those whose lives have been upended by this tragedy. Malaysia stands in full solidarity with the Philippines. We will do what we can to support relief and recovery efforts, and we pray that the strength and resilience of the Filipino people will see them through these challenging days,” Anwar said in a Facebook post today (Wednesday).\n\nPooneh Nedai, Shokaran Magazine, IranThe 38th Tokyo International Film Festival will showcase two Iranian films in its “Asian Future” section. While Iranian cinema is absent from the main competition lineup, Eastward Bound by Arash Anisi and Noah’s Daughter by Amir Reza Jalalian will be screened as part of this emerging voices category.Eastward Bound tells the story of a filmmaker grappling with marital issues who casts an actor against the wishes of the actor’s father, sparking a tense conflict. The film stars Shaghayegh Shourian, Masoumeh Beigi, and Amir Norouzi. Noah’s Daughter features Ali Mosaffa, Katy Saleki, and Ebrahim Azizi in a surreal tale about a young woman camping alone on an island, where dreams and reality begin to blur. The festival will run from October 27 to November 5, 2025.\n\n### AJA Newsbites\n\n### Author's other articles\n\n### AJA Newsbites – July 3, 2025\n\n### AJA Newsbites – September 21, 2025\n\n### AJA Newsbites – September 23, 2025\n\n### AJA Newsbites – July 14, 2025",
      "source": "News Source",
      "date": "2025-10-03T10:12:41.108Z"
    },
    {
      "title": "Asia open: Dancing in the dark | FXStreet",
      "url": "https://www.fxstreet.com/analysis/asia-open-dancing-in-the-dark-202510022316?utm_source=valyu.network&utm_medium=referral&utm_campaign=ai_pilot&utm_content=ai_query",
      "image_url": {
        "0": "https://editorial.fxsstatic.com/images/i/Equity-Index_NIKKEI-2_Large.jpg",
        "1": "https://www.fxstreet.com/_next/image?url=https%3A%2F%2Feditorial.fxsstatic.com%2Fauthors%2FStephen_Innes_new_pic75x75-637436148462159444.jpg&w=256&q=75",
        "2": "https://www.fxstreet.com/_next/image?url=https%3A%2F%2Feditorial.fxsstatic.com%2Fimages%2Fi%2Fgold-02.jpg&w=1536&q=75",
        "3": "https://www.fxstreet.com/_next/image?url=https%3A%2F%2Feditorial.fxsstatic.com%2Fimages%2Fi%2FEconomic-Indicator_PMI-1.png&w=1536&q=75",
        "4": "https://www.fxstreet.com/_next/image?url=https%3A%2F%2Feditorial.fxsstatic.com%2Fimages%2FRevamp.jpg&w=1536&q=75"
      },
      "content": "Markets woke today with two dominant rhythms—one driven by the AI boom’s drumbeat, the other by the muffled silence of Washington’s shutdown muffling the Fed’s compass. Traders are caught between a disco ball and a blackout, forced to dance even as the lights flicker.\n\nThe OpenAI news was the showstopper: a $500 billion valuation, already the most valuable private company in the world, vaulting from $300 billion in a blink. Whispers of $1 trillion valuations are now being spoken with a straight face. Whether this is another dot-com crescendo or the early notes of a century-defining revolution hardly matters in the near term. The music is loud, and while it plays, portfolio managers are circling the floor. AI capex is burning like a neon sign across U.S. corporate ledgers—though much of it bleeds abroad in imported chips and kit, an ironic drag on domestic GDP. It’s the oldest of Wall Street’s parables: the market prices the dream, not the footnote.\n\nMeanwhile, oil is not dancing—it’s tumbling down the stairs. Brent and WTI have slumped nearly 10% in a week, scraping multi-month lows as the specter of oversupply takes over the stage. Four-handle crude is not yet on the screens, but $64 Brent and $60 WTI aren’t far off. With OPEC+ convening this weekend, chatter of a 500,000 bpd November hike—triple October’s increase—is coursing through the tape. * That’s supply theater more than supply shock; in practice barrels are harder to muster than headlines.*\n\nStill, the price action speaks for itself. Oil is bleeding disinflation into every macro model, and equity desks love the scent of cheaper energy like oxygen at altitude. Surprised the EUR and JPY are not sniffing that out.\n\nTalk of de-dollarization was another curtain-raiser this week, but the IMF’s numbers reveal more shadow play than substance. On the surface, the dollar’s share of reserves fell to 56.3%, the lowest since the euro’s birth. But strip away FX translation effects, and the story flips: central bank dollar holdings are steady, even edging higher. For all the grand talk of multipolar reserve regimes, the greenback remains the orchestra’s conductor. Traders know this instinctively; flows follow function, and the dollar’s plumbing still runs beneath every cross-border transaction.\n\nAnd then there’s the U.S. government shutdown, which leaves Powell and company peering into darkness. The Fed cut rates in September with a “meeting-by-meeting” promise to stay data-dependent. Yet now the shutters are down on the very data they depend on—no payrolls today, no CPI on the 15th. It’s as if the Fed has been asked to steer a tanker through fog with the radar switched off. That makes October’s FOMC not just a policy meeting but a séance, where traders must divine direction without their usual analytics.\n\nFor traders in Asia this morning and around the globe, the absence of NFP is a guilty relief—a rare first week Friday without the thunderclap risk of a headline payroll surprise. The screens are quieter, the alerts still ping, but the heartbeats are slower. Some will take the early cut, step into the weekend before the next wave of OPEC headlines or AI hype rolls across the Pacific. Others will watch the tape’s flicker and note the irony: when the market flies blind, risk can feel both safer and scarier at the same time.\n\nHave a good weekend !!!\n\n* Recent analysis suggests only ~75% of planned OPEC additions have actually shown up (a ~0.5 mb/d shortfall), so another paper hike may have limited physical impact unless Saudi/UAE shoulder more. Next week, the market will tell you it’s not the quota—it’s the cargo that actually reaches shore, hence we may see a price rebound.\n\nAuthor\n\nStephen Innes\n\nSPI Asset Management\n\nWith more than 25 years of experience, Stephen has a deep-seated knowledge of G10 and Asian currency markets as well as precious metal and oil markets.\n\n### Legal Text\n\n## Markets move fast. We move first.\n\nOrange Juice Newsletter brings you expert driven insights - not headlines. Every day on your inbox.\n\n#### Editor's Picks\n\n#### EUR/USD rises toward 1.1750 ahead of US ISM Services PMI\n\nEUR/USD edges higher toward 1.1750 in the European trading hours on Friday. The US Dollar consolidates weekly losses amid shutdown-led data blackout and Fed rate-cut hopes, while traders await US PMIs and speeches from the ECB and Fed officials for fresh directives.\n\n#### GBP/USD advances above 1.3450 ahead of US ISM PMI, Fedspeak\n\nGBP/USD holds ground near 1.3450 in the European session on Friday. The US Dollar remains offered amid a slowdown in the US job market and an extended government shutdown. The US NFP report will not be published on Friday, and hence, all eyes are on the ISM Services PMI and Fedspeak.\n\n#### Gold refreshes daily top as Fed rate cut bets, geopolitical risks offset risk-on mood\n\nGold touches a fresh daily peak during the first half of the European session, though it lacks follow-through buying amid the upbeat market mood. The US Dollar struggles to capitalize on the previous day's bounce from a one-week low amid the growing acceptance that the US Fed will lower borrowing costs two more times this year.\n\n#### US ISM Services PMI expected to reflect stable momentum in the services industry\n\nThe Institute for Supply Management is scheduled to release the September Services Purchasing Managers’ Index (PMI) this Friday. The report is a well-trusted measure of business performance in the sector, but it is usually published on the same date as the US Nonfarm Payrolls report, which diminishes its relevance. This time, however, things are different.\n\n#### FXStreet launches a fresh, new design\n\nFXStreet marks a key milestone in its mission to help traders on their journey, aimed at tackling challenges in its editorial and business strategies.\n\n#### ETHFI, CAKE, SPX – DeFi tokens lead the rally\n\nDecentralized Finance (DeFi) tokens, such as Ether.fi (ETHFI) and PancakeSwap (CAKE) are leading the broader cryptocurrency market rally at the time of writing on Friday, with the meme coin SPX6900 (SPX) following suit.\n\n#### Best Brokers in 2025",
      "source": "News Source",
      "date": "2025-10-03T10:12:41.108Z"
    },
    {
      "title": "East Asia Tonight - Thu 2 Oct 2025 - CNA",
      "url": "https://www.channelnewsasia.com/watch/east-asia-tonight/thu-2-oct-2025-5382016?utm_source=valyu.network&utm_medium=referral&utm_campaign=ai_pilot&utm_content=ai_query",
      "image_url": {
        "0": "https://dam.mediacorp.sg/image/upload/s--UMi8FqP4--/c_fill,g_auto,h_676,w_1200/f_auto,q_auto/v1/mediacorp/cna/image/2025/10/02/1759407435-image.jpg?itok=QjfaejW-",
        "1": "https://dam.mediacorp.sg/image/upload/s--UMi8FqP4--/c_fill,g_auto,h_338,w_600/f_auto,q_auto/v1/mediacorp/cna/image/2025/10/02/1759407435-image.jpg?itok=QjfaejW-",
        "2": "https://dam.mediacorp.sg/image/upload/s--KEYhvF_q--/f_auto,q_auto/c_fill,g_auto,h_181,w_313/v1/mediacorp/cna/image/2025/10/03/1759423034-image.jpg?itok=nZKcXV_n",
        "3": "https://dam.mediacorp.sg/image/upload/s--UK8gJyeI--/f_auto,q_auto/c_fill,g_auto,h_181,w_313/v1/mediacorp/cna/image/2025/10/02/1759419133-image.jpg?itok=MRUnOc-Y",
        "4": "https://dam.mediacorp.sg/image/upload/s--N4TsVcN5--/f_auto,q_auto/c_fill,g_auto,h_181,w_313/v1/mediacorp/cna/image/2025/10/02/1759411034-image.jpg?itok=YkI0MeJt"
      },
      "content": "East Asia Tonight - Thu 2 Oct 2025\n\n48:32 Min Spotlight on East Asia, a region steeped in history and now helping to write the future of our world. We'll break down the key stories and explain why they matter.\n\nEast Asia Tonight\n\n## East Asia Tonight - Thu 2 Oct 2025\n\n03 Oct 2025 09:11am\n\nSpotlight on East Asia, a region steeped in history and now helping to write the future of our world. We'll break down the key stories and explain why they matter.\n\n## East Asia Tonight\n\nAbout the show: 'East Asia Tonight' shines a spotlight on a region steeped in history and now helping to write the future of our world. Greater China, Japan, and the Korean Peninsula have economic and political might, and are major drivers of daily news and business. We'll break down the key stories and explain why they matter.\n\n[Show more](https://www.channelnewsasia.com/javascript:;)\n\n## Latest Episodes\n\n[East Asia Tonight](https://www.channelnewsasia.com/watch/east-asia-tonight-0)\n\n###### East Asia Tonight - Thu 2 Oct 2025\n\n49 mins\n\n[East Asia Tonight](https://www.channelnewsasia.com/watch/east-asia-tonight-0)\n\n###### East Asia Tonight - Wed 1 Oct 2025\n\n50 mins\n\n[East Asia Tonight](https://www.channelnewsasia.com/watch/east-asia-tonight-0)\n\n###### East Asia Tonight - Tue 30 Sep 2025\n\n49 mins\n\n[East Asia Tonight](https://www.channelnewsasia.com/watch/east-asia-tonight-0)\n\n###### East Asia Tonight - Mon 29 Sep 2025\n\n49 mins\n\n[East Asia Tonight](https://www.channelnewsasia.com/watch/east-asia-tonight-0)\n\n###### East Asia Tonight - Fri 26 Sep 2025\n\n48 mins\n\n## You May Also Like\n\nContent is loading...\n\n## Popular Shows\n\n[News Video Reports](https://www.channelnewsasia.com/watch)\n\n##### Two dead after terror attack at Manchester synagogue\n\n03/10/2025 2 mins\n\n[Watch](https://www.channelnewsasia.com/watch)\n\n##### Singapore Tonight - Thu 2 Oct 2025\n\n03/10/2025 47 mins\n\n[Watch](https://www.channelnewsasia.com/watch)\n\n##### Asia Tonight - Thu 2 Oct 2025\n\n03/10/2025 47 mins\n\n[Asia](https://www.channelnewsasia.com/asia)\n\n##### Questions over safety standards of Indonesia's community oil wells\n\n03/10/2025 3 mins\n\n[Watch](https://www.channelnewsasia.com/watch)\n\n##### Asia First - Thu 2 Oct 2025\n\n03/10/2025 2 hr 29 mins\n\n[News Video Reports](https://www.channelnewsasia.com/watch)\n\n##### More young Singaporeans pursuing motorsports despite roadblocks\n\n02/10/2025 3 mins\n\n[News Video Reports](https://www.channelnewsasia.com/watch)\n\n##### Five receive President's Award for the Environment, Singapore's highest environmental accolade\n\n02/10/2025 3 mins\n\n[News Video Reports](https://www.channelnewsasia.com/watch)\n\n##### Over 100 stakeholders discuss innovative conservation strategies at Ocean Collective Summit\n\n02/10/2025 6 mins\n\n[News Video Reports](https://www.channelnewsasia.com/watch)\n\n##### A look behind the scenes of Singapore's only liquefied natural gas facility\n\n02/10/2025 3 mins\n\n[News Video Reports](https://www.channelnewsasia.com/watch)\n\n##### More signing up for Time-Of-Use electricity plans that offer cheaper rates during off-peak hours\n\n02/10/2025 3 mins",
      "source": "News Source",
      "date": "2025-10-03T10:12:41.108Z"
    },
    {
      "title": "One News Anchors Cathy Yang and Gretchen Ho Secure Top Honors at the Asian Academy Creative Awards 2025 | OneNews.PH",
      "url": "https://www.onenews.ph/articles/one-news-anchors-cathy-yang-and-gretchen-ho-secure-top-honors-at-the-asian-academy-creative-awards-2025?utm_source=valyu.network&utm_medium=referral&utm_campaign=ai_pilot&utm_content=ai_query",
      "image_url": {
        "0": "https://1cms-img.imgix.net/asian%20academy%20thumbnail.png",
        "1": "https://1cms-img.imgix.net/OneNEWS.png",
        "2": "https://www.onenews.ph/_nuxt/img/ph_star.f2d922e.png",
        "3": "https://1cms-img.imgix.net/earthquake-victims-in-Bogo-City.jpg?w=60&h=45&fit=crop&auto=compress",
        "4": "https://1cms-img.imgix.net/Earthquake-survivors-hold-Help-sign.jpg?w=60&h=45&fit=crop&auto=compress"
      },
      "content": "Politics & Other News Features\n\n# One News Anchors Cathy Yang and Gretchen Ho Secure Top Honors at the Asian Academy Creative Awards 2025\n\nOneNews. PH October 2, 2025\n\nMoney Talks with Cathy Yang was awarded Best News Program for its exceptional breaking news coverage and market analysis. Meanwhile, Gretchen Ho is this year’s National Winner for Best Factual Presenter for her insightful and comprehensive reporting.\n\nTwo leading anchors of Cignal’s premier news channel One News -- Cathy Yang and Gretchen Ho -- have won the national awards at the prestigious Asian Academy Creative Awards 2025 for their outstanding work in business and public affairs journalism.Money Talks with Cathy Yang was awarded Best News Program for its exceptional breaking news coverage and market analysis. In the winning episode, Cathy Yang provided authoritative and timely reporting on the Philippine President’s meeting with U.S. President Trump, which resulted in a 19% tariff for Philippines exports to the United StatesLaunched on February 10, 2025, Money Talks with Cathy Yang has set a new benchmark in Philippine business news reporting by leveraging on Cathy’s decades of local and international experience as a broadcast journalist. Last year, she was also the National Winner for Best Factual Presenter for the program Thought Leaders.“On behalf of my team, thank you AACA, for the honor to represent the Philippines,” says Cathy Yang. “We are immensely humbled that the judges have deemed us most outstanding among all other news programs in the Philippines, in business news or otherwise, and are now on our way to competing at the Grand Finals with our fellow regional peers,\" she added.\n\n> View this post on Instagram            A post shared by ONE News PH (@1newsph)\n\nMeanwhile, Gretchen Ho is this year’s National Winner for Best Factual Presenter for her insightful and comprehensive reporting on Morning Matters.Gretchen’s winning entry featured two key stories. The first was the on-the-ground report from the Vatican, where she delivered a self-shot video report following news of the late Pope Francis’ deteriorating health. The second was an in-studio interview where she discussed with Senate President Chiz Escudero critical legislative matters, including the then looming impeachment trial against Philippine Vice President Sara Duterte.Morning Matters is Gretchen’s first solo news-interview program, where she provides context to the biggest news stories by engaging with the day’s newsmakers from various fields with her trademark wit and charm. A former volleyball star turned broadcast journalist, she has become one of the country's most influential TV news personalities with more than five million social media followers.On receiving the award, Gretchen Ho said: “With the many events shaping our country and our world today, the responsibility of delivering the news has never been more important. Above all, truth must remain at the heart of that mission. Receiving this award is an immense honor. I am grateful to Cignal for allowing me to evolve in many ways as a broadcast journalist.“Cathy Yang and Gretchen Ho will now go on to represent the Philippines in the AACA Regional Finals, to be awarded at the Grand Awards Gala in Singapore on December 4.\n\nLatest News ‘IT WAS LOVE’: Teen, Red Cross Responder Die Saving Kin In Quake Quake Survivor: I Kept Calling Out Their Names Phivolcs: Aftershocks Could Last For Weeks; Search And Rescue Efforts Halted Trillion Peso March Organizers Staging Protest On Nov. 30 Severe Tropical Storm Paolo To Bring Heavy Rains, Strong Winds; Signal No. 3 Up In Some Areas ICC: Experts Ready To Assess Duterte’s Health Magalong On Leaving ICI: I Struck A Nerve NEWS IN CONTEXT | A Template For Regime Change Rescuers Hunt For Survivors After Philippines’ Deadliest Quake In Over A Decade Kills At Least 69 Cebu Quake Likely Caused By Fault That Had Not Moved For 400 Years; More Than 900 Aftershocks Detected – Phivolcs onefeed Show more onefeed Top headlines from the OneNews network\n\n[Politics & Other News Features](https://www.onenews.ph/categories/3_politics-and-other-news-features)\n\n### ‘IT WAS LOVE’: Teen, Red Cross Responder Die Saving Kin In Quake\n\nOctober 3, 2025 Reuters News Agency, Associated Press\n\n[Quake Survivor: I Kept Calling Out Their Names](https://www.onenews.ph/articles/quake-survivor-i-kept-calling-out-their-names)[Phivolcs: Aftershocks Could Last For Weeks; Search And Rescue Efforts Halted](https://www.onenews.ph/articles/phivolcs-aftershocks-could-last-for-weeks-search-and-rescue-efforts-halted)[Trillion Peso March Organizers Staging Protest On Nov. 30](https://www.onenews.ph/articles/trillion-peso-march-organizers-staging-protest-on-nov-30)[ICC: Experts Ready To Assess Duterte’s Health](https://www.onenews.ph/articles/icc-experts-ready-to-assess-duterte-s-health)\n\n[Youth & Education](https://www.onenews.ph/categories/4_youth-and-education)\n\n### DepEd: 1,000 DPWH-Built Classrooms ‘Unusable’\n\nSeptember 20, 2025 Bella Cariaso\n\n[DepEd To Open Transparency Portal](https://www.onenews.ph/articles/deped-to-open-transparency-portal)[DepEd, PNP Chiefs Tackle Violence In Schools](https://www.onenews.ph/articles/deped-pnp-chiefs-tackle-violence-in-schools)[PANOORIN: Ano Posibleng Sanhi Ng Sunod-Sunod Na School Violence?](https://www.onenews.ph/articles/panoorin-ano-posibleng-sanhi-ng-sunod-sunod-na-school-violence)[Stricter Preventive Measures Sought Against School Violence](https://www.onenews.ph/articles/stricter-preventive-measures-sought-against-school-violence)\n\n[Business & Innovations](https://www.onenews.ph/categories/5_business-and-innovations)\n\n### RCBC: 65 Years Of Progress, 65 Years Of Trust\n\nSeptember 23, 2025 OneNews. PH\n\n[Grab Launches Grab Asenso: A Digital Diskarte Program To Accelerate Regional MSME Digitalization In The Philippines](https://www.onenews.ph/articles/grab-launches-grab-asenso-a-digital-diskarte-program-to-accelerate-regional-msme-digitalization-in-the-philippines)[Big Heart, Bigger Cake: Celebrate With Red Ribbon Dedication Cakes](https://www.onenews.ph/articles/big-heart-bigger-cake-celebrate-with-red-ribbon-dedication-cakes)[Roxas and Company, Inc. Notice Of Annual Meeting Of Stockholders](https://www.onenews.ph/articles/roxas-and-company-inc-notice-of-annual-meeting-of-stockholders-09-05-2025)[Jollibee Group Bounces Back In Q2](https://www.onenews.ph/articles/jollibee-group-bounces-back-in-q2)\n\n[Science, Health & Environment](https://www.onenews.ph/categories/6_science-health-and-environment)\n\n### Severe Tropical Storm Paolo To Bring Heavy Rains, Strong Winds; Signal No. 3 Up In Some Areas\n\nOctober 3, 2025 Christine Boton\n\n[LPA Enters PAR; Rains Expected Over Luzon, Visayas](https://www.onenews.ph/articles/lpa-enters-par-rains-expected-over-luzon-visayas)[At Least 10 Dead As Opong Batters Bicol, Eastern Visayas, Mimaropa; Masbate ‘Hardest Hit’](https://www.onenews.ph/articles/at-least-10-dead-as-opong-batters-bicol-eastern-visayas-mimaropa-masbate-hardest-hit)[53 Areas Placed On Alert Due To Opong; Palace Activates National Disaster Response Plan](https://www.onenews.ph/articles/53-areas-placed-on-alert-due-to-opong-palace-activates-national-disaster-response-plan)[Phl Burdened With Non-Communicable Diseases; Global Body Urges Governments To Step Up Response](https://www.onenews.ph/articles/phl-burdened-with-non-communicable-diseases-global-body-urges-governments-to-step-up-response)\n\nPolitics & Other News Features\n\n# One News Anchors Cathy Yang and Gretchen Ho Secure Top Honors at the Asian Academy Creative Awards 2025\n\nOneNews. PH October 2, 2025\n\nMoney Talks with Cathy Yang was awarded Best News Program for its exceptional breaking news coverage and market analysis. Meanwhile, Gretchen Ho is this year’s National Winner for Best Factual Presenter for her insightful and comprehensive reporting.\n\nTwo leading anchors of Cignal’s premier news channel One News -- Cathy Yang and Gretchen Ho -- have won the national awards at the prestigious Asian Academy Creative Awards 2025 for their outstanding work in business and public affairs journalism.Money Talks with Cathy Yang was awarded Best News Program for its exceptional breaking news coverage and market analysis. In the winning episode, Cathy Yang provided authoritative and timely reporting on the Philippine President’s meeting with U.S. President Trump, which resulted in a 19% tariff for Philippines exports to the United StatesLaunched on February 10, 2025, Money Talks with Cathy Yang has set a new benchmark in Philippine business news reporting by leveraging on Cathy’s decades of local and international experience as a broadcast journalist. Last year, she was also the National Winner for Best Factual Presenter for the program Thought Leaders.“On behalf of my team, thank you AACA, for the honor to represent the Philippines,” says Cathy Yang. “We are immensely humbled that the judges have deemed us most outstanding among all other news programs in the Philippines, in business news or otherwise, and are now on our way to competing at the Grand Finals with our fellow regional peers,\" she added.\n\n> View this post on Instagram            A post shared by ONE News PH (@1newsph)\n\nMeanwhile, Gretchen Ho is this year’s National Winner for Best Factual Presenter for her insightful and comprehensive reporting on Morning Matters.Gretchen’s winning entry featured two key stories. The first was the on-the-ground report from the Vatican, where she delivered a self-shot video report following news of the late Pope Francis’ deteriorating health. The second was an in-studio interview where she discussed with Senate President Chiz Escudero critical legislative matters, including the then looming impeachment trial against Philippine Vice President Sara Duterte.Morning Matters is Gretchen’s first solo news-interview program, where she provides context to the biggest news stories by engaging with the day’s newsmakers from various fields with her trademark wit and charm. A former volleyball star turned broadcast journalist, she has become one of the country's most influential TV news personalities with more than five million social media followers.On receiving the award, Gretchen Ho said: “With the many events shaping our country and our world today, the responsibility of delivering the news has never been more important. Above all, truth must remain at the heart of that mission. Receiving this award is an immense honor. I am grateful to Cignal for allowing me to evolve in many ways as a broadcast journalist.“Cathy Yang and Gretchen Ho will now go on to represent the Philippines in the AACA Regional Finals, to be awarded at the Grand Awards Gala in Singapore on December 4.\n\nLatest News ‘IT WAS LOVE’: Teen, Red Cross Responder Die Saving Kin In Quake Quake Survivor: I Kept Calling Out Their Names Phivolcs: Aftershocks Could Last For Weeks; Search And Rescue Efforts Halted Trillion Peso March Organizers Staging Protest On Nov. 30 Severe Tropical Storm Paolo To Bring Heavy Rains, Strong Winds; Signal No. 3 Up In Some Areas ICC: Experts Ready To Assess Duterte’s Health Magalong On Leaving ICI: I Struck A Nerve NEWS IN CONTEXT | A Template For Regime Change Rescuers Hunt For Survivors After Philippines’ Deadliest Quake In Over A Decade Kills At Least 69 Cebu Quake Likely Caused By Fault That Had Not Moved For 400 Years; More Than 900 Aftershocks Detected – Phivolcs onefeed Show more onefeed Top headlines from the OneNews network\n\nPolitics & Other News Features\n\n# One News Anchors Cathy Yang and Gretchen Ho Secure Top Honors at the Asian Academy Creative Awards 2025\n\nOneNews. PH October 2, 2025\n\nMoney Talks with Cathy Yang was awarded Best News Program for its exceptional breaking news coverage and market analysis. Meanwhile, Gretchen Ho is this year’s National Winner for Best Factual Presenter for her insightful and comprehensive reporting.\n\nTwo leading anchors of Cignal’s premier news channel One News -- Cathy Yang and Gretchen Ho -- have won the national awards at the prestigious Asian Academy Creative Awards 2025 for their outstanding work in business and public affairs journalism.Money Talks with Cathy Yang was awarded Best News Program for its exceptional breaking news coverage and market analysis. In the winning episode, Cathy Yang provided authoritative and timely reporting on the Philippine President’s meeting with U.S. President Trump, which resulted in a 19% tariff for Philippines exports to the United StatesLaunched on February 10, 2025, Money Talks with Cathy Yang has set a new benchmark in Philippine business news reporting by leveraging on Cathy’s decades of local and international experience as a broadcast journalist. Last year, she was also the National Winner for Best Factual Presenter for the program Thought Leaders.“On behalf of my team, thank you AACA, for the honor to represent the Philippines,” says Cathy Yang. “We are immensely humbled that the judges have deemed us most outstanding among all other news programs in the Philippines, in business news or otherwise, and are now on our way to competing at the Grand Finals with our fellow regional peers,\" she added.\n\n> View this post on Instagram            A post shared by ONE News PH (@1newsph)\n\nMeanwhile, Gretchen Ho is this year’s National Winner for Best Factual Presenter for her insightful and comprehensive reporting on Morning Matters.Gretchen’s winning entry featured two key stories. The first was the on-the-ground report from the Vatican, where she delivered a self-shot video report following news of the late Pope Francis’ deteriorating health. The second was an in-studio interview where she discussed with Senate President Chiz Escudero critical legislative matters, including the then looming impeachment trial against Philippine Vice President Sara Duterte.Morning Matters is Gretchen’s first solo news-interview program, where she provides context to the biggest news stories by engaging with the day’s newsmakers from various fields with her trademark wit and charm. A former volleyball star turned broadcast journalist, she has become one of the country's most influential TV news personalities with more than five million social media followers.On receiving the award, Gretchen Ho said: “With the many events shaping our country and our world today, the responsibility of delivering the news has never been more important. Above all, truth must remain at the heart of that mission. Receiving this award is an immense honor. I am grateful to Cignal for allowing me to evolve in many ways as a broadcast journalist.“Cathy Yang and Gretchen Ho will now go on to represent the Philippines in the AACA Regional Finals, to be awarded at the Grand Awards Gala in Singapore on December 4.\n\nPolitics & Other News Features\n\n[Politics & Other News Features](https://www.onenews.ph/categories/3_politics-and-other-news-features)\n\n# One News Anchors Cathy Yang and Gretchen Ho Secure Top Honors at the Asian Academy Creative Awards 2025\n\nOneNews. PH\n\nOctober 2, 2025\n\nTwo leading anchors of Cignal’s premier news channel One News -- Cathy Yang and Gretchen Ho -- have won the national awards at the prestigious Asian Academy Creative Awards 2025 for their outstanding work in business and public affairs journalism.Money Talks with Cathy Yang was awarded Best News Program for its exceptional breaking news coverage and market analysis. In the winning episode, Cathy Yang provided authoritative and timely reporting on the Philippine President’s meeting with U.S. President Trump, which resulted in a 19% tariff for Philippines exports to the United StatesLaunched on February 10, 2025, Money Talks with Cathy Yang has set a new benchmark in Philippine business news reporting by leveraging on Cathy’s decades of local and international experience as a broadcast journalist. Last year, she was also the National Winner for Best Factual Presenter for the program Thought Leaders.“On behalf of my team, thank you AACA, for the honor to represent the Philippines,” says Cathy Yang. “We are immensely humbled that the judges have deemed us most outstanding among all other news programs in the Philippines, in business news or otherwise, and are now on our way to competing at the Grand Finals with our fellow regional peers,\" she added.\n\n> View this post on Instagram            A post shared by ONE News PH (@1newsph)\n\nMeanwhile, Gretchen Ho is this year’s National Winner for Best Factual Presenter for her insightful and comprehensive reporting on Morning Matters.Gretchen’s winning entry featured two key stories. The first was the on-the-ground report from the Vatican, where she delivered a self-shot video report following news of the late Pope Francis’ deteriorating health. The second was an in-studio interview where she discussed with Senate President Chiz Escudero critical legislative matters, including the then looming impeachment trial against Philippine Vice President Sara Duterte.Morning Matters is Gretchen’s first solo news-interview program, where she provides context to the biggest news stories by engaging with the day’s newsmakers from various fields with her trademark wit and charm. A former volleyball star turned broadcast journalist, she has become one of the country's most influential TV news personalities with more than five million social media followers.On receiving the award, Gretchen Ho said: “With the many events shaping our country and our world today, the responsibility of delivering the news has never been more important. Above all, truth must remain at the heart of that mission. Receiving this award is an immense honor. I am grateful to Cignal for allowing me to evolve in many ways as a broadcast journalist.“Cathy Yang and Gretchen Ho will now go on to represent the Philippines in the AACA Regional Finals, to be awarded at the Grand Awards Gala in Singapore on December 4.\n\n[View this post on Instagram](https://www.instagram.com/p/DPOOYpdkmzo/?utm_source=ig_embed&utm_campaign=loading)A post shared by ONE News PH (@1newsph)\n\nLatest News ‘IT WAS LOVE’: Teen, Red Cross Responder Die Saving Kin In Quake Quake Survivor: I Kept Calling Out Their Names Phivolcs: Aftershocks Could Last For Weeks; Search And Rescue Efforts Halted Trillion Peso March Organizers Staging Protest On Nov. 30 Severe Tropical Storm Paolo To Bring Heavy Rains, Strong Winds; Signal No. 3 Up In Some Areas ICC: Experts Ready To Assess Duterte’s Health Magalong On Leaving ICI: I Struck A Nerve NEWS IN CONTEXT | A Template For Regime Change Rescuers Hunt For Survivors After Philippines’ Deadliest Quake In Over A Decade Kills At Least 69 Cebu Quake Likely Caused By Fault That Had Not Moved For 400 Years; More Than 900 Aftershocks Detected – Phivolcs onefeed Show more onefeed Top headlines from the OneNews network\n\nLatest News ‘IT WAS LOVE’: Teen, Red Cross Responder Die Saving Kin In Quake Quake Survivor: I Kept Calling Out Their Names Phivolcs: Aftershocks Could Last For Weeks; Search And Rescue Efforts Halted Trillion Peso March Organizers Staging Protest On Nov. 30 Severe Tropical Storm Paolo To Bring Heavy Rains, Strong Winds; Signal No. 3 Up In Some Areas ICC: Experts Ready To Assess Duterte’s Health Magalong On Leaving ICI: I Struck A Nerve NEWS IN CONTEXT | A Template For Regime Change Rescuers Hunt For Survivors After Philippines’ Deadliest Quake In Over A Decade Kills At Least 69 Cebu Quake Likely Caused By Fault That Had Not Moved For 400 Years; More Than 900 Aftershocks Detected – Phivolcs\n\n‘IT WAS LOVE’: Teen, Red Cross Responder Die Saving Kin In Quake Quake Survivor: I Kept Calling Out Their Names Phivolcs: Aftershocks Could Last For Weeks; Search And Rescue Efforts Halted Trillion Peso March Organizers Staging Protest On Nov. 30 Severe Tropical Storm Paolo To Bring Heavy Rains, Strong Winds; Signal No. 3 Up In Some Areas ICC: Experts Ready To Assess Duterte’s Health Magalong On Leaving ICI: I Struck A Nerve NEWS IN CONTEXT | A Template For Regime Change Rescuers Hunt For Survivors After Philippines’ Deadliest Quake In Over A Decade Kills At Least 69 Cebu Quake Likely Caused By Fault That Had Not Moved For 400 Years; More Than 900 Aftershocks Detected – Phivolcs\n\n[‘IT WAS LOVE’: Teen, Red Cross Responder Die Saving Kin In Quake](https://www.onenews.ph/articles/it-was-love-teen-red-cross-responder-die-saving-kin-in-quake)[Quake Survivor: I Kept Calling Out Their Names](https://www.onenews.ph/articles/quake-survivor-i-kept-calling-out-their-names)[Phivolcs: Aftershocks Could Last For Weeks; Search And Rescue Efforts Halted](https://www.onenews.ph/articles/phivolcs-aftershocks-could-last-for-weeks-search-and-rescue-efforts-halted)[Trillion Peso March Organizers Staging Protest On Nov. 30](https://www.onenews.ph/articles/trillion-peso-march-organizers-staging-protest-on-nov-30)[Severe Tropical Storm Paolo To Bring Heavy Rains, Strong Winds; Signal No. 3 Up In Some Areas](https://www.onenews.ph/articles/severe-tropical-storm-paolo-to-bring-heavy-rains-strong-winds-signal-no-3-up-in-some-areas)[ICC: Experts Ready To Assess Duterte’s Health](https://www.onenews.ph/articles/icc-experts-ready-to-assess-duterte-s-health)[Magalong On Leaving ICI: I Struck A Nerve](https://www.onenews.ph/articles/magalong-on-leaving-ici-i-struck-a-nerve)[NEWS IN CONTEXT | A Template For Regime Change](https://www.onenews.ph/articles/news-in-context-a-template-for-regime-change)[Rescuers Hunt For Survivors After Philippines’ Deadliest Quake In Over A Decade Kills At Least 69](https://www.onenews.ph/articles/rescuers-hunt-for-survivors-after-philippines-deadliest-quake-in-over-a-decade-kills-at-least-69)[Cebu Quake Likely Caused By Fault That Had Not Moved For 400 Years; More Than 900 Aftershocks Detected – Phivolcs](https://www.onenews.ph/articles/cebu-quake-likely-caused-by-fault-that-had-not-moved-for-400-years-more-than-900-aftershocks-detected-phivolcs)\n\nonefeed Show more onefeed Top headlines from the OneNews network\n\nonefeed Show more\n\nonefeed\n\nShow more\n\n[Show more](#)\n\n[Politics & Other News Features](https://www.onenews.ph/categories/3_politics-and-other-news-features)\n\n### ‘IT WAS LOVE’: Teen, Red Cross Responder Die Saving Kin In Quake\n\nOctober 3, 2025 Reuters News Agency, Associated Press\n\n[Quake Survivor: I Kept Calling Out Their Names](https://www.onenews.ph/articles/quake-survivor-i-kept-calling-out-their-names)[Phivolcs: Aftershocks Could Last For Weeks; Search And Rescue Efforts Halted](https://www.onenews.ph/articles/phivolcs-aftershocks-could-last-for-weeks-search-and-rescue-efforts-halted)[Trillion Peso March Organizers Staging Protest On Nov. 30](https://www.onenews.ph/articles/trillion-peso-march-organizers-staging-protest-on-nov-30)[ICC: Experts Ready To Assess Duterte’s Health](https://www.onenews.ph/articles/icc-experts-ready-to-assess-duterte-s-health)\n\n[Youth & Education](https://www.onenews.ph/categories/4_youth-and-education)\n\n### DepEd: 1,000 DPWH-Built Classrooms ‘Unusable’\n\nSeptember 20, 2025 Bella Cariaso\n\n[DepEd To Open Transparency Portal](https://www.onenews.ph/articles/deped-to-open-transparency-portal)[DepEd, PNP Chiefs Tackle Violence In Schools](https://www.onenews.ph/articles/deped-pnp-chiefs-tackle-violence-in-schools)[PANOORIN: Ano Posibleng Sanhi Ng Sunod-Sunod Na School Violence?](https://www.onenews.ph/articles/panoorin-ano-posibleng-sanhi-ng-sunod-sunod-na-school-violence)[Stricter Preventive Measures Sought Against School Violence](https://www.onenews.ph/articles/stricter-preventive-measures-sought-against-school-violence)\n\n[Business & Innovations](https://www.onenews.ph/categories/5_business-and-innovations)\n\n### RCBC: 65 Years Of Progress, 65 Years Of Trust\n\nSeptember 23, 2025 OneNews. PH\n\n[Grab Launches Grab Asenso: A Digital Diskarte Program To Accelerate Regional MSME Digitalization In The Philippines](https://www.onenews.ph/articles/grab-launches-grab-asenso-a-digital-diskarte-program-to-accelerate-regional-msme-digitalization-in-the-philippines)[Big Heart, Bigger Cake: Celebrate With Red Ribbon Dedication Cakes](https://www.onenews.ph/articles/big-heart-bigger-cake-celebrate-with-red-ribbon-dedication-cakes)[Roxas and Company, Inc. Notice Of Annual Meeting Of Stockholders](https://www.onenews.ph/articles/roxas-and-company-inc-notice-of-annual-meeting-of-stockholders-09-05-2025)[Jollibee Group Bounces Back In Q2](https://www.onenews.ph/articles/jollibee-group-bounces-back-in-q2)\n\n[Science, Health & Environment](https://www.onenews.ph/categories/6_science-health-and-environment)\n\n### Severe Tropical Storm Paolo To Bring Heavy Rains, Strong Winds; Signal No. 3 Up In Some Areas\n\nOctober 3, 2025 Christine Boton\n\n[LPA Enters PAR; Rains Expected Over Luzon, Visayas](https://www.onenews.ph/articles/lpa-enters-par-rains-expected-over-luzon-visayas)[At Least 10 Dead As Opong Batters Bicol, Eastern Visayas, Mimaropa; Masbate ‘Hardest Hit’](https://www.onenews.",
      "source": "News Source",
      "date": "2025-10-03T10:12:41.108Z"
    },
    {
      "title": "Ontario cinema cancels South Asian film screenings after arson attempt, shooting - North Shore News",
      "url": "https://www.nsnews.com/film-news/ontario-cinema-cancels-south-asian-film-screenings-after-arson-attempt-shooting-11298259?utm_source=valyu.network&utm_medium=referral&utm_campaign=ai_pilot&utm_content=ai_query",
      "image_url": {
        "0": "https://www.vmcdn.ca/f/files/shared/feeds/cp/2025/10/096936acbccf3ec1ce849c6577909fb1498ee8fce7a8ff8fca854d36377b5e47.jpg;w=1200;h=800;mode=crop",
        "1": "https://www.vmcdn.ca/f/files/shared/feeds/cp/2025/10/096936acbccf3ec1ce849c6577909fb1498ee8fce7a8ff8fca854d36377b5e47.jpg;w=960",
        "2": "https://www.nsnews.com/images/blank.gif"
      },
      "content": "- Home\n\n- Film News\n\n# Ontario cinema cancels South Asian film screenings after arson attempt, shooting\n\n- Share by Email\n\n- Share on Facebook\n\n- Share on X\n\n- Share on LinkedIn\n\n- Print\n\n- Share via Text Message\n\nOAKVILLE — A cinema west of Toronto says it is cancelling screenings of South Asian films after an arson attempt and a shooting on its property in the past week.\n\nFilm.Ca Cinemas says both incidents at its Oakville, Ont., location occurred overnight while the theatre was closed and no one was injured.\n\nIt says the incidents \"may be connected to disagreements\" within the South Asian film industry and it made the difficult decision to pull the screenings for the safety of its staff and guests.\n\nHalton police say they are investigating after two suspects used a flammable liquid to set the theatre's entrance doors on fire on Sept. 25, although the blaze remained contained and didn't cause significant damage.\n\nPolice say that in the second incident shortly before 2 a.m. on Thursday, a suspect approached the cinema's front entrance and fired a handgun multiple times through the doors.\n\nAnyone with information is asked to contact investigators.\n\n\"We remain open for business and will fully co-operate with and assist law enforcement in retrieving any information about the perpetrator and conspirator and bringing them to justice — because this just cannot stand,\" Jeff Knoll, CEO of Film.Ca Cinemas, said in a statement.\n\n\"We recognize that many guests had eagerly anticipated these films, and we sincerely regret any inconvenience and disappointment this decision may cause.\"\n\nSimilar incidents, many of them involving drive-by shootings, have previously been reported at other theatres in the Greater Toronto Area and in British Columbia.\n\nSome distributors of South Indian films in Canada have alleged that there is an ongoing campaign to prevent popular movies from appearing in Canadian theatre chains as part of an effort to control the market and safeguard profits.\n\nThis report by The Canadian Press was first published Oct. 3, 2025.\n\nThe Canadian Press\n\n- See a typo/mistake?\n\n- Have a story/tip?\n\n## This has been shared 0 times\n\n- 0 Shares\n\n- Share by Email\n\n- Share on Facebook\n\n- Share on X\n\n- Share on LinkedIn\n\n- Print\n\n- Share via Text Message\n\n## Is North Vancouver's local news important to you?\n\n## More Film News",
      "source": "News Source",
      "date": "2025-10-03T10:12:41.108Z"
    },
    {
      "title": "Oakville movie theatre pulls South Asian screening following fire, shooting",
      "url": "https://www.ctvnews.ca/toronto/local/halton/article/south-asian-film-screenings-cancelled-at-oakville-movie-theatre-following-targeted-fire-and-shooting/?utm_source=valyu.network&utm_medium=referral&utm_campaign=ai_pilot&utm_content=ai_query",
      "image_url": {
        "0": "https://www.ctvnews.ca/resizer/v2/JRNNQY7SYRAB3OIYHPHULVGMNQ.png?smart=true&auth=7fb552921bcfaf98f350eba3ea2891f310ce22f26bbfb79da27dabaf4a71d4a5&width=1200&height=630",
        "1": "https://sb.scorecardresearch.com/p?c1=2&c2=3005664&cv=4.4.0&cj=1",
        "2": "https://www.ctvnews.ca/resizer/v2/https%3A%2F%2Fcloudfront-us-east-1.images.arcpublishing.com%2Fbellmediainc%2F73ADFPGONBALVCYIY27S4YVKM4.jpg?smart=true&auth=2e8c8b7cdedd5ec7dc5159ad28e7f22c4b40fd8b493cdf3acbf646b7e46217c1&width=600",
        "3": "https://www.ctvnews.ca/resizer/v2/https%3A%2F%2Fcloudfront-us-east-1.images.arcpublishing.com%2Fbellmediainc%2FCEGI7MW2IFAOVCRPX46SKRWCPE.jpg?smart=true&auth=5ead23a782403bd4716ab70004d89fbedf00922449b1690669f1de9adcd45ac8&width=600",
        "4": "https://www.ctvnews.ca/resizer/v2/BCZZUY26ZH6UKVLKSF7YFVCOXA.jpg?smart=true&auth=bb1b73b5845223cf690b8c7b5c7a4cfd8d7e67decc022a9848cda28236a02db2&width=800&height=450"
      },
      "content": "# South Asian film screenings cancelled at Oakville movie theatre following ‘targeted’ fire and shooting\n\nPublished: October 02, 2025 at 3:38PM EDT\n\n## Toronto Blue Jays to face New York Yankees in AL Division Series\n\n## Toronto home sales rose 8.5% in September as prices decline\n\n## ‘Devastating’: Community reeling after fatal crash during Okanagan Granfondo\n\n## UBC students call on feds, province to commit to SkyTrain extension to campus\n\n## Alberta baby dies from measles\n\n## Alberta Teachers’ Association says ‘nothing new to report’ as strike looms; province urges return to talks\n\n## Ottawa city councillor pushing to keep school zone photo radars\n\n## Striking support staff block vehicle entrances to Algonquin College\n\n## Montreal municipal candidate facing domestic violence charges, booted from party\n\n## Quebec police officers pull man out of burning car alive\n\n## ‘This is not freedom’: Teen convicted of manslaughter granted early release to house arrest\n\n## Stony Plain Road businesses hoping to whip up more customers with dining week\n\n## NS Power expects full recovery from cyberattack by early 2026: report\n\n## N.B. wild blueberry crop drops by tens of millions of pounds: executive\n\n## Personal care home in dispute with WRHA once again admitting residents\n\n## First phase of St. Boniface Hospital ER expansion opens to public\n\n## Woman killed, man seriously injured in single-vehicle rollover on Sask. highway\n\n## Sask. softball player heading to Argentina for Pan Am qualifiers\n\n## Waterloo regional councillor proposes pause on speed camera program expansion\n\n## Amazon to hire 180 people in Cambridge for holiday season\n\n## Saskatoon man receives one of the longest voyeurism sentences ever imposed\n\n## Sask. dancers gather in Saskatoon to learn from Ukrainian pros\n\n## North Bay suspect started punching woman as she sat in her truck\n\n## Police seeking suspect in Timmins structure fire\n\n## Serious collision involving motorcycle in Central Elgin\n\n## Smoke fills sky east of London as blaze levels 45-year-old farm building\n\n## Driver faces series of charges after multiple vehicles struck\n\n## Barrie’s Bayfield Street slated for major upgrades\n\n## Suspicious package in South Windsor: WPS\n\n## Unifor ordered to end blockade of Windsor factory\n\n## ‘Made me tear up’: Fundraising campaign launched to buy robot legs for young boy with cerebral palsy\n\n## BCGEU expands pickets at another two dozen sites\n\n## Sask. premier behind Alberta’s west coast pipeline plans\n\n## Man convicted in deadly shooting near Surrey, B.C., elementary school\n\n## U.K. police release names of Manchester synagogue attack victims as police probe suspect’s links\n\n## Sarah Mullally named the first female Archbishop of Canterbury in history of Church of England\n\n### Liberal MP says it’s time to stop the clock on daylight time\n\n### Liberals roll out Defence Investment Agency to speed up military purchasing\n\n### LeBlanc hopes for progress on sectoral deals before CUSMA review starts\n\n### EXCLUSIVE: Enbridge CEO: Canada standing in its own way in becoming an energy superpower\n\n### Musk reports Tesla sales jump after months of boycotts, but experts suspect the pain is not over yet\n\n### Canada-bound commercial trucks face long lines at border crossings due to processing delays\n\n### ‘Absolutely no privacy’: Sask. woman treated in hospital hallway for two days\n\n### U.S. FDA approves another generic abortion pill, prompting outrage from conservatives\n\n### WHO urges ramping up arms race against drug-resistant superbugs\n\n### Lori Loughlin and Mossimo Giannulli separate after nearly 28 years of marriage\n\n### Trump ally threatens immigration sweep at Bad Bunny Super Bowl show\n\n### On eve of sentencing, Combs tells judge he has been ‘reborn,’ asks for mercy\n\n### FIFA reveals official match ball ahead of 2026 World Cup\n\n### Roger Craig, Ken Anderson advance for Pro Football Hall of Fame’s Class of 2026\n\n### ‘If you like fashion, go ahead’: NHL entering era of relaxed player dress code\n\n### Caribbean cruise passengers upset itinerary was changed to Boston and Maine due to hurricanes\n\n### Canadians in prestigious competition for world’s top young pianists\n\n### Lower-cost and easy ways for homeowners to beat the winter chill\n\n### Typhoon blows into Philippines, complicating disaster response after quake and storms\n\n### Imelda weakens after downing trees and power lines in Bermuda as a hurricane\n\n### Earthquake with preliminary 5 magnitude shakes Istanbul, causing panic\n\n### Rogue planet has a record growth rate of 6.6 billion tons per second\n\n### Interstellar comet swinging past Mars as a fleet of spacecraft looks on\n\n### Google says hackers are sending extortion emails to executives\n\n### Ford recalls thousands of vehicles over this issue\n\n### Nearly 44,000 SUVs recalled in Canada over detaching seatbelts\n\n### Stellantis detects breach at third-party provider for North American customers\n\n### More than 8,000 rare novelty teapots up for sale in the U.K.\n\n### Travel to these awe-inspiring national parks with stunning views\n\n### 2025 SOCAN Awards held in Toronto\n\n## Shopping Trends\n\n### Amazon October Prime Day 2025: Everything You Need To Know About Prime Big Deal Days In Canada\n\n### 10 Gift Wrap Organizers To Order Before The Holiday Chaos Begins\n\n### The Absolute Best Callus Removers For Feet You Can Get In Canada Right Now\n\n### The Good Stuff: Makeover Your Closet With These 7 Space-Saving Storage Solutions\n\n### 14 Eco-Friendly Cleaning Products That Are Both Affordable And Effective\n\n### 20 Things From Amazon Canada That CTV Shopping Trends Readers Loved Ordering In September\n\n### 25 Great Beauty Products From Amazon Canada That Cost Less Than $20\n\n### Little Luxuries Are Important, So Let Me Introduce You To A Few Of Our Favourite Body Scrubs And Exfoliants From Canadian Brands\n\n### I Tried It: This Canadian-Made Hair Wax Stick Is My Secret Weapon For No-Wash Days\n\n### In Case You Missed It: These YETI Products Are Still Majorly On Sale On Amazon Canada\n\nThe Shopping Trends team is independent of the journalists at CTV News. We may earn a commission when you use our links to shop. Read about us.",
      "source": "News Source",
      "date": "2025-10-03T10:12:41.108Z"
    },
    {
      "title": "South-East Asia is being swamped with Chinese goods",
      "url": "https://www.economist.com/asia/2025/10/02/south-east-asia-is-being-swamped-with-chinese-goods?utm_source=valyu.network&utm_medium=referral&utm_campaign=ai_pilot&utm_content=ai_query",
      "image_url": {
        "0": "https://www.economist.com/content-assets/images/20251004_ASD002.jpg",
        "1": "https://www.economist.com/cdn-cgi/image/width=1424,quality=80,format=auto/content-assets/images/20251004_ASD002.jpg",
        "2": "https://www.economist.com/cdn-cgi/image/width=1424,quality=80,format=auto/content-assets/images/20251004_DE_US.jpg",
        "3": "https://www.economist.com/cdn-cgi/image/width=1424,quality=80,format=auto/content-assets/images/20251004_ASP001.jpg"
      },
      "content": "### undefined undefined\n\n# South-East Asia is being swamped with Chinese goods\n\n## It is adding to the pain from Trump’s tariffs\n\nGrand promises are standard fare for the Association of South-East Asian Nations (ASEAN). The latest came after a meeting of the bloc’s economic ministers last month in Kuala Lumpur, Malaysia’s capital. It was a vow to build a “trade and investment ecosystem that is open, resilient and future-ready”. This time, though, the lofty goal was rooted in a sense of real urgency.\n\n### Explore more\n\nThis article appeared in the Asia section of the print edition under the headline “Trade headaches”\n\n### From the October 4th 2025 edition\n\n## More from Asia\n\n### Essential India Newsletter: What Britain can learn from Aadhaar\n\nLeo Mirani, our Asia correspondent, considers the lessons from 15 years of India’s digital-ID system\n\n### Australia’s post-China hangover\n\nThe country grew rich on Chinese demand. Now it must find a new model for growth\n\n### Japanese politics heats up\n\nIt could get its youngest prime minister, or its first female one\n\n### Can India strike a deal on Russian oil to appease America?\n\nIt could help halt the downward spiral in relations between the two countries\n\n### Women’s cricket in India is taking off\n\nDespite being neglected\n\n### Takaichi Sanae, the hardline nationalist who may soon lead Japan\n\nShe would be the country’s first woman prime minister—and pull its politics sharply to the right",
      "source": "News Source",
      "date": "2025-10-03T10:12:41.108Z"
    }
  ],
  "timestamp": 1759486361108
}